{
  "stories": [
    {
      "title": "世界末日",
      "author": "〔美国〕贝内特·柯夫",
      "content": "一个飞行员被派遣到地球的另一端去执行任务，当他返回基地时，四周一片死寂。所有的事物井然有序得可怕，干净得没有一点生命的迹象。他惊疑恐惧地找遍了街头巷尾，根本连半个人影或任何动物也没有。他惶恐地奔回机场，加油、起飞。飞过纽约、伦敦、莫斯科、上海，以前曾经飞过的地方，现在竟然也变成一座座死城了。他领悟到自己是世界上惟一的幸存者了！仔细思索着当下的情况，他认为独活在这个世界上根本无法忍受。因此，他决定自杀。他吞下一整瓶毒药，静待着死亡来合上自己的眼帘。药力缓缓渗入他的脑髓，缓缓浸透他的胸膛……\n\n正当地狱之门缓缓开启的那一瞬间，他忽然听到一种熟悉的声音——电话铃响了。",
      "extracted_info": {
        "background": "一个飞行员在执行任务后返回地球，发现所有人类和动物都神秘消失，全球城市变成死寂的空城。在确认自己是唯一幸存者后，因无法忍受孤独而吞毒自杀，却在濒死之际听到电话铃声。",
        "characters": [
          {
            "name": "飞行员",
            "description": "被派遣执行任务的军人，任务结束后发现文明崩溃。具有强烈孤独耐受阈值，在绝对寂静中理性崩溃选择自杀，却在死亡临界点遭遇逆转性事件（电话铃声）"
          }
        ],
        "intermediate_reasoning": "好的，我需要从用户提供的章节内容中提取主要剧情背景和角色名称及特征，并以JSON格式返回。首先，我需要仔细阅读章节内容，理解故事的发展。\n\n章节内容讲述了一个飞行员被派到地球另一端执行任务，返回后发现基地和各大城市都空无一人，所有生命迹象消失。他成为唯一的幸存者，无法忍受孤独决定自杀，但在服毒后濒死时听到电话铃声。\n\n首先，提取背景。主要剧情背景是飞行员任务归来发现全球人类和动物消失，成为唯一幸存者，在绝望中自杀时被电话铃声打断。\n\n接下来是角色。这里的主要角色是飞行员，他是唯一的幸存者。描述应包括他的职业、经历和当前状态：执行任务返回后发现世界荒芜，陷入绝望而自杀，但被电话铃声打断。\n\n需要确保JSON结构正确，包含\"background\"和\"characters\"两个键，其中characters是列表，每个元素有\"name\"和\"description\"。没有其他角色出现，所以只有飞行员一个角色。\n\n检查是否遗漏信息。章节中没有提到其他角色或名字，所以只需处理飞行员。确认背景描述准确，涵盖关键点：任务、返回后的发现、全球死寂、自杀和电话铃声。\n\n最后，确保JSON格式正确，没有多余内容，不使用Markdown，只输出JSON。检查键名是否正确，描述是否简洁明确。\n"
      },
      "generated_levels": [
        {
          "level": 1,
          "description": "飞行员在基地外围的废弃街道中徘徊，每栋建筑的门窗都诡异地紧闭，风中隐约传来如叹息般的回声。他必须在物资耗尽的倒计时内，从反锁的仓库中获取生存补给，并在探索中抵抗逐渐加深的幻觉侵扰。",
          "pass_condition": "在理性值归零前同时达成：1.获取三罐军用压缩粮 2.破解无线电室密码获取末次通讯记录",
          "level_image": "https://sc-maas.oss-cn-shanghai.aliyuncs.com/outputs/280f4c37-8ae8-4199-a87a-cbb85f7b2c6c_0.png?OSSAccessKeyId=LTAI5tQnPSzwAnR8NmMzoQq4&Expires=1738847013&Signature=6F1%2B%2BJr5YnGRvIFzoIXPr8xXpCs%3D"
        },
        {
          "level": 2,
          "description": "驾驶战斗机飞跃大西洋时，仪表盘突然集体失灵。下方海面持续传来有规律的闪光信号，成群结队的座头鲸正用尾鳍拍打出摩斯密码的节奏。燃料仅够维持三小时航程的驾驶舱里，氧气含量却在不断下降。",
          "pass_condition": "通过鲸群提供的坐标修正航线，在缺氧昏迷前抵达纽约自由女神像顶部临时停机坪",
          "level_image": "https://sc-maas.oss-cn-shanghai.aliyuncs.com/outputs/87cb0516-5600-4305-9521-f317a9c5b105_0.png?OSSAccessKeyId=LTAI5tQnPSzwAnR8NmMzoQq4&Expires=1739200821&Signature=%2F4N5PFWu4k7ymo7ObITBEcH1ubA%3D"
        },
        {
          "level": 3,
          "description": "莫斯科红场的列宁墓裂开巨大地缝，某种工业级发电机的轰鸣声从深处传来。四具穿着苏联军装的骷髅守卫着地底发电机，它们的眼窝里跳动着蓝色电弧。空气里漂浮着能灼伤呼吸道的金属粉尘。",
          "pass_condition": "在不杀死任何骷髅守卫的前提下，用冷冻灭火剂制造通道获取钚电池，修复克里姆林宫顶端的信号发射塔"
        },
        {
          "level": 4,
          "description": "上海外滩所有摩天楼的玻璃幕墙同步播放着飞行员生平影像，东方明珠塔顶悬停着架黑色卫星电话。前往塔顶的路途中，成群变异白蚁正在啃食建筑承重结构，突如其来的海啸预警倒计时在楼群间闪烁。",
          "pass_condition": "利用声波驱虫器制造安全路径，在建筑物倒塌与海啸抵达的时间差中，携带卫星电话撤至金茂大厦88层观景台"
        },
        {
          "level": 5,
          "description": "当电话接通的瞬间，四百二十七个文明幸存者的面孔在视网膜上同时闪现，他们正被困在喜马拉雅山脉某处粒子对撞机改造的避难所里。飞行员必须用战斗机最后的燃料完成三次风险递增的抉择：穿越雷暴云团、抵挡自我了断的诱惑、向卫星群发送反向定位信号。",
          "pass_condition": "在同时满足三次抉择的成功率不超过17%、42%、83%的悖论条件下，构建出可破解量子加密的幸存者坐标"
        }
      ]
    },
    {
      "title": "快乐",
      "author": "〔俄〕库普林",
      "content": "一个大皇帝召他国中的许多诗人和哲人到他的面前。他用这个难题问他们:\"怎样才是快乐了？\"第一个人慌忙答道:\"是这样，要常常能看见上帝般的脸上的光辉，还要永远感觉。\\n\\n大皇帝冷冷地说道:\"挖去他的眼睛。换一个上来。\"\\n\\n第二个上前高声奏道:\"有权力才是快乐。您大皇帝陛下，是快乐的。\"\\n\\n但是皇帝答了他一个苦笑说:\"不相干，我身子害病，可没有权力去医好他。拔去他的鼻子，这个光棍。换一个。\"\\n\\n接着上来的害怕地说道:\"快乐就是财产。\"\\n\\n但是皇帝答他说:\"我很富有，却偏是我问这句话。给你一块黄金和你的头一样重好不好？\"\\n\\n\"啊呀，陛下！\"\\n\\n\"你应该得的。替他在头上缚一块黄金和他的头一样重，把这个叫花子抛在海里。\"\\n\\n皇帝焦躁着喊道:\"第四个。\"\\n\\n于是有一个人穿着褴褛的衣服、火红着眼睛匍匐上前，吃吃的说道:\"唉！至聪明的陛下！我盼望得很少。我很饿，给了我满足，我就可以快乐了，要跑遍天下的去传扬陛下的仁德。\"\\n\\n皇帝很嫌恶的说:\"喂他，他若饱死了的时候，报给我知道。\"\\n\\n又另外上来了两个，一个是壮健的运动家，玫瑰红的肌肤，低平的额头。他叹息一声说道:\"快乐是在诗的中间哩。\"\\n\\n还有一个是枯瘦憔悴的诗人，两颊正在发烧，他说:\"快乐是在健康中间。\"\\n\\n但是皇帝惨然微笑告诉他们说:\"我若有本领交换了你们两个人的命运，那么，诗人啊，你不到一个月就会哀求要才思。而你，海格尔士（古勇士）的化身，就要到医生那边去讨丸药请他减轻你的体重了。都安安稳稳的去吧。还有什么人？\"第七个身上佩着水仙花傲然的喊道:\"还有一个浮生在此。快乐是在太虚之中的。\"\\n\\n皇帝懒懒的传谕道:\"割去他的头。\"\\n\\n那蒙罪的人立刻变得比他的水仙花更灰白了。他哆嗦的说道:\"皇帝，皇帝陛下，饶恕我吧！我说的不是这个意思啊。\"\\n\\n但是皇帝很厌倦地摇他的手，呵欠着柔声说道\"带他下去，割去他的头。皇帝的话是和玛瑙一般硬的。\"\\n\\n又来了许多旁的人。有一个人只说了几个字:\"女人的恋爱。\"\\n\\n皇帝准了他，说道:\"很好。把我国境内最美丽的妇人和女郎挑一百个给他。但是再给他一杯毒药酒。等那时候到了来报给我知道，我要看看他的尸体。\"\\n\\n另一个说:\"我所有的欲望若能立刻办到，那就快乐了。\"\\n\\n皇帝很狡猾的问他:\"那么你现在有什么欲望呢？\"\\n\\n\"我么？\"\\n\\n\"是啊你。\"\\n\\n\"陛下……这问题太出我意料之外了。\"\\n\\n\"活埋了他。唉，还有聪明的人么？好，好，走近些，你恐怕知道快乐在那里吧？\"这聪明的人——因为他实在是一个聪明的人——答道:\"快乐是在人类思想的可爱。\"\\n\\n皇帝的眉毛皱锁了，他怒声喊道:\"喝！人类思想！什么是人类思想？\"但是这聪明的人——因为他真是一个聪明的人——只温然的微笑，并不回答。于是皇帝命令他到地下的监狱里，那边只有永远的黑暗，并且没有一些外边的声音可以给他听见。一年之后，他变了聋盲的人，并且不能站立了，他们带他去见皇帝，他回答皇帝:\"哦，你现在还快乐么？\"那个问题，用下面这几句话:\"是的，我快乐。在牢狱的时候，我是一个皇帝，是一个富人，是在恋爱之中，我饱食，我饥饿——凡这些都是我的思想给我的。\"\\n\\n皇帝很不耐烦地喊道:\"那么，思想到底是什么东西呢？你好生记着，再延长五分钟我就要绞死你，把唾沫唾在你那张狗脸上。到那时你的思想还能够安慰你么？到那时你在地面上浪费的思想还能够存在么。\"\\n\\n这聪明的人坦然回答，因为他是一个真聪明的人，说:\"蠢材，思想是不朽的。\"",
      "extracted_info": {
        "background": "一个大皇帝召集国内的众多诗人和哲人，询问他们“怎样才是快乐”。每个回答者均因答案不符合皇帝心意而遭受残酷惩罚，最终一个聪明人提出‘思想不朽’的观点，即便被囚禁折磨仍坚持己见。",
        "characters": [
          {
            "name": "第一个回答者",
            "description": "认为快乐是‘看见上帝般的脸上的光辉’，被皇帝下令挖去双眼。"
          },
          {
            "name": "第二个回答者",
            "description": "声称‘权力是快乐’，因皇帝不满其答案被拔去鼻子。"
          },
          {
            "name": "第三个回答者",
            "description": "主张‘财产即快乐’，被皇帝下令抛入海中并绑上黄金。"
          },
          {
            "name": "第四个回答者",
            "description": "饥饿的褴褛者，乞求饱腹后被皇帝下令喂食至饱死。"
          },
          {
            "name": "运动家",
            "description": "壮健、玫瑰红肌肤、低平额头，认为‘快乐在诗中’，被皇帝预言将因健康问题求医。"
          },
          {
            "name": "憔悴诗人",
            "description": "枯瘦、两颊发烧，主张‘快乐在健康中’，被皇帝预言会为才思枯竭而哀求。"
          },
          {
            "name": "水仙花佩带者",
            "description": "傲然宣称‘快乐在太虚中’，因触怒皇帝被下令斩首。"
          },
          {
            "name": "恋爱论者",
            "description": "提出‘女人的恋爱是快乐’，被赐予百名美女后需饮毒酒。"
          },
          {
            "name": "欲望满足者",
            "description": "认为‘满足欲望即快乐’，因无法回答当前欲望被活埋。"
          },
          {
            "name": "聪明人",
            "description": "坚持‘快乐在人类思想的可爱’，被囚禁致残后仍断言思想不朽，最终激怒皇帝。"
          }
        ],
        "extracted_intermediate_reasoning": "好的，我现在需要从用户提供的章节内容中提取主要剧情背景和角色名称及其特征，并以JSON格式返回。首先，我要仔细阅读整个章节内容，理解故事的情节和出现的角色。\n\n首先，剧情背景方面，故事讲的是一个大皇帝召集国内的许多诗人和哲人，问他们“怎样才是快乐？”每个回答的人都被皇帝处以不同的刑罚，直到最后一个聪明的人提出思想的重要性，尽管被囚禁折磨，仍然坚持思想不朽的观点。所以背景应该概括皇帝不断质问并惩罚提出不同答案的人，最后探讨思想的价值。\n\n接下来是角色部分。需要逐一找出每个回答的人及其描述。第一个回答的人说“看见上帝般的脸上的光辉”，结果被挖去眼睛。第二个说有权力，被拔去鼻子。第三个说财产，被抛入海。第四个说饥饿得到满足，被喂食至饱死。第五个是运动家，说快乐在诗中，第六个是憔悴诗人，说在健康中，皇帝让他们交换命运。第七个佩水仙花的人说在太虚中，被砍头。第八个说女人的恋爱，得到美女但被赐毒酒。第九个想满足欲望，被活埋。最后是聪明的人，回答思想，被囚禁但坚持思想不朽。\n\n角色列表需要包括每个角色的名字和描述。注意有些角色没有名字，比如前几个可能用“第一个回答者”之类的，但原文中有些可能有特征描述，比如“穿着褴褛的衣服、火红着眼睛”的第四个，或者“壮健的运动家，玫瑰红肌肤，低平额头”的第五个，以及“枯瘦憔悴的诗人，两颊发烧”的第六个，还有第七个“佩着水仙花”，第八个提到“女人的恋爱”，第九个“有欲望”，最后是聪明的人。\n\n需要确保每个角色都被正确提取，并且描述准确。注意有些角色可能没有名字，需要用描述代替名字。例如，可能用“运动家”和“诗人”作为名字，或者根据他们的回答内容来命名。例如，第四个可以称为“饥饿者”，第五个是“运动家”，第六个是“诗人”等。\n\n然后，将所有这些整理成JSON格式，包含background和characters两个键。每个角色对象包含name和description。注意用户要求严格JSON，不加额外说明，所以必须确保格式正确，没有语法错误。\n\n现在需要检查是否有遗漏的角色，比如是否有其他回答者没有被提到。例如，第七个之后还有其他人，但可能用户只关注主要角色。根据原文，除了前几个，还有第七个到第九个，以及最后的聪明人。需要确认所有提到的回答者都被包括在内。\n\n最后，验证JSON结构是否正确，键名是否正确，是否使用双引号，列表是否正确闭合等。确保没有遗漏任何角色，描述准确反映他们的特征和结局。\n"
      },
      "generated_levels": []
    },
    {
      "title": "逗乐",
      "author": "〔法〕莫泊桑",
      "content": "世界上有什么比开玩笑更有趣、更好玩？有什么事情比戏弄别人更有意思？啊！我的一生里，我开过玩笑。人们呢，也开过我的玩笑，很有趣的玩笑！对啦，我可开过令人受不了的玩笑。今天我想讲一个我经历过的玩笑。秋天的时候，我到朋友家里去打猎。当然喽，我的朋友是一些爱开玩笑的人。我不愿结交其他人。我到达的时候，他们像迎接王子那样接待我。这引起了我的怀疑。他们朝天打枪；他们拥抱我，好像等着从我身上得到极大的乐趣。我对自己说:\"小心，他们在策划着什么。\"\\n\\n吃晚饭的时候，欢乐是高度的，过头了。我想,\"瞧，这些人没有明显的理由却那么高兴，他们脑子里一定想好了开一个什么玩笑。肯定这个玩笑是针对我的。小心。\"\\n\\n整个晚上人们在笑，但笑得夸张。我嗅到空气里有一个玩笑，正像豹子嗅到猎物一样。我既不放过一个字，也不放过一个语调、一个手势。在我看来一切都值得怀疑。时钟响了，是睡觉的时候了，他们把我送到卧室。他们大声冲我喊晚安。我进去，关上门，并且一直站着，一步也没有迈，手里拿着蜡烛。我听见廊里有笑声和窃窃私语声。毫无疑问，他们在窥伺我。我用目光检查了墙壁、家具、天花板、地板。我没有发现任何可疑的地方。我听见门外有人走动，一定是有人来从钥匙孔朝里看。我忽然想起,\"也许我的蜡烛会突然熄灭，使我陷入一片黑暗之中。\"\\n\\n于是，我把壁炉上所有的蜡烛都点着了。然后我再一次打量周围，但还是没有发现什么。我迈着大步绕房间走了一圈——没有什么。我走近窗户，百叶窗还开着，我小心翼翼地把它关上，然后放下窗帘，我并且在窗前放了一把椅子，这就不用害怕有任何东西来自外面了。于是我小心翼翼地坐下。扶手椅是结实的，然而时间在向前走，我终于承认自己是可笑的。我决定睡觉，但这张床在我看来特别可疑。于是我采取了自认是绝妙的预防措施。我轻轻地抓住床垫的边缘，然后慢慢地朝我的面前拉。床垫过来了，后面跟着床单和被子。我把所有的这些东西拽到房间的正中央，对着房门。在房间正中央，我重新铺了床，尽可能地把它铺好，远离这张可疑的床。然后，我把所有的烛火都吹灭，摸着黑回来，钻进被窝里。有一个小时我保持清醒着，一听到那可怕最小的声音也打哆嗦。一切似乎是平静的。我睡着了。我睡了很久，而且睡得很熟；但突然之间我惊醒了，因为一个沉甸甸的躯体落到了我的身上。与此同时，我的脸上、脖子上、胸前被浇上一种滚烫的液体，痛得我嚎叫起来。落在我身上的那一大团东西一动也不动，把我压得喘不过气来。我伸出双手，想辨明物体的性质。我摸到一张脸，一个鼻子。于是，我用尽全身力气，朝这张脸上打了一拳。但我立即挨了一阵耳光，使我从湿漉漉的被窝里一跃而起，穿着睡衣跳到走廊里，因为我看见通向走廊的门开着。啊，真令人惊讶！天已经大亮了。人们闻声赶来，发现男仆人躺在我的床上，神情激动。原来，他在给我端早茶来的路上，碰到了我临时搭的床铺，摔倒在我的肚子上，把我的早点浇在我的脸上。我担心会发生一场笑话，而造成这场笑话的，恰恰正是关上百叶窗和到房间中央睡觉这些预防措施。那一天，人们笑够了！",
      "extracted_info": {
        "background": "",
        "characters": [],
        "extracted_intermediate_reasoning": ""
      },
      "generated_levels": []
    },
    {
      "title": "旅途的终点",
      "author": "〔日本〕都筑道夫",
      "content": "终于到了。下了公共汽车，他边走边想，终于到了。他明知这是危险的。父母已不在人世，活着的只有那些他不想见的亲戚。尽管如此，他还是想再看一眼自己出生的故居。他打算对出生的故居只看一眼就立即返回车站。他很疲倦，手里的提包也重的很。虽然里面只装着换洗的衬衫和从银行抢来的八百万块现款，还有抢银行时使用的手枪，却重得很，好像他过去犯过的所有罪行都装在里面似的那么重。他步履维艰地走到自己出生的小镇口，停住了脚步。药铺、自行车铺、点心铺，还排列着这些旧铺子。和往昔一模一样。山货店的老人站在店前。他瞠目而视。老人本来是在他第一次入狱时死去的。他走近老人，确是山货店的老人，老人不予理睬，也不开口。他往店里窥伺，见女孩子在看杂志。这个女孩子比他大两岁，据说已经当了东京一个酒馆的老板娘。他茫然窥伺巷内。看见自己出生的故居。从故居里走出中学生时代的自己。他跟踪自己。中学生时代的自己走进酒酱店。招呼了一声，却没有人答应。是来买酱的，见没有卖货的，便把手伸进钱箱。是了，这是第一次。他见自己在往钱箱里望。不行。住手。一开始干，就会形成今天的自己。住手。中学生干起来了。他从提包里拿出手枪，对中学生抠动了扳机。头脑恢复正常时，他已被警察抓住了双腕。这里是他出生的小镇，却不是从前的酒酱店。一个长发学生倒在他身旁。学生手里抓着手提式保险柜。周围啧有烦言:\"准是盗窃没有人看门的人家的，但冷不防就开枪也太那个了.\"\\n\\n\"莫非是个疯子？\"\\n\\n\"还是个学生嘛，是顺手牵羊吧.\"\\n\\n\"可怜见的.\"\\n\\n他一边被警察拉走，一边大叫:\"我是把他救了；不使他尝到我这样的痛苦！\"",
      "extracted_info": {
        "background": "主人公回到已故父母的故乡小镇，意图短暂探望故居后离开。他携带装有抢银行所得的提洗物品、八百万现金及手枪的提包，因过往罪行感到沉重。在小镇中经历超现实场景：遇见已故山货店老人、目睹中学生时代的自己偷窃钱箱，最终开枪试图阻止过去的自己，却误杀盗窃保险柜的长发学生，被捕时声称自己是为了拯救对方。",
        "characters": [
          {
            "name": "主人公（无名）",
            "description": "疲惫的银行劫匪，携带赃款与手枪回到故乡。因犯罪经历深陷精神压力，通过扭曲的时空感知试图阻止自己初次犯罪。"
          },
          {
            "name": "山货店老人",
            "description": "本应在主人公首次入狱时去世的老人，以沉默姿态出现在旧铺街道，象征主人公对过去的执念。"
          },
          {
            "name": "中学生时代的自己",
            "description": "主人公回忆中初次偷窃钱箱的年轻自我，成为其开枪阻止的对象，暗示犯罪生涯的起点。"
          },
          {
            "name": "长发学生",
            "description": "实际被枪杀的角色，手持保险柜引发群众议论，反映主人公现实与幻觉交织的精神状态。"
          }
        ],
        "extracted_intermediate_reasoning": ""
      },
      "generated_levels": [
        {
          "level": 1,
          "description": "主人公拖着提包踏入小镇入口，药铺与山货店在雾霭中浮现。山货店老人如雕像般站立，沉默地凝视巷口。主人公必须直面老人象征的罪孽感，穿过旧街道抵达故居。",
          "pass_condition": "在老人凝视下保持行动，未被愧疚感吞噬而逃离街道"
        },
        {
          "level": 2,
          "description": "故居门口浮现中学生时代的自己。少年径直走向酒酱店空钱箱，手指即将触碰纸币边缘。主人公握紧提包里的手枪，时空开始扭曲。",
          "pass_condition": "在少年手指接触钱箱前触发时空扭曲，打断偷窃动作",
          "level_image": "https://sc-maas.oss-cn-shanghai.aliyuncs.com/outputs/87cb0516-5600-4305-9521-f317a9c5b105_0.png?OSSAccessKeyId=LTAI5tQnPSzwAnR8NmMzoQq4&Expires=1739200821&Signature=%2F4N5PFWu4k7ymo7ObITBEcH1ubA%3D"
        },
        {
          "level": 3,
          "description": "枪声回荡中场景坍缩，酒酱店化作陌生民宅。长发学生捂着胸口倒下，保险柜滚落地面。围观人群化作流动黑影，发出嘈杂低语。",
          "pass_condition": "在黑影完全实体化前拾取保险柜，阻止群众目睹凶器细节"
        },
        {
          "level": 4,
          "description": "警察腕骨如铁钳扣住双臂时，山货店老人突然出现在押送路径上。老人手中握着中学生时代的钱箱，箱内纸币逐渐染血。",
          "pass_condition": "在警车抵达前挣脱幻象，避免承认双重谋杀罪"
        },
        {
          "level": 5,
          "description": "审讯室白炽灯下，中学生自己与长发学生的虚影在镜面两侧同步流血。手枪在提包内震动，要求主人公开枪终结循环。",
          "pass_condition": "抵抗自杀冲动，利用枪响回声定位真实时空坐标"
        },
        {
          "level": 6,
          "description": "最终回到小镇入口，山货店老人与中学生自己并肩而立。提包重量化作实体锁链，手枪自动上膛指向两者眉心。",
          "pass_condition": "同时击中山货店老人的执念化身与少年偷窃幻影，达成自我赦免"
        }
      ]
    },
    {
      "title": "美丽的谎言",
      "author": "〔新加坡〕希尼尔",
      "content": "伸长脖子，我眯着双眼，仔细向前方望去，没错，确实是30号，我从衣袋取出乘车证，另一只手向巴士挥摆。糟了！都十月了，我的乘车证仍旧贴着九月份的月票。那么，十月份的月票呢？我连忙从衣袋里掏出皮包，三翻四覆的，再往裤袋、后袋及暗袋里东掏西摸，什么也找不到！抬头一望，巴士也走得无影无踪啦。不可能啊？十月份的月票早在两个星期前就买好了，还好好收藏起来。一张邮票般大小的精美图案，价值四十大元，对一个小职员来说，也算是一个心痛的数目。那怎么不在皮包里呢？我想，一定是昨夜拿钱给妻充家用时掉了。赶忙摇个电话给老妻，吩咐她四处找寻去。等了老半天，传回来的答案是没有找到！赶到公司后，再三吩咐老妻及未上学的小女一同找找看。依然徒劳无功。那算啦，就当着吃一顿大餐花掉好了。不行，吃大餐是色香味俱全，我现在心里的滋味是十分酸涩。整个上午过得十分不快。忽然接到老妻打来的电话:\"找到了，放心做你的事吧！\"\\n\\n\"是吗？在哪儿找到的？\"\\n\\n\"是——餐柜下……\"\\n\\n\"告诉你偏僻的地方多摸摸看。不是吗？差点给miss过去了……\"\\n\\n回家时晚餐开迟了。\\n\\n\"怎么！又去串门子忘了时间？\"\\n\\n\"哦！没有，是手指扭到，做起事来不顺手.\"\\n\\n\"为啥会这样？\"\\n\\n\"早上到邮政局还电视执照费时不小心摔了一跤.\"\\n\\n\"真是的！这把年纪还这么粗心.\"\\n\\n我带着责怪的口气说道，再回身添饭去.\\n\\n\"对了，电视执照费不是刚交过了吗？\"站在厨房的老妻好象没听到似的，我没追问什么，坐下来大口地扒饭吃。饭后，我把那张失而复得的月票，端端正正地贴在乘车证上。几天后，一个无聊的下午，在办公室收拾抽屉的当儿，某样东西令我耳根发热。一张月票，一张十月份的乘车月票，静静地躺在抽屉里，向我发笑。顿时，月票、皮包、电话、餐柜、老妻、邮局、摔跤等种种画面，在我脑海里一一掠过。我站起身来，不知如何是好。最后，我决定朝自己的头猛敲几下……",
      "extracted_info": {
        "background": "主人公因找不到十月份的巴士乘车月票而焦虑，误以为丢失后让妻子寻找，最终妻子声称在餐柜下找到。数日后，主人公在办公室抽屉发现真正的月票，意识到妻子可能为掩盖真相而编造理由，甚至受伤，最终陷入自责。",
        "characters": [
          {
            "name": "我（叙述者）",
            "description": "一名普通小职员，生活节俭，因丢失月票焦虑急躁，最后因误会妻子而愧疚。"
          },
          {
            "name": "老妻",
            "description": "叙述者的妻子，性格隐忍，默默承担家务，为掩盖月票丢失真相编造理由并隐瞒受伤原因。"
          }
        ],
        "extracted_intermediate_reasoning": ""
      },
      "generated_levels": [
        {
          "level": 1,
          "description": "主角在巴士站焦急翻找月票未果，错过班车后需立即处理通勤危机。老妻在家中首次接到寻找月票的紧急电话。",
          "pass_condition": "通过组合衣袋/裤袋/暗袋三次翻找动作，并在情绪失控前使用公共电话联络妻子"
        },
        {
          "level": 2,
          "description": "公司午休时接到老妻『找到月票』的电话，对话中出现『餐柜下』与『邮政局摔跤』两个矛盾信息。",
          "pass_condition": "在10秒对话时限内发现『电视执照费刚交过』的谎言破绽",
          "level_image": "https://sc-maas.oss-cn-shanghai.aliyuncs.com/outputs/87cb0516-5600-4305-9521-f317a9c5b105_0.png?OSSAccessKeyId=LTAI5tQnPSzwAnR8NmMzoQq4&Expires=1739200821&Signature=%2F4N5PFWu4k7ymo7ObITBEcH1ubA%3D"
        },
        {
          "level": 3,
          "description": "深夜加班整理票据时，玩家需在堆积如山的文件中保持专注，避免因分心联想到月票疑点而降低工作效率。",
          "pass_condition": "在5分钟内正确分类20份财务报表，期间抵御3次闪回记忆干扰"
        },
        {
          "level": 4,
          "description": "回家发现晚餐延迟，需通过厨房光影观察老妻包扎手指的细节，同时应对饥饿值持续下降的生存压力。",
          "pass_condition": "在饥饿值归零前完成『查看药箱/检查垃圾桶/观察妻子动作』三项隐蔽调查"
        },
        {
          "level": 5,
          "description": "办公室抽屉出现幽灵般闪烁的月票时，需在愧疚值满槽前做出选择：撕毁证据维持谎言或向妻子坦白。",
          "pass_condition": "在心跳声背景音中精准点击三次忏悔按钮，并保持呼吸节奏不超过临界值"
        }
      ]
    },
    {
      "content": "西游记  作者:吴承恩   却说那怪将八戒拿进洞去道：“哥哥啊，拿将一个来了。”\n \n老魔喜道：“拿来我看。”二魔道：“这不是？”老魔道：“兄弟，错拿了，这个和尚没用。”八戒就绰经说道：“大王，没用的和尚，放他出去罢，不当人子！”二魔道：“哥哥，不要放他，虽然没用，也是唐僧一起的，叫做猪八戒。把他且浸在后边净水池中，浸退了毛衣，使盐腌着，晒干了，等天阴下酒。”八戒听言道：“蹭蹬啊！撞着个贩腌腊的妖怪了！”那小妖把八戒抬进去，抛在水里不题。\n \n却说三藏坐在坡前，耳热眼跳，身体不安，叫声：“悟空！怎么悟能这番巡山，去之久而不来？”行者道：“师父还不晓得他的心哩。”三藏道：“他有甚心？”行者道：“师父啊，此山若是有怪，他半步难行，一定虚张声势，跑将回来报我；想是无怪，路途平静，他一直去了。”三藏道：“假若真个去了，却在那里相会？此间乃是山野空阔之处，比不得那店市城井之间。”行者道：“师父莫虑，且请上马。那呆子有些懒惰，断然走的迟慢。你把马打动些儿，我们定赶上他，一同去罢。”真个唐僧上马，沙僧挑担，行者前面引路上山。\n \n却说那老怪又唤二魔道：“兄弟，你既拿了八戒，断乎就有唐僧。再去巡巡山来，切莫放过他去。”二魔道：“就行，就行。”\n \n你看他急点起五十名小妖，上山巡逻。正走处，只见祥云缥缈，瑞气盘旋，二魔道：“唐僧来了。”众妖道：“唐僧在那里？”二魔道：“好人头上祥云照顶，恶人头上黑气冲天。那唐僧原是金蝉长老临凡，十世修行的好人，所以有这样云缥缈。”众怪都不看见，二魔用手指道：“那不是？”那三藏就在马上打了一个寒噤，又一指，又打个寒噤。一连指了三指，他就一连打了三个寒噤，心神不宁道：“徒弟啊，我怎么打寒噤么？”沙僧道：“打寒噤想是伤食病发了。行者道：“胡说，师父是走着这深山峻岭，必然小心虚惊。莫怕！莫怕！等老孙把棒打一路与你压压惊。”好行者，理开棒，在马前丢几个解数，上三下四，左五右六，尽按那六韬（tāo）三略，使起神通。那长老在马上观之，真个是寰中少有，世上全无。剖开路一直前行，险些儿不唬倒那怪物。他在山顶上看见，魂飞魄丧，忽失声道：“几年间闻说孙行者，今日才知话不虚传果是真。”众怪上前道：“大王，怎么长他人之志气，灭自己之威风？你夸谁哩？”二魔道：“孙行者神通广大，那唐僧吃他不成。”众怪道：“大王，你没手段，等我们着几个去报大大王，教他点起本洞大小兵来，摆开阵势，合力齐心，怕他走了那里去！”二魔道：“你们不曾见他那条铁棒，有万夫不当之勇，我洞中不过有四五百兵，怎禁得他那一棒？”众妖道：“这等说，唐僧吃不成，却不把猪八戒错拿了？如今送还他罢。”二魔道：“拿便也不曾错拿，送便也不好轻送。唐僧终是要吃，只是眼下还尚不能。”众妖道：“这般说，还过几年么？”二魔道：“也不消几年。我看见那唐僧，只可善图，不可恶取。若要倚势拿他，闻也不得一闻，只可以善去感他，赚得他心与我心相合，却就善中取计，可以图之。”众妖道：“大王如定计拿他，可用我等？”二魔道：“你们都各回本寨，但不许报与大王知道。若是惊动了他，必然走了风讯，败了我计策。我自有个神通变化，可以拿他。”\n \n众妖散去，他独跳下山来，在那道路之旁，摇身一变，变做个年老的道者，真个是怎生打扮？但见他：星冠晃亮，鹤发蓬松。羽衣围绣带，云履缀黄棕。神清目朗如仙客，体健身轻似寿翁。说甚么清牛道士，也强如素券先生。妆成假象如真象，捏作虚情似实情。他在那大路旁妆做个跌折腿的道士，脚上血淋津，口里哼哼的，只叫“救人！救人！”\n \n却说这三藏仗着孙大圣与沙僧，欢喜前来，正行处，只听得叫“师父救人！”三藏闻得道：“善哉！善哉！这旷野山中，四下里更无村舍，是甚么人叫？想必是虎豹狼虫唬倒的。”这长老兜回俊马，叫道：“那有难者是甚人？可出来。”这怪从草科里爬出，对长老马前，乒乓的只情磕头。三藏在马上见他是个道者，却又年纪高大，甚不过意，连忙下马搀道：“请起，请起。”那怪道：“疼！疼！疼！”丢了手看处，只见他脚上流血，三藏惊问道：\n \n“先生啊，你从那里来？因甚伤了尊足？”那怪巧语花言，虚情假意道：“师父啊，此山西去，有一座清幽观宇，我是那观里的道士。”三藏道：“你不在本观中侍奉香火，演习经法，为何在此闲行？”那魔道：“因前日山南里施主家，邀道众禳星，散福来晚，我师徒二人，一路而行。行至深衢，忽遇着一只斑斓猛虎，将我徒弟衔去，贫道战兢兢亡命走，一跤跌在乱石坡上，伤了腿足，不知回路。今日大有天缘，得遇师父，万望师父大发慈悲，救我一命。若得到观中，就是典身卖命，一定重谢深恩。”三藏闻言，认为真实，道：“先生啊，你我都是一命之人，我是僧，你是道，衣冠虽别，修行之理则同。我不救你啊，就不是出家之辈。救便救你，你却走不得路哩。”那怪道：“立也立不起来，怎生走路？”三藏道：“也罢，也罢。我还走得路，将马让与你骑一程，到你上宫，还我马去罢。”那怪道：“师父，感蒙厚情，只是腿胯跌伤，不能骑马。”三藏道：“正是。”叫沙和尚：“你把行李捎在我马上，你驮他一程罢。”沙僧道：“我驮他。”那怪急回头，抹了他一眼道：“师父啊，我被那猛虎唬怕了，见这晦气色脸的师父，愈加惊怕，不敢要他驮。”三藏叫道：“悟空，你驮罢。”行者连声答应道：“我驮我驮！”那妖就认定了行者，顺顺的要他驮，再不言语。沙僧笑道：“这个没眼色的老道！我驮着不好，颠倒要他驮。他若看不见师父时，三尖石上，把筋都掼断了你的哩！”行者驮了，口中笑道：“你这个泼魔，怎么敢来惹我？你也问问老孙是几年的人儿！你这般鬼话儿，只好瞒唐僧，又好来瞒我？我认得你是这山中的怪物，想是要吃我师父哩。我师父又非是等闲之辈，是你吃的！你要吃他，也须是分多一半与老孙是。”那魔闻得行者口中念诵，道：“师父，我是好人家儿孙，做了道士。\n \n今日不幸，遇着虎狼之厄，我不是妖怪。”行者道：“你既怕虎狼，怎么不念《北斗经》？”三藏正然上马，闻得此言，骂道：“这个泼猴！救人一命，胜造七级浮屠。你驮他驮儿便罢了，且讲甚么北斗经南斗经！”行者闻言道：“这厮造化哩！我那师父是个慈悲好善之人，又有些外好里枒槎。我待不驮你，他就怪我。\n \n驮便驮，须要与你讲开：若是大小便，先和我说。若在脊梁上淋下来，臊气不堪，且污了我的衣服，没人浆洗。”那怪道：“我这般一把子年纪，岂不知你的话说？”行者才拉将起来，背在身上，同长老、沙僧，奔大路西行。那山上高低不平之处，行者留心慢走，让唐僧前去。行不上三五里路，师父与沙僧下了山凹之中，行者却望不见，心中埋怨道：“师父偌大年纪，再不晓得事体。这等远路，就是空身子也还嫌手重，恨不得捽了，却又教我驮着这个妖怪！莫说他是妖怪，就是好人，这们年纪，也死得着了，掼杀他罢，驮他怎的？”这大圣正算计要掼，原来那怪就知道了，且会遣山，就使一个移山倒海的法术，就在行者背上捻诀，念动真言，把一座须弥山遣在空中，劈头来压行者。这大圣慌的把头偏一偏，压在左肩背上，笑道：“我的儿，你使甚么重身法来压老孙哩？这个倒也不怕，只是正担好挑，偏担儿难挨。”那魔道：“一座山压他不住！”却又念咒语，把一座峨眉山遣在空中来压。行者又把头偏一偏，压在右肩背上。看他挑着两座大山，飞星来赶师父！那魔头看见，就吓得浑身是汗，遍体生津道：“他却会担山！”又整性情，把真言念动，将一座泰山遣在空中，劈头压住行者。那大圣力软筋麻，遭逢他这泰山下顶之法，只压得三尸神咋，七窍喷红。\n \n好妖魔，使神通压倒行者，却疾驾长风，去赶唐三藏，就于云端里伸下手来，马上挝人。慌得个沙僧丢了行李，掣出降妖棒，当头挡住。那妖魔举一口七星剑，对面来迎。这一场好杀：\n \n七星剑，降妖杖，万映金光如闪亮。这个圜眼凶如黑杀神，那个铁脸真是卷帘将。那怪山前大显能，一心要捉唐三藏。这个努力保真僧，一心宁死不肯放。他两个喷云嗳雾照天宫，播土扬尘遮斗象。杀得那一轮红日淡无光，大地乾坤昏荡荡。来往相持八九回，不期战败沙和尚。那魔十分凶猛，使口宝剑，流星的解数滚来，把个沙僧战得软弱难搪，回头要走，早被他逼住宝杖，轮开大手，挝住沙僧，挟在左胁下，将右手去马上拿了三藏，脚尖儿钩着行李，张开口，咬着马鬃，使起摄法，把他们一阵风，都拿到莲花洞里，厉声高叫道：“哥哥！这和尚都拿来了！”老魔闻言大喜道：“拿来我看。”二魔道：“这不是？”老魔道：“贤弟呀，又错拿来了也。”二魔道：“你说拿唐僧的。”老魔道：“是便就是唐僧，只是还不曾拿住那有手段的孙行者。须是拿住他，才好吃唐僧哩。若不曾拿得他，切莫动他的人。那猴王神通广大，变化多般，我们若吃了他师父，他肯甘心？来那门前吵闹，莫想能得安生。”二魔笑道：“哥啊，你也忒会抬举人。\n \n若依你夸奖他，天上少有，地下全无，自我观之，也只如此，没甚手段。”老魔道：“你拿住了？”二魔道：“他已被我遣三座大山压在山下，寸步不能举移，所以才把唐僧、沙和尚连马行李，都摄将来也。”那老魔闻言满心欢喜道：“造化！造化！拿住这厮，唐僧才是我们口里的食哩。”叫小妖：“快安排酒来，且与你二大王奉一个得功的杯儿。”二魔道：“哥哥，且不要吃酒，叫小的们把猪八戒捞上水来吊起。”遂把八戒吊在东廊，沙僧吊在西边，唐僧吊在中间，白马送在槽上，行李收将进去。老魔笑道：\n \n“贤弟好手段！两次捉了三个和尚。但孙行者虽是有山压住，也须要作个法，怎么拿他来凑蒸才好哩。”二魔道：“兄长请坐。\n \n若要拿孙行者，不消我们动身，只教两个小妖，拿两件宝贝，把他装将来罢。”老魔道：“拿甚么宝贝去？”二魔道：“拿我的紫金红葫芦，你的羊脂玉净瓶。”老魔将宝贝取出道：“差那两个去？”二魔道：“差精细鬼、伶俐虫二人去。”吩咐道：“你两个拿着这宝贝，径至高山绝顶，将底儿朝天，口儿朝地，叫一声孙行者！他若应了，就已装在里面，随即贴上太上老君急急如律令奉敕的帖儿，他就一时三刻化为脓了。”二小妖叩头，将宝贝领出去拿行者不题。\n \n却说那大圣被魔使法压住在山根之下，遇苦思三藏，逢灾念圣僧，厉声叫道：“师父啊！想当时你到两界山，揭了压帖，老孙脱了大难，秉教沙门，感菩萨赐与法旨，我和你同住同修，同缘同相，同见同知，乍想到了此处，遭逢魔障（佛教指妨碍修行的障碍），又被他遣山压了。可怜！可怜！你死该当，只难为沙僧八戒与那小龙化马一场！这正是树大招风风撼树，人为名高名丧人！”叹罢，那珠泪如雨。早惊了山神土地与五方揭谛神众，会金头揭谛道：“这山是谁的？”土地道：“是我们的。”“你山下压的是谁？”土地道：\n \n“不知是谁。”揭谛道：“你等原来不知。这压的是五百年前大闹天宫的齐天大圣孙悟空行者，如今皈依正果，跟唐僧做了徒弟。你怎么把山借与妖魔压他？你们是死了。他若有一日脱身出来，他肯饶你！就是从轻，土地也问个摆站，山神也问个充军，我们也领个大不应是。”那山神、土地才怕道：“委实不知不知，只听得那魔头念起遣山咒法，我们就把山移将来了，谁晓得是孙大圣？”揭谛道：“你且休怕，律上有云，不知者不坐。我与你计较，放他出来，不要教他动手打你们。”土地道：“就没理了，既放出来又打？”揭谛道：“你不知，他有一条如意金箍棒，十分利害：打着的就死，挽着的就伤。磕一磕儿筋断，擦一擦儿皮塌哩！”那土地山神，心中恐惧，与五方揭谛商议了，却来到三山门外叫道：“大圣！山神土地五方揭谛来见。”好行者，他虎瘦雄心还在，自然的气象昂昂，声音朗朗道：“见我怎的？”土地道：“告大圣得知，遣开山，请大圣出来，赦小神不恭之罪。”行者道：“遣开山，不打你。”喝声“起去！”就如官府发放一般。那众神念动真言咒语，把山仍遣归本位，放起行者。行者跳将起来，抖抖土，束束裙，耳后掣出棒来，叫山神土地：“都伸过孤拐来，每人先打两下，与老孙散散闷！”众神大惊道：“刚才大圣已吩咐，恕我等之罪，怎么出来就变了言语要打？”行者道：“好土地！好山神！你倒不怕老孙，却怕妖怪！”土地道：“那魔神通广大，法术高强，念动真言咒语，拘唤我等在他洞里，一日一个轮流当值哩！”行者听见当值二字，却也心惊，仰面朝天，高声大叫道：“苍天！苍天！自那混沌初分，天开地辟，花果山生了我，我也曾遍访明师，传授长生秘诀。想我那随风变化，伏虎降龙，大闹天宫，名称大圣，更不曾把山神、土地欺心使唤。今日这个妖魔无状，怎敢把山神、土地唤为奴仆，替他轮流当值？天啊！\n \n既生老孙，怎么又生此辈？”\n \n那大圣正感叹间，又见山凹里霞光焰焰而来，行者道：“山神土地，你既在这洞中当值，那放光的是甚物件？”土地道：“那是妖魔的宝贝放光，想是有妖精拿宝贝来降你。”行者道：“这个却好耍子儿啊！我且问你，他这洞中有甚人与他相往？”土地道：“他爱的是烧丹炼药，喜的是全真道人。”行者道：“怪道他变个老道士，把我师父骗去了。既这等，你都且记打，回去罢，等老孙自家拿他。”那众神俱腾空而散。这大圣摇身一变，变做个老真人。你道他怎生打扮：头挽双髽髻，身穿百衲衣。手敲渔鼓简，腰系吕公绦。斜倚大路下，专候小魔妖。顷刻妖来到，猴王暗放刁。不多时，那两个小妖到了。行者将金箍棒伸开，那妖不曾防备，绊着脚，扑的一跌。爬起来，才看见行者，口里嚷道：“惫懒！惫懒！若不是我大王敬重你这行人，就和比较起来。”行者陪笑道：“比较甚么？道人见道人，都是一家人。”那怪道：“你怎么睡在这里，绊我一跌？”行者道：“小道童见我这老道人，要跌一跌儿做见面钱。”那妖道：“我大王见面钱只要几两银子，你怎么跌一跌儿做见面钱？你别是一乡风，决不是我这里道士。”行者道：“我当真不是，我是蓬莱山来的。”那妖道：\n \n“蓬莱山是海岛神仙境界。”行者道：“我不是神仙，谁是神仙？”\n \n那妖却回嗔作喜，上前道：“老神仙，老神仙！我等肉眼凡胎，不能识认，言语冲撞，莫怪，莫怪。”行者道：“我不怪你，常言道，仙体不踏凡地，你怎知之？我今日到你山上，要度一个成仙了道的好人。那个肯跟我去？”精细鬼道：“师父，我跟你去。”伶俐虫道：“师父，我跟你去。”行者明知故问道：“你二位从那里来的？”那怪道：“自莲花洞来的。”要往那里去？”那怪道：“奉我大王教命，拿孙行者去的。”行者道：“拿那个？”那怪又道：“拿孙行者。”孙行者道：“可是跟唐僧取经的那个孙行者么？”那妖道：“正是，正是。你也认得他？”行者道：“那猴子有些无礼。我认得他，我也有些恼他，我与你同拿他去，就当与你助功。”那怪道：“师父，不须你助功，我二大王有些法术，遣了三座大山把他压在山下，寸步难移，教我两个拿宝贝来装他的。”行者道：“是甚宝贝？”精细鬼道：“我的是红葫芦，他的是玉净瓶。”\n \n行者道：“怎么样装他？”小妖道：“把这宝贝的底儿朝天，口儿朝地，叫他一声，他若应了，就装在里面，贴上一张太上老君急急如律令奉敕的帖子，他就一时三刻化为脓了。”行者见说，心中暗惊道：“利害！利害！当时日值功曹报信，说有五件宝贝，这是两件了，不知那三件又是甚么东西？”行者笑道：“二位，你把宝贝借我看看。”那小妖那知甚么诀窍，就于袖中取出两件宝贝，双手递与行者。行者见了，心中暗喜道：“好东西！好东西！我若把尾子一抉，飕的跳起走了，只当是送老孙。”忽又思道：“不好！不好！抢便抢去，只是坏了老孙的名头，这叫做白日抢夺了。”复递与他去道：“你还不曾见我的宝贝哩。”那怪道：“师父有甚宝贝？也借与我凡人看看压灾。”好行者，伸下手把尾上毫毛拔了一根，捻一捻，叫“变”！即变做一个一尺七寸长的大紫金红葫芦，自腰里拿将出来道：“你看我的葫芦么？”\n \n那伶俐虫接在手，看了道：“师父，你这葫芦长大，有样范，好看，却只是不中用。”行者道：“怎的不中用？”那怪道：“我这两件宝贝，每一个可装千人哩。”行者道：“你这装人的，何足稀罕？我这葫芦，连天都装在里面哩！”那怪道：“就可以装天？”行者道：“当真的装天。”那怪道：“只怕是谎。就装与我们看看才信，不然决不信你。”行者道：“天若恼着我，一月之间，常装他七八遭；不恼着我，就半年也不装他一次。”伶俐虫道：“哥啊，装天的宝贝，与他换了罢。”精细鬼道：“他装天的，怎肯与我装人的相换？伶俐虫道：“若不肯啊，贴他这个净瓶也罢。”行者心中暗喜道：“葫芦换葫芦，余外贴净瓶，一件换两件，其实甚相应！”即上前扯住那伶俐虫道：“装天可换么？”那怪道：“但装天就换，不换，我是你的儿子！”行者道：“也罢，也罢，我装与你们看看。”\n \n好大圣，低头捻诀，念个咒语，叫那日游神、夜游神、五方揭谛神：“即去与我奏上玉帝，说老孙皈依正果，保唐僧去西天取经，路阻高山，师逢苦厄。妖魔那宝，吾欲诱他换之，万千拜上，将天借与老孙装闭半个时辰，以助成功。若道半声不肯，即上灵霄殿，动起刀兵！”那日游神径至南天门里灵霄殿下，启奏玉帝，备言前事，玉帝道：“这泼猴头，出言无状，前者观音来说，放了他保护唐僧，朕这里又差五方揭谛、四值功曹，轮流护持，如今又借天装，天可装乎？”才说装不得，那班中闪出哪吒三太子，奏道：“万岁，天也装得。”玉帝道：“天怎样装？”哪吒道：“自混沌初分，以轻清为天，重浊为地。天是一团清气而扶托瑶天宫阙，以理论之，其实难装；但只孙行者保唐僧西去取经，诚所谓泰山之福缘，海深之善庆，今日当助他成功。”玉帝道：“卿有何助？”哪吒道：“请降旨意，往北天门问真武借皂雕旗在南天门上一展，把那日月星辰闭了。对面不见人，捉白不见黑，哄那怪道，只说装了天，以助行者成功。”玉帝闻言：“依卿所奏。”那太子奉旨，前来北天门，见真武备言前事。那祖师随将旗付太子。\n \n早有游神急降大圣耳边道：“哪吒太子来助功了。”行者仰面观之，只见祥云缭绕，果是有神，却回头对小妖道：“装天罢。”小妖道：“要装就装，只管阿绵花屎（这里是拖延、磨时间的意思）怎的？”行者道：“我方才运神念咒来。”那小妖都睁着眼，看他怎么样装天。这行者将一个假葫芦儿抛将上去。你想，这是一根毫毛变的，能有多重？\n \n被那山顶上风吹去，飘飘荡荡，足有半个时辰，方才落下。只见那南天门上，哪吒太子把皂旗拨喇喇展开，把日月星辰俱遮闭了，真是乾坤墨染就，宇宙靛装成。二小妖大惊道：“才说话时，只好向午，却怎么就黄昏了？”行者道：“天既装了，不辨时候，怎不黄昏！”“如何又这等样黑？”行者道：“日月星辰都装在里面，外却无光，怎么不黑！”小妖道：“师父，你在那厢说话哩？”\n \n行者道：“我在你面前不是？”小妖伸手摸着道：“只见说话，更不见面目。师父，此间是甚么去处？”行者又哄他道：“不要动脚，此间乃是渤海岸上，若塌了脚，落下去啊，七八日还不得到底哩！”小妖大惊道：“罢！罢！罢！放了天罢。我们晓得是这样装了。若弄一会子，落下海去，不得归家！”好行者，见他认了真实，又念咒语，惊动太子，把旗卷起，却早见日光正午。小妖笑道：“妙啊！妙啊！这样好宝贝，若不换啊，诚为不是养家的儿子！”那精细鬼交了葫芦，伶俐虫拿出净瓶，一齐儿递与行者，行者却将假葫芦儿递与那怪。行者既换了宝贝，却又干事找绝：脐下拔一根毫毛，吹口仙气，变作一个铜钱，叫道：“小童，你拿这个钱去买张纸来。”小妖道：“何用？”行者道：“我与你写个合同文书。你将这两件装人的宝贝换了我一件装天的宝贝，恐人心不平，向后去日久年深，有甚反悔不便，故写此各执为照。”小妖道：“此间又无笔墨，写甚文书？我与你赌个咒罢。”行者道：“怎么样赌？”小妖道：“我两件装人之宝，贴换你一件装天之宝，若有反悔，一年四季遭瘟。”行者笑道：“我是决不反悔，如有反悔，也照你四季遭瘟。”说了誓，将身一纵，把尾子翘了一翘，跳在南天门前，谢了哪吒太子麾旗相助之功。太子回宫缴旨，将旗送还真武不题。这行者伫立霄汉之间，观看那个小妖。",
      "extracted_info": {
        "background": "唐僧师徒取经途中遭遇妖魔，猪八戒被二魔擒入洞中。二魔设计变作受伤道士迷惑唐僧，孙悟空识破诡计却被妖魔以三座大山压制。沙僧为保护唐僧与二魔交战不敌，唐僧、沙僧被擒。孙悟空脱困后化身老道士，用计骗取妖魔的紫金红葫芦与羊脂玉净瓶，并联合哪吒太子以法术装天骗过小妖。",
        "characters": [
          {
            "name": "唐僧",
            "description": "慈悲心软，易被表象迷惑，因怜悯伪装成受伤道士的二魔而中计。"
          },
          {
            "name": "孙悟空",
            "description": "机智敏锐，神通广大，能识破妖魔变化，但一度被三座大山压制；后以变化之术骗取妖怪法宝，善用谋略。"
          },
          {
            "name": "猪八戒",
            "description": "被妖怪俘虏后试图求饶，性格略带怯懦，被浸泡于净水池中待腌制成下酒菜。"
          },
          {
            "name": "沙僧",
            "description": "忠诚护师，与二魔激烈交战但最终不敌被擒，被吊于西边廊下。"
          },
          {
            "name": "老魔",
            "description": "谨慎多疑，担心孙悟空报复，坚持需先制伏孙悟空再吃唐僧。"
          },
          {
            "name": "二魔",
            "description": "狡诈阴险，擅长变化与法术，化身道士诱骗唐僧，以移山术压制孙悟空。"
          },
          {
            "name": "精细鬼",
            "description": "持紫金红葫芦的小妖，轻信孙悟空伪装的老道士，被骗走法宝。"
          },
          {
            "name": "伶俐虫",
            "description": "持羊脂玉净瓶的小妖，与精细鬼一同被孙悟空用假葫芦骗走两件法宝。"
          }
        ],
        "extracted_intermediate_reasoning": ""
      },
      "generated_levels": [
        {
          "level": 1,
          "description": "二魔化身受伤道士倒卧山道，唐僧见其脚部流血心生怜悯。孙悟空识破妖气却因三藏坚持救援，只得驮起道士。二魔在行者背上念咒召来须弥、峨眉、泰山三座大山将其镇压。",
          "pass_condition": "孙悟空需暗中用毫毛分身示弱，诱使二魔误以为镇压成功。"
        },
        {
          "level": 2,
          "description": "山神土地受五方揭谛威慑，战战兢兢移开三座大山。孙悟空脱困后撞见精细鬼、伶俐虫手持紫金红葫芦与羊脂玉净瓶前来，两妖奉命用宝物收服大圣。",
          "pass_condition": "孙悟空需变作蓬莱老道，以假葫芦诈称能装天，骗得二妖交出真法宝。"
        },
        {
          "level": 3,
          "description": "莲花洞内老魔见二魔擒回唐僧沙僧，却因畏惧行者神通不敢立刻开宴。八戒被浸于腌池，沙僧吊在西廊，唐僧悬于梁间，洞中小妖正烧火备蒸笼。",
          "pass_condition": "孙悟空需化身火焰虫潜入洞中，先切断吊绳解救沙僧，再以瞌睡虫迷倒看守八戒的小妖。"
        },
        {
          "level": 4,
          "description": "二魔发觉法宝被调包，率群妖架黑云追击。孙悟空将计就计拔毫毛变出千万个绑红葫芦的假行者，漫天叫阵惑乱妖魔心神。",
          "pass_condition": "真身藏于云中突袭，用幌金绳反捆二魔，以三昧真火逼其现出原形。"
        },
        {
          "level": 5,
          "description": "老魔吞下假意求和的孙悟空，反被其在腹中翻筋斗竖蜻蜓。洞内小妖趁机救出唐僧，沙僧八戒夺回兵器与群妖混战。",
          "pass_condition": "孙悟空需在老魔肝胆上系紧幌金绳，从其鼻孔窜出后拉扯绳索，迫使老魔跪地求饶交出本命金丹。"
        }
      ]
    },
    {
      "content": "西游记   作者:吴承恩\n却说孙大圣左手把沙和尚捻一把，右手把猪八戒捻一把，他二人却就省悟，坐在高处，倥着脸，不言不语，凭那些道士点灯着火，前后照看，他三个就如泥塑金装一般模样。虎力大仙道：“没有歹人，如何把供献都吃了？”鹿力大仙道：“却象人吃的勾当，有皮的都剥了皮，有核的都吐出核，却怎么不见人形？”羊力大仙道：“师兄勿疑，想是我们虔心敬意，在此昼夜诵经，前后申文，又是朝廷名号，断然惊动天尊。想是三清爷爷圣驾降临，受用了这些供养。趁今仙从未返，鹤驾（仙人的车驾）在斯，我等可拜告天尊（道教对所奉天神中最高贵者的尊称），恳求些圣水金丹，进与陛下，却不是长生永寿，见我们的功果也？”虎力大仙道：“说的是。”教：“徒弟们动乐诵经！一壁厢取法衣来，等我步罡（道士礼拜星宿、召遣神灵的一种动作）拜祷。”那些小道士俱遵命，两班儿摆列齐整，[口+当]的一声磬响，齐念一卷《黄庭道德真经》。虎力大仙披了法衣，擎着玉简，对面前舞蹈扬尘，拜伏于地，朝上启奏道：“诚惶诚恐，稽首归依。臣等兴教，仰望清虚。灭僧鄙俚，敬道光辉。敕修宝殿，御制庭闱。广陈供养，高挂龙旗。通宵秉烛，镇日香菲。一诚达上，寸敬虔归。今蒙降驾，未返仙车。望赐些金丹圣水，进与朝廷，寿比南山。”八戒闻言，心中忐忑，默对行者道：“这是我们的不是。吃了东西，且不走路，只等这般祷祝，却怎么答应？”行者又捻一把，忽地开口叫声：“晚辈小仙，且休拜祝，我等自蟠桃会上来的，不曾带得金丹圣水，待改日再来垂赐。”那些大小道士听见说出话来，一个个抖衣而战道：“爷爷呀！活天尊临凡，是必莫放，好歹求个长生的法儿！”\n \n鹿力大仙上前，又拜云：“扬尘顿首，谨办丹诚。微臣归命，俯仰三清。自来此界，兴道除僧。国王心喜，敬重玄龄。罗天大醮，彻夜看经。幸天尊之不弃，降圣驾而临庭。俯求垂念，仰望恩荣。是必留些圣水，与弟子们延寿长生。”沙僧捻着行者，默默的道：“哥呀，要得紧，又来祷告了。”行者道：“与他些罢。”八戒寂寂道：“那里有得？”行者道：“你只看着我，我有时，你们也都有了。”那道士吹打已毕，行者开言道：“那晚辈小仙，不须拜伏。我欲不留些圣水与你们，恐灭了苗裔（子孙后代）；若要与你，又忒容易了。”众道闻言，一齐俯伏叩头道：“万望天尊念弟子恭敬之意，千乞喜赐些须。我弟子广宣道德，奏国王普敬玄门。”行者道：\n \n“既如此，取器皿来。”那道士一齐顿首谢恩。虎力大仙爱强，就抬一口大缸放在殿上；鹿力大仙端一砂盆安在供桌之上；羊力大仙把花瓶摘了花，移在中间。行者道：“你们都出殿前，掩上格子，不可泄了天机，好留与你些圣水。”众道一齐跪伏丹墀之下，掩了殿门。\n \n那行者立将起来，掀着虎皮裙，撒了一花瓶臊溺。猪八戒见了欢喜道：“哥啊，我把你做这几年兄弟，只这些儿不曾弄我。我才吃了些东西，道要干这个事儿哩。”那呆子揭衣服，忽喇喇，就似吕梁洪倒下坂来，沙沙的溺了一砂盆，沙和尚却也撒了半缸，依旧整衣端坐在上道：“小仙领圣水。”那些道士，推开格子，磕头礼拜谢恩，抬出缸去，将那瓶盆总归一处，教：“徒弟，取个锺子来尝尝。”小道士即便拿了一个茶钟，递与老道士。道士舀出一锺来，喝下口去，只情抹唇咂嘴，鹿力大仙道：\n \n“师兄好吃么？”老道士努着嘴道：“不甚好吃，有些酣[西+单]（形容酒坏时的酸涩味。[西+单]，dān）之味。”\n \n羊力大仙道：“等我尝尝。”也喝了一口，道：“有些猪溺臊气。”\n \n行者坐在上面，听见说出这话儿来，已此识破了，道：“我弄个手段，索性留个名罢。”大叫云：“道号道号，你好胡思！那个三清，肯降凡基？吾将真姓，说与你知。大唐僧众，奉旨来西。良宵无事，下降宫闱。吃了供养，闲坐嬉嬉。蒙你叩拜，何以答之？\n \n那里是甚么圣水，你们吃的都是我一溺之尿！”那道士闻得此言，拦住门，一齐动叉钯扫帚瓦块石头，没头没脸往里面乱打。\n \n好行者，左手挟了沙僧，右手挟了八戒，闯出门，驾着祥光，径转智渊寺方丈，不敢惊动师父，三人又复睡下。\n \n早是五鼓三点，那国王设朝，聚集两班文武，四百朝官，但见绛纱灯火光明，宝鼎香云叆叇（ài dài，形容云霭缭绕）。此时唐三藏醒来叫：“徒弟徒弟，伏侍我倒换关文去来。”行者与沙僧、八戒急起身，穿了衣服，侍立左右道：“上告师父，这昏君信着那些道士，兴道灭僧，恐言语差错，不肯倒换关文，我等护持师父，都进朝去也。”唐僧大喜，披了锦襕袈裟。行者带了通关文牒，教悟净捧着钵盂，悟能拿了锡杖，将行囊马匹，交与智渊寺僧看守，径到五凤楼前，对黄门官作礼，报了姓名，言是东土大唐取经的和尚来此倒换关文，烦为转奏。那阁门大使，进朝俯伏金阶奏曰：“外面有四个和尚，说是东土大唐取经的，欲来倒换关文，现在五凤楼前候旨。”国王闻奏道：“这和尚没处寻死，却来这里寻死！那巡捕官员，怎么不拿他解来？”旁边闪过当驾的太师，启奏道：\n \n“东土大唐，乃南赡部洲，号曰中华大国，到此有万里之遥，路多妖怪。这和尚一定有些法力，方敢西来。望陛下看中华之远僧，且召来验牒放行，庶不失善缘之意。”国王准奏，把唐僧等宣至金銮殿下。师徒们排列阶前，捧关文递与国王。国王展开方看，又见黄门官来奏：“三位国师来也。”慌得国王收了关文，急下龙座，着近侍的设了绣墩，躬身迎接。三藏等回头观看，见那大仙，摇摇摆摆，后带着一双丫髻蓬头的小童儿，往里直进，两班官控背躬身，不敢仰视。他上了金銮殿，对国王径不行礼。\n \n那国王道：“国师，朕未曾奉请，今日如何肯降？”老道士云：“有一事奉告，故来也。那四个和尚是那国来的？”国王道：“是东土大唐差去西天取经的，来此倒换关文。”那三道士鼓掌大笑道：\n \n“我说他走了，原来还在这里！”国王惊道：“国师有何话说？他才来报了姓名，正欲拿送国师使用，怎奈当驾太师所奏有理，朕因看远来之意，不灭中华善缘，方才召入验牒。不期国师有此问，想是他冒犯尊颜，有得罪处也？”道士笑云：“陛下不知，他昨日来的，在东门外打杀了我两个徒弟，放了五百个囚僧，捽碎车辆，夜间闯进观来，把三清圣象毁坏，偷吃了御赐供养。\n \n我等被他蒙蔽了，只道是天尊下降，求些圣水金丹，进与陛下，指望延寿长生；不期他遗些小便，哄瞒我等。我等各喝了一口，尝出滋味，正欲下手擒拿，他却走了。今日还在此间，正所谓冤家路儿窄也！”那国王闻言发怒，欲诛四众。孙大圣合掌开言，厉声高叫道：“陛下暂息雷霆之怒，容僧等启奏。”国王道：“你冲撞了国师，国师之言，岂有差谬（错误、差错）！”行者道：“他说我昨日到城外打杀他两个徒弟，是谁知证？我等且屈认了，着两个和尚偿命，还放两个去取经。他又说我捽碎车辆，放了囚僧，此事亦无见证，料不该死，再着一个和尚领罪罢了。他说我毁了三清，闹了观宇，这又是栽害我也。”国王道：“怎见栽害？”行者道：“我僧乃东土之人，乍来此处，街道尚且不通，如何夜里就知他观中之事？既遗下小便，就该当时捉住，却这早晚坐名害人。天下假名托姓的无限，怎么就说是我？望陛下回嗔详察。”那国王本来昏乱，被行者说了一遍，他就决断不定。\n \n正疑惑之间，又见黄门官来奏：“陛下，门外有许多乡老听宣。”国王道：“有何事干？”即命宣来。宣至殿前，有三四十名乡老朝上磕头道：“万岁，今年一春无雨，但恐夏月干荒，特来启奏，请那位国师爷爷祈一场甘雨，普济黎民。”国王道：“乡老且退，就有雨来也。”乡老谢恩而出。国王道：“唐朝僧众，朕敬道灭僧为何？只为当年求雨，我朝僧人更未尝求得一点；幸天降国师，拯援涂炭。你今远来，冒犯国师，本当即时问罪。姑且恕你，敢与我国师赌胜求雨么？若祈得一场甘雨，济度万民，朕即饶你罪名，倒换关文，放你西去。若赌不过，无雨，就将汝等推赴杀场典刑示众。”行者笑道：“小和尚也晓得些儿求祷。”国王见说，即命打扫坛场，一壁厢教：“摆驾，寡人亲上五凤楼观看。”当时多官摆驾，须臾上楼坐了。唐三藏随着行者、沙僧、八戒，侍立楼下，那三道士陪国王坐在楼上。少时间，一员官飞马来报：“坛场诸色皆备，请国师爷爷登坛。”\n \n那虎力大仙，欠身拱手，辞了国王，径下楼来。行者向前拦住道：“先生那里去？”大仙道：“登坛祈雨。”行者道：“你也忒自重了，更不让我远乡之僧。也罢，这正是强龙不压地头蛇。先生先去，必须对君前讲开。”大仙道：“讲甚么？”行者道：“我与你都上坛祈雨，知雨是你的，是我的？不见是谁的功绩了。”国王在上听见，心中暗喜道：“那小和尚说话倒有些筋节。”沙僧听见，暗笑道：“不知一肚子筋节，还不曾拿出来哩！”大仙道：\n \n“不消讲，陛下自然知之。”行者道：“虽然知之，奈我远来之僧，未曾与你相会。那时彼此混赖（硬把别人的东西赖为自己的），不成勾当，须讲开方好行事。”\n \n大仙道：“这一上坛，只看我的令牌为号：一声令牌响风来，二声响云起，三声响雷闪齐鸣，四声响雨至，五声响云散雨收。”\n \n行者笑道：“妙啊！我僧是不曾见！请了！请了！”\n \n大仙拽开步前进，三藏等随后，径到了坛门外。抬头观看，那里有一座高台，约有三丈多高。台左右插着二十八宿旗号，顶上放一张桌子，桌上有一个香炉，炉中香烟霭霭。两边有两只烛台，台上风烛煌煌。炉边靠着一个金牌，牌上镌的是雷神名号。底下有五个大缸，都注着满缸清水，水上浮着杨柳枝。杨柳枝上，托着一面铁牌，牌上书的是雷霆都司的符字。左右有五个大桩，桩上写着五方蛮雷使者的名录。每一桩边，立两个道士，各执铁锤，伺候着打桩。台后面有许多道士，在那里写作文书。正中间设一架纸炉，又有几个象生的人物，都是那执符使者、土地赞教之神。\n \n那大仙走进去，更不谦逊，直上高台立定。旁边有个小道士，捧了几张黄纸书就的符字，一口宝剑，递与大仙。大仙执着宝剑，念声咒语，将一道符在烛上烧了。那底下两三个道士，拿过一个执符的象生，一道文书，亦点火焚之。那上面乒的一声令牌响，只见那半空里，悠悠的风色飘来，猪八戒口里作念道：\n \n“不好了！不好了！这道士果然有本事！令牌响了一下，果然就刮风！”行者道：“兄弟悄悄的，你们再莫与我说话，只管护持师父，等我干事去来。”好大圣，拔下一根毫毛，吹口仙气，叫“变！”就变作一个“假行者”，立在唐僧手下。他的真身出了元神，赶到半空中，高叫：“那司风的是那个？”慌得那风婆婆捻住布袋，巽二郎札住口绳，上前施礼。行者道：“我保护唐朝圣僧西天取经，路过车迟国，与那妖道赌胜祈雨，你怎么不助老孙，反助那道士？我且饶你，把风收了。若有一些风儿，把那道士的胡子吹得动动，各打二十铁棒！”风婆婆道：“不敢不敢！”遂而没些风气。八戒忍不住乱嚷道：“那先儿请退！令牌已响，怎么不见一些风儿？你下来，让我们上去！”\n \n那道士又执令牌，烧了符檄，扑的又打了一下，只见那空中云雾遮满。孙大圣又当头叫道：“布云的是那个？”慌得那推云童子、布雾郎君当面施礼。行者又将前事说了一遍，那云童、雾子也收了云雾，放出太阳星耀耀，一天万里更无云。八戒笑道：“这先儿只好哄这皇帝，搪塞黎民，全没些真实本事！令牌响了两下，如何又不见云生？”\n \n那道士心中焦躁，仗宝剑，解散了头发，念着咒，烧了符，再一令牌打将下去，只见那南天门里，邓天君领着雷公电母到当空，迎着行者施礼。行者又将前项事说了一遍，道：“你们怎么来的志诚！是何法旨？”天君道：“那道士五雷法是个真的。他发了文书，烧了文檄，惊动玉帝，玉帝掷下旨意，径至九天应元雷声普化天尊府下。我等奉旨前来，助雷电下雨。”行者道：“既如此，且都住了，同候老孙行事。”果然雷也不鸣，电也不灼。\n \n那道士愈加着忙，又添香、烧符、念咒、打下令牌。半空中，又有四海龙王，一齐拥至。行者当头喝道：“敖广！那里去？”那敖广、敖顺、敖钦、敖闰上前施礼。行者又将前项事说了一遍，道：“向日有劳，未曾成功；今日之事，望为助力。”龙王道：“遵命！遵命！”行者又谢了敖顺道：“前日亏令郎缚怪，搭救师父。”\n \n龙王道：“那厮还锁在海中，未敢擅便，正欲请大圣发落。”行者道：“凭你怎么处治了罢，如今且助我一功。那道士四声令牌已毕，却轮到老孙下去干事了。但我不会发符烧檄，打甚令牌，你列位却要助我行行。”邓天君道：“大圣吩咐，谁敢不从！但只是得一个号令，方敢依令而行；不然，雷雨乱了，显得大圣无款也。”行者道：“我将棍子为号罢。”那雷公大惊道：“爷爷呀！我们怎吃得这棍子？”行者道：“不是打你们，但看我这棍子往上一指，就要刮风。”那风婆婆、巽二郎没口的答应道：“就放风！”\n \n“棍子第二指，就要布云。”那推云童子、布雾郎君道：“就布云！\n \n就布云！”“棍子第三指，就要雷鸣电灼。”那雷公、电母道：“奉承！奉承！”“棍子第四指，就要下雨。”那龙王道：“遵命！遵命！”\n \n“棍子第五指，就要大日晴天，却莫违误。”吩咐已毕，遂按下云头，把毫毛一抖，收上身来。那些人肉眼凡胎，那里晓得？行者遂在旁边高叫道：“先生请了，四声令牌俱已响毕，更没有风云雷雨，该让我了。”那道士无奈，不敢久占，只得下了台让他，努着嘴，径往楼上见驾。行者道：“等我跟他去，看他说些甚的。”\n \n只听得那国王问道：“寡人这里洗耳诚听，你那里四声令响，不见风雨，何也？”道士云：“今日龙神都不在家。”行者厉声道：\n \n“陛下，龙神俱在家，只是这国师法不灵，请他不来。等和尚请来你看。”国王道：“即去登坛，寡人还在此候雨。”行者得旨，急抽身到坛所，扯着唐僧道：“师父请上台。”唐僧道：“徒弟，我却不会祈雨。”八戒笑道：“他害你了，若还没雨，拿上柴蓬，一把火了帐！”行者道：“你不会求雨，好的会念经，等我助你。”那长老才举步登坛，到上面端然坐下，定性归神，默念那《密多心经》。正坐处，忽见一员官，飞马来问：“那和尚，怎么不打令牌，不烧符檄？”行者高声答道：“不用！不用！我们是静功祈祷。”\n \n那官去回奏不题。\n \n行者听得老师父经文念尽，却去耳朵内取出铁棒，迎风幌了一幌，就有丈二长短，碗来粗细，将棍望空一指，那风婆婆见了，急忙扯开皮袋，巽二郎解放口绳：只听得呼呼风响，满城中揭瓦翻砖，扬砂走石。看起来，真个好风，却比那寻常之风不同也，但见：折柳伤花，摧林倒树。九重殿损壁崩墙，五凤楼摇梁撼柱。天边红日无光，地下黄砂有翅。演武厅前武将惊，会文阁内文官惧。三宫粉黛乱青丝，六院嫔妃蓬宝髻。侯伯金冠落绣缨，宰相乌纱飘展翅。当驾有言不敢谈，黄门执本无由递。金鱼玉带不依班，象简罗衫无品叙。彩阁翠屏尽损伤，绿窗朱户皆狼狈。金銮殿瓦走砖飞，锦云堂门歪槅碎。这阵狂风果是凶，刮得那君王父子难相会；六街三市没人踪，万户千门皆紧闭！\n \n正是那狂风大作，孙行者又显神通，把金箍棒钻一钻，望空又一指，只见那：推云童子，布雾郎君。推云童子显神威，骨都都触石遮天；布雾郎君施法力，浓漠漠飞烟盖地。茫茫三市暗，冉冉（缓慢的样子）六街昏。因风离海上，随雨出昆仑。顷刻漫天地，须臾蔽世尘。宛然如混沌，不见凤楼门。此时昏雾朦胧，浓云叆叇（ài dài，形容云霭缭绕）。孙行者又把金箍棒钻一钻，望空又一指，慌得那：雷公奋怒，电母生嗔。雷公奋怒，倒骑火兽下天关，电母生嗔，乱掣金蛇离斗府。唿喇喇施霹雳，振碎了铁叉山；淅沥沥闪红绡，飞出了东洋海。呼呼隐隐滚车声，烨烨煌煌飘稻米。万萌万物精神改，多少昆虫蛰已开。君臣楼上心惊骇，商贾闻声胆怯忙。那沉雷护闪，乒乒乓乓，一似那地裂山崩之势，唬得那满城人，户户焚香，家家化纸。孙行者高呼：“老邓！仔细替我看那贪赃坏法之官，忤逆不孝之子，多打死几个示众！”那雷越发振响起来。行者却又把铁棒望上一指，只见那：龙施号令，雨漫乾坤。势如银汉倾天堑（天然形成的隔断交通的大沟，比喻地势险要，不易通过），疾似云流过海门。楼头声滴滴，窗外响潇潇。天上银河泻，街前白浪滔。淙淙如瓮捡，滚滚似盆浇。孤庄将漫屋，野岸欲平桥。真个桑田变沧海，霎时陆岸滚波涛。神龙借此来相助，抬起长江望下浇。这场雨，自辰时下起，只下到午时前后，下得那车迟城，里里外外，水漫了街衢。那国王传旨道：“雨彀了！雨彀了！十分再多，又渰坏了禾苗，反为不美。”五凤楼下听事官策马冒雨来报：“圣僧，雨彀了。”行者闻言，将金箍棒往上又一指，只见霎时间，雷收风息，雨散云收。国王满心欢喜，文武尽皆称赞道：“好和尚！这正是强中更有强中手！就是我国师求雨虽灵，若要晴，细雨儿还下半日，便不清爽。怎么这和尚要晴就晴，顷刻间杲杲（gǎo gǎo，很明亮的样子）日出，万里就无云也？”\n \n国王教回銮，倒换关文，打发唐僧过去。正用御宝时，又被那三个道士上前阻住道：“陛下，这场雨全非和尚之功，还是我道门之力。”国王道：“你才说龙王不在家，不曾有雨，他走上去，以静功祈祷，就雨下来，怎么又与他争功，何也？”虎力大仙道：“我上坛发了文书，烧了符檄，击了令牌，那龙王谁敢不来？\n \n想是别方召请，风云雷雨五司俱不在，一闻我令，随赶而来，适遇着我下他上，一时撞着这个机会，所以就雨。从根算来，还是我请的龙下的雨，怎么算作他的功果？”那国王昏乱，听此言，却又疑惑未定。行者近前一步，合掌奏道：“陛下，这些旁门法术，也不成个功果，算不得我的他的。如今有四海龙王，现在空中，我僧未曾发放，他还不敢遽（jù）退。那国师若能叫得龙王现身，就算他的功劳。”国王大喜道：“寡人做了二十三年皇帝，更不曾看见活龙是怎么模样。你两家各显法力，不论僧道，但叫得来的，就是有功；叫不出的，有罪。”那道士怎么有那样本事？就叫，那龙王见大圣在此，也不敢出头。道士云：“我辈不能，你是叫来。”那大圣仰面朝空，厉声高叫：“敖广何在？弟兄们都现原身来看！”那龙王听唤，即忙现了本身。四条龙，在半空中度雾穿云，飞舞向金銮殿上，但见：飞腾变化，绕雾盘云。玉爪垂钩白，银鳞舞镜明。髯飘素练根根爽，角耸轩昂挺挺清。磕额崔巍，圆睛幌亮。隐显莫能测，飞扬不可评。祷雨随时布雨，求晴即便天晴。这才是有灵有圣真龙象，祥瑞缤纷绕殿庭。那国王在殿上焚香。众公卿在阶前礼拜。国王道：“有劳贵体降临，请回，寡人改日醮谢。”行者道：“列位众神各自归去，这国王改日醮谢哩。”那龙王径自归海，众神各各回天。",
      "extracted_info": {
        "background": "唐僧师徒四人抵达车迟国，该国因三位国师虎力大仙、鹿力大仙、羊力大仙推行灭僧兴道政策，导致国王对佛教敌视。师徒为倒换关文，与国师展开斗法。孙悟空通过冒充三清、戏弄国师、召唤风雨雷电诸神等手段，最终在求雨比试中胜出，揭穿国师骗局，赢得国王认可。",
        "characters": [
          {
            "name": "孙悟空",
            "description": "机智狡黠，法力高强。化身三清戏弄国师，以尿充圣水；召唤风婆、雷公等神灵掌控风雨，最终在求雨斗法中取胜。"
          },
          {
            "name": "猪八戒",
            "description": "贪吃憨直，言行滑稽。参与冒充三清时贡献尿液，对斗法过程调侃不断。"
          },
          {
            "name": "沙僧",
            "description": "沉稳少言，配合行动。在冒充三清时协助孙悟空，斗法中保持低调。"
          },
          {
            "name": "唐僧",
            "description": "慈悲守礼的取经领袖。担忧国王拒倒换关文，依赖徒弟解决危机，最终凭借悟空能力脱险。"
          },
          {
            "name": "虎力大仙",
            "description": "自负傲慢的国师之首。以五雷法求雨失败，被悟空揭穿后仍强词夺理，最终失去国王信任。"
          },
          {
            "name": "鹿力大仙",
            "description": "多疑狡诈的国师。察觉供品异常却未识破悟空伪装，斗法中屡次质疑却无力扭转败局。"
          },
          {
            "name": "羊力大仙",
            "description": "趋炎附势的国师。盲目附和其他国师，尝出“圣水”异味却未能及时应对，最终一同败北。"
          }
        ],
        "extracted_intermediate_reasoning": ""
      },
      "generated_levels": [
        {
          "level": 1,
          "description": "悟空三人化身三清端坐高台，虎力大仙率众道士焚香祈圣水。八戒沙僧憋尿待命，需在道士们察觉异常前完成冒充三清、留下尿液充作圣水的计谋。",
          "pass_condition": "成功让三名国师喝下尿液圣水，且未被当场识破伪装。"
        },
        {
          "level": 2,
          "description": "国王因国师诬告欲斩取经团，悟空当庭抗辩要求赌雨。虎力大仙持令牌登坛作法，风婆雷公受困于悟空威胁，需在三道令牌施法间隙截断风雨响应。",
          "pass_condition": "在虎力大仙四道令牌施法后，确保天空无风无雨无雷电。"
        },
        {
          "level": 3,
          "description": "悟空元神出窍挟众神立约，以金箍棒为号掌控风雨。需在唐僧默念心经时，精准触发棍指四次的连环气象变化，令暴雨覆盖全城却未淹没王宫。",
          "pass_condition": "降雨持续两时辰且收放自如，令国王亲见棍指停雨的神迹。"
        },
        {
          "level": 4,
          "description": "三道士坚称雨为道门之功，国王命双方召龙王现身。四海龙王受制于悟空威势，需在百官见证下显真身盘绕金銮殿，彻底粉碎国师权威。",
          "pass_condition": "四条龙王同时现形飞舞，虎力大仙无法召出任何龙族佐证。"
        }
      ]
    },
    {
      "content": "却说那五十个败残的小妖，拿着些破旗、破鼓，撞入洞里，报道：“大王，虎先锋战不过那毛脸和尚，被他赶下东山坡去了。”老妖闻说，十分烦恼。正低头不语，默思计策，又有把前门的小妖道：“大王，虎先锋被那毛脸和尚打杀了，拖在门口骂战哩。”那老妖闻言，愈加烦恼道：“这厮却也无知！我倒不曾吃他师父，他转打杀我家先锋，可恨！可恨！”叫：“取披挂来。我也只闻得讲什么孙行者，等我出去，看是个什么九头八尾的和尚，拿他进来，与我虎先锋对命（偿命、抵命的意思） 。”众小妖急急抬出披挂。老妖结束齐整，绰一杆三股钢叉，帅群妖跳出本洞。那大圣停立门外，见那妖走将出来，着实骁勇。看他怎生打扮，但见：\n \n金盔晃日，金甲凝光。盔上缨飘山雉尾，罗袍罩甲淡鹅黄。勒甲绦盘龙耀彩，护心镜绕眼辉煌。鹿皮靴，槐花染色；锦围裙，柳叶绒妆。手持三股钢叉利，不亚当年显圣郎。\n \n那老妖出得门来，厉声高叫道：“那个是孙行者？”这行者脚躧着虎怪的皮囊，手执着如意的铁棒，答道：“你孙外公在此，送出我师父来！”那怪仔细观看，见行者身躯鄙猥（这里是丑陋矮小的意思），面容羸瘦，不满四尺，笑道：“可怜！可怜！我只道是怎么样扳翻不倒的好汉，原来是这般一个骷髅的病鬼！”行者笑道：“你这个儿子，忒没眼色！你外公虽是小小的，你若肯照头打一叉柄，就长三尺。”那怪道：“你硬着头，吃吾一柄。”大圣公然不惧。那怪果打一下来，他把腰躬一躬，足长了三尺，有一丈长短，慌得那妖把钢叉按住，喝道：“孙行者，你怎么把这护身的变化法儿，拿来我门前使唤！莫弄虚头！走上来，我与你见见手段！”行者笑道：“儿子啊！常言道：留情不举手，举手不留情。你外公手儿重重的，只怕你捱不起这一棒！”那怪那容分说，拈转钢叉，望行者当胸就刺。这大圣正是会家不忙，忙家不会，理开铁棒，使一个乌龙掠地势，拨开钢叉，又照头便打。他二人在那黄风洞口，这一场好杀：妖王发怒，大圣施威。妖王发怒，要拿行者抵先锋；大圣施威，欲捉精灵救长老。叉来棒架，棒去叉迎。一个是镇山都总帅，一个是护法美猴王。初时还在尘埃战，后来各起在中央。点钢叉，尖明锐利；如意棒，身黑箍黄。戳着的魂归冥府，打着的定见阎王。全凭着手疾眼快，必须要力壮身强。两家舍死忘生战，不知那个平安那个伤！\n \n那老妖与大圣斗经三十回合，不分胜败。这行者要见功绩，使一个身外身的手段：把毫毛揪下一把，用口嚼得粉碎，望上一喷，叫声“变！”变有百十个行者，都是一样打扮，各执一根铁棒，把那怪围在空中。那怪害怕，也使一般本事：急回头，望着巽地上把口张了三张，嘑的一口气，吹将出去，忽然间，一阵黄风，从空刮起。好风！真个利害。\n \n冷冷飕飕天地变，无影无形黄沙旋。穿林折岭倒松梅，播土扬尘崩岭坫（diàn） 。黄河浪泼彻底浑，湘江水涌翻波转。碧天振动斗牛宫，争些刮倒森罗殿。五百罗汉闹喧天，八大金刚齐嚷乱。文殊走了青毛狮，普贤白象难寻见。真武龟蛇失了群，梓橦骡子飘其韂。行商喊叫告苍天，梢公拜许诸般愿。烟波性命浪中流，名利残生随水办。仙山洞府黑攸攸，海岛蓬莱昏暗暗。老君难顾炼丹炉，寿星收了龙须扇。王母正去赴蟠桃，一风吹断裙腰钏。二郎迷失灌州城，哪吒难取匣中剑。天王不见手心塔，鲁班吊了金头钻。雷音宝阙倒三层，赵州石桥崩两断。一轮红日荡无光，满天星斗皆昏乱。南山鸟往北山飞，东湖水向西湖漫。雌雄拆对不相呼，子母分离难叫唤。龙王遍海找夜叉，雷公到处寻闪电。十代阎王觅判官，地府牛头追马面。这风吹到普陀山，卷起观音经一卷。白莲花卸海边飞，吹倒菩萨十二院。盘古至今曾见风，不似这风来不善。唿喇喇，乾坤险不炸崩开，万里江山都是颤！\n \n那妖怪使出这阵狂风，就把孙大圣毫毛变的小行者刮得在那半空中，却似纺车儿一般乱转，莫想轮得棒，如何拢得身？慌得行者将毫毛一抖，收上身来，独自个举着铁棒，上前来打，又被那怪劈脸喷了一口黄风，把两只火眼金睛，刮得紧紧闭合，莫能睁开，因此难使铁棒，遂败下阵来。那妖收风回洞不题。\n \n却说猪八戒见那黄风大作，天地无光，牵着马，守着担，伏在山凹之间，也不敢睁眼，不敢抬头，口里不住的念佛许愿；又不知行者胜负何如，师父死活何如。正在那疑思之时，却早风定天晴。忽抬头往那洞门前看处，却也不见兵戈，不闻锣鼓。呆子又不敢上他门，又没人看守马匹、行李，果是进退两难，怆惶（匆忙、慌张）不已。忧虑间，只听得孙大圣从西边吆喝而来，他才欠身迎着道：“哥哥，好大风啊！你从那里走来？”行者摆手道：“利害！利害！我老孙自为人，不曾见这大风。那老妖使一柄三股钢叉，来与老孙交战；战到有三十余合，是老孙使一个身外身的本事，把他围打，他甚着急，故弄出这阵风来，果是凶恶，刮得我站立不住，收了本事，冒风而逃。—哏，好风！哏，好风！老孙也会呼风，也会唤雨，不曾似这个妖精的风恶！”八戒道：“师兄，那妖精的武艺如何？”行者道：“也看得过。叉法儿倒也齐整。与老孙也战个手平。却只是风恶了，难得赢他。”八戒道：“似这般怎生救得师父？”行者道：“救师父且等再处，不知这里可有眼科先生，且教他把我眼医治医治。”八戒道：“你眼怎的来？”行者道：“我被那怪一口风喷将来，吹得我眼珠酸痛，这会子冷泪常流。”八戒道：“哥啊，这半山中，天色又晚，且莫说要什么眼科，连宿处也没有了！”行者道：“要宿处不难。我料着那妖精还不敢伤我师父，我们且找上大路，寻个人家住下，过此一宵，明日天光，再来降妖罢。”八戒道：“正是，正是。”\n \n他却牵了马，挑了担，出山凹，行上路口。此时渐渐黄昏，只听得那路南山坡下，有犬吠之声。二人停身观看，乃是一家庄院，影影的有灯火光明。他两个也不管有路无路，漫草而行，直至那家门首，但见：紫芝翳翳，白石苍苍。紫芝翳翳多青草，白石苍苍半绿苔。数点小萤光灼灼，一林野树密排排。香兰馥郁，嫩竹新栽。清泉流曲涧，古柏倚深崖。地僻更无游客到，门前惟有野花开。他两个不敢擅入，只得叫一声：“开门，开门！”\n \n那里有一老者，带几个年幼的农夫，叉钯扫帚齐来，问道：“甚么人？甚么人？”行者躬身道：“我们是东土大唐圣僧的徒弟，因往西方拜佛求经，路过此山，被黄风大王拿了我师父去了，我们还未曾救得。天色已晚，特来府上告借一宵，万望方便方便。”那老者答礼道：“失迎，失迎。此间乃云多人少之处，却才闻得叫门，恐怕是妖狐老虎及山中强盗等类，故此小介愚顽，多有冲撞，不知是二位长老。请进，请进。”他兄弟们牵马挑担而入，径至里边，拴马歇担，与庄老拜见叙坐。又有苍头献茶，茶罢捧出几碗胡麻饭。饭毕，命设铺就寝，行者道：“不睡还可，敢问善人，贵地可有卖眼药的？”老者道：“是那位长老害眼？”\n \n行者道：“不瞒你老人家说，我们出家人，自来无病，从不晓得害眼。”老人道：“既不害眼，如何讨药？”行者道：“我们今日在黄风洞口救我师父，不期被那怪将一口风喷来，吹得我眼珠酸痛。今有些眼泪汪汪，故此要寻眼药。”那老者道：“善哉！善哉！\n \n你这个长老，小小的年纪，怎么说谎？那黄风大圣风最利害。他那风，比不得甚么春秋风、松竹风与那东西南北风。”八戒道：\n \n“想必是夹脑风、羊耳风、大麻风、偏正头风？”长者道：“不是，不是。他叫做三昧神风。”行者道：“怎见得？”老者道：“那风，能吹天地暗，善刮鬼神愁，裂石崩崖恶，吹人命即休。你们若遇着他那风吹了呵，还想得活哩！只除是神仙，方可得无事。”行者道：“果然！果然！我们虽不是神仙，神仙还是我的晚辈，这条命急切难休，却只是吹得我眼珠酸痛！”那老者道：“既如此说，也是个有来头的人。我这敝处却无卖眼药的，老汉也有些迎风冷泪，曾遇异人传了一方，名唤三花九子膏，能治一切风眼。”\n \n行者闻言，低头唱喏道：“愿求些儿，点试，点试。”那老者应承，即走进去，取出一个玛瑙石的小罐儿来，拔开塞口，用玉簪儿蘸出少许与行者点上，教他不得睁开，宁心睡觉，明早就好。点毕，收了石罐，径领小介们退于里面。八戒解包袱，展开铺盖，请行者安置。行者闭着眼乱摸，八戒笑道：“先生，你的明杖儿呢？”行者道：“你这个馕糟的呆子！你照顾我做瞎子哩！”那呆子哑哑的暗笑而睡。行者坐在铺上，转运神功，直到有三更后，方才睡下。\n \n不觉又是五更将晓，行者抹抹脸，睁开眼道：“果然好药！比常更有百分光明！”却转头后边望望，呀！那里得甚房舍窗门，但只见些老槐高柳，兄弟们都睡在那绿莎茵上。那八戒醒来道：“哥哥，你嚷怎的？”行者道：“你睁开眼看看。”呆子忽抬头，见没了人家，慌得一毂辘（gū lù）爬将起来道：“我的马哩？”行者道：“树上拴的不是？”—“行李呢？”行者道：“你头边放的不是？”八戒道：“这家子惫懒也。他搬了，怎么就不叫我们一声？通得老猪知道，也好与你送些茶果。想是躲门户的，恐怕里长晓得，却就连夜搬了。噫！我们也忒睡得死！怎么他家拆房子，响也不听见响响？”行者吸吸的笑道：“呆子，不要乱嚷。你看那树上是个什么纸帖儿。”八戒走上前，用手揭了，原来上面四句颂子云：\n \n“庄居非是俗人居，护法伽蓝点化庐。妙药与君医眼痛，尽心降怪莫踌躇。”\n \n行者道：“这伙强神，自换了龙马，一向不曾点他，他倒又来弄虚头！”八戒道：“哥哥莫扯架子，他怎么伏你点札？”行者道：“兄弟，你还不知哩。这护教伽蓝、六丁六甲、五方揭谛、四值功曹，奉菩萨的法旨暗保我师父者。自那日报了名，只为这一向有了你，再不曾用他们，故不曾点札罢了。”八戒道：“哥哥，他既奉法旨暗保师父，所以不能现身明显，故此点化仙庄。你莫怪他，昨日也亏他与你点眼，又亏他管了我们一顿斋饭，亦可谓尽心矣。你莫怪他，我们且去救师父来。”行者道：“兄弟说得是。此处到那黄风洞口不远。你且莫动身，只在林子里看马守担，等老孙去洞里打听打听，看师父下落如何，再与他争战。”八戒道：“正是这等，讨一个死活的实信。假若师父死了，各人好寻头干事；若是未死，我们好竭力尽心。”行者道：“莫乱谈，我去也！”\n \n他将身一纵，径到他门首，门尚关着睡觉。行者不叫门，且不惊动妖怪，捻着诀，念个咒语，摇身一变，变做一个花脚蚊虫，真个小巧！有诗为证，诗曰：扰扰微形利喙，嘤嘤声细如雷。\n \n兰房纱帐善通随，正爱炎天暖气。只怕熏烟扑扇，偏怜灯火光辉。轻轻小小忒钻疾，飞入妖精洞里。只见那把门的小妖，正打鼾睡，行者往他脸上叮了一口，那小妖翻身醒了，道：“我爷哑！好大蚊子！一口就叮了一个大疙疸！”忽睁眼道：“天亮了。”\n \n又听得支的一声，二门开了。行者嘤嘤的飞将进去，只见那老妖吩咐各门上谨慎，一壁厢收拾兵器：“只怕昨日那阵风不曾刮死孙行者，他今日必定还来，来时定教他一命休矣。”\n \n行者听说，又飞过那厅堂，径来后面。但见一层门，关得甚紧，行者漫（从、沿、顺的意思）门缝儿钻将进去，原来是个大空园子，那壁厢定风桩上绳缠索绑着唐僧哩。那师父纷纷泪落，心心只念着悟空、悟能，不知都在何处。行者停翅，叮在他光头上，叫声“师父”。那长老认得他的声音道：“悟空啊，想杀我也！你在那里叫我哩？”行者道：“师父，我在你头上哩。你莫要心焦，少得烦恼。我们务必拿住妖精，方才救得你的性命。”唐僧道：“徒弟啊，几时才拿得妖精么？”行者道：“拿你的那虎怪，已被八戒打死了。只是老妖的风势利害。料着只在今日，管取拿他。你放心莫哭，我去哑。”\n \n说声去，嘤嘤的飞到前面，只见那老妖坐在上面，正点札各路头目。又见那洞前有一个小妖，把个令字旗磨一磨，撞上厅来报道：“大王，小的巡山，才出门，见一个长嘴大耳朵的和尚坐在林里，若不是我跑得快些，几乎被他捉住。却不见昨日那个毛脸和尚。”老妖道：“孙行者不在，想必是风吹死也，再不便去那里求救兵去了！”众妖道：“大王，若果吹杀了他，是我们的造化，只恐吹不死他，他去请些神兵来，却怎生是好？”老妖道：“怕他怎的，怕那甚么神兵！若还定得我的风势，只除了灵吉菩萨来是，其余何足惧也！”行者在屋梁上，只听得他这一句言语，不胜欢喜，即抽身飞出，现本相来至林中，叫声“兄弟！”\n \n八戒道：“哥，你往那里去来？刚才一个打令字旗的妖精，被我赶了去也。”行者笑道：“亏你！亏你！老孙变做蚊虫儿，进他洞去探看师父，原来师父被他绑在定风桩上哭哩。是老孙吩咐，教他莫哭，又飞在屋梁上听了一听。只见那拿令字旗的，喘嘘嘘的，走进去报道：只是被你赶他，却不见我。老妖乱猜乱说，说老孙是风吹杀了，又说是请神兵去了。他却自家供出一个人来，甚妙！甚妙！”八戒道：“他供的是谁？”行者道：“他说怕甚么神兵，那个能定他的风势！只除是灵吉菩萨来是。但不知灵吉住在何处？”\n \n正商议处，只见大路旁走出一个老公公来。你看他怎生模样：身健不扶拐杖，冰髯雪鬓蓬蓬。金花耀眼意朦胧，瘦骨衰筋强硬。屈背低头缓步，庞眉赤脸如童。看他容貌是人称，却似寿星出洞。八戒望见大喜道：“师兄，常言道，要知山下路，须问去来人。你上前问他一声，何如？”真个大圣藏了铁棒，放下衣襟，上前叫道：“老公公，问讯了。”那老者半答不答的，还了个礼道：“你是那里和尚？这旷野处，有何事干？”行者道：“我们是取经的圣僧，昨日在此失了师父，特来动问公公一声，灵吉菩萨在那里住？”老者道：“灵吉在直南上，到那里，还有二千里路。有一山，呼名小须弥山。山中有个道场，乃是菩萨讲经禅院。汝等是取他的经去了？”行者道：“不是取他的经，我有一事烦他，不知从那条路去。”老者用手向南指道：“这条羊肠路就是了。”哄得那孙大圣回头看路，那公公化作清风，寂然不见，只是路旁边下一张简帖，上有四句颂子云：“上复齐天大圣听，老人乃是李长庚。须弥山有飞龙杖，灵吉当年受佛兵。”行者执了帖儿，转身下路。八戒道：“哥啊，我们连日造化低了。这两日忏日里见鬼！那个化风去的老儿是谁？”行者把帖儿递与八戒，念了一遍道：“李长庚是那个？”行者道：“是西方太白金星的名号。”八戒慌得望空下拜道：“恩人！恩人！老猪若不亏金星奏准玉帝呵，性命也不知化作甚的了！”行者道：“兄弟，你却也知感恩。但莫要出头，只藏在这树林深处，仔细看守行李、马匹，等老孙寻须弥山，请菩萨去耶。”八戒道：“晓得！晓得！你只管快快前去！老猪学得个乌龟法，得缩头时且缩头。”\n \n孙大圣跳在空中，纵觔斗云，径往直南上去，果然速快。他点头经过三千里，扭腰八百有余程。须臾见一座高山，半中间有祥云出现，瑞霭纷纷，山凹里果有一座禅院，只听得钟磬悠扬，又见那香烟缥缈。大圣直至门前，见一道人，项挂数珠，口中念佛。行者道：“道人作揖。”那道人躬身答礼道：“那里来的老爷？”行者道：“这可是灵吉菩萨讲经处么？”道人道：“此间正是，有何话说？”行者道：“累烦你老人家与我传答传答：我是东土大唐驾下御弟三藏法师的徒弟，齐天大圣孙悟空行者。今有一事，要见菩萨。”道人笑道：“老爷字多话多，我不能全记。”行者道：“你只说是唐僧徒弟孙悟空来了。”道人依言，上讲堂传报。那菩萨即穿袈裟，添香迎接。\n \n这大圣才举步入门，往里观看，只见那满堂锦绣，一屋威严。众门人齐诵《法华经》，老班首轻敲金铸磬。佛前供养，尽是仙果仙花；案上安排，皆是素肴素品。辉煌宝烛，条条金焰射虹霓；馥郁真香，道道玉烟飞彩雾。正是那讲罢心闲方入定，白云片片绕松梢。静收慧剑魔头绝，般若波罗善会高。那菩萨整衣出迓，行者登堂，坐了客位，随命看茶。行者道：“茶不劳赐，但我师父在黄风山有难，特请菩萨施大法力降怪救师。”菩萨道：“我受了如来法令，在此镇押黄风怪。如来赐了我一颗定风丹，一柄飞龙宝杖。当时被我拿住，饶了他的性命，放他去隐性归山，不许伤生造孽，不知他今日欲害令师，有违教令，我之罪也。”那菩萨欲留行者，治斋相叙，行者恳辞，随取了飞龙杖，与大圣一齐驾云。不多时，至黄风山上。菩萨道：“大圣，这妖怪有些怕我，我只在云端里住定，你下去与他索战，诱他出来，我好施法力。”行者依言，按落云头，不容分说，掣铁棒把他洞门打破，叫道：“妖怪，还我师父来也！”慌得那把门小妖，急忙传报。那怪道：“这泼猴着实无礼！再不伏善，反打破我门！这一出去，使阵神风，定要吹死！”仍前披挂，手绰钢叉，又走出门来，见了行者，更不打话，拈叉当胸就刺。大圣侧身躲过，举棒对面相还。战不数合，那怪吊回头，望巽地上才待要张口呼风，只见那半空里，灵吉菩萨将飞龙宝杖丢将下来，不知念了些甚么咒语，却是一条八爪金龙，拨喇的轮开两爪，一把抓住妖精，提着头，两三捽，捽在山石崖边，现了本相，却是一个黄毛貂鼠。行者赶上举棒就打，被菩萨拦住道：“大圣，莫伤他命，我还要带他去见如来。”对行者道：“他本是灵山脚下的得道老鼠，因为偷了琉璃盏内的清油，灯火昏暗，恐怕金刚拿他，故此走了，却在此处成精作怪。如来照见了他，不该死罪，故着我辖押，但他伤生造孽，拿上灵山；今又冲撞大圣，陷害唐僧，我拿他去见如来，明正其罪，才算这场功绩哩。”行者闻言，却谢了菩萨。菩萨西归不题。\n \n却说猪八戒在那林内，正思量行者，只听得山坂下叫声“悟能兄弟，牵马挑担来耶。”那呆子认得是行者声音，急收拾跑出林外，见了行者道：“哥哥，怎的干事来？”行者道：“请灵吉菩萨使一条飞龙杖，拿住妖精，原来是个黄毛貂鼠成精，被他带去灵山见如来去了。我和你洞里去救师父。”那呆子才欢欢喜喜。\n \n二人撞入里面，把那一窝狡兔、妖狐、香獐、角鹿，一顿钉钯铁棒尽情打死，却往后园拜救师父。师父出得门来，问道：“你两人怎生捉得妖精？如何方救得我？”行者将那请灵吉降妖的事情，陈了一遍，师父谢之不尽。他兄弟们把洞中素物，安排些茶饭吃了，方才出门，找大路向西而去。",
      "extracted_info": {
        "background": "唐僧师徒在黄风山遭遇黄风怪，其先锋虎怪被孙悟空击败。黄风怪使用三昧神风重伤孙悟空，导致其眼疾。孙悟空与猪八戒在太白金星化身的老人指引下，寻得灵吉菩萨相助。灵吉菩萨用飞龙宝杖降服黄风怪（实为灵山偷油黄毛貂鼠），救出唐僧，师徒继续西行。",
        "characters": [
          {
            "name": "孙悟空（孙行者）",
            "description": "齐天大圣，身躯矮小但神通广大，持如意铁棒，能施展身外身法术，被黄风吹伤火眼金睛，最终请灵吉菩萨降妖。"
          },
          {
            "name": "猪八戒（悟能）",
            "description": "长嘴大耳朵，性格呆萌，持钉钯守行李，协助孙悟空对抗妖怪，称遇险时用『乌龟法』缩头自保。"
          },
          {
            "name": "黄风怪",
            "description": "黄毛貂鼠成精，持三股钢叉，能吹三昧神风，自称不惧神兵唯怕灵吉菩萨，后被飞龙宝杖现形擒拿。"
          },
          {
            "name": "唐僧",
            "description": "被黄风怪绑于定风桩上，流泪思念徒弟，获救后向西而行。"
          },
          {
            "name": "灵吉菩萨",
            "description": "持如来所赐定风丹与飞龙杖，镇押黄风怪，化八爪金龙降妖，将其带回灵山问罪。"
          },
          {
            "name": "太白金星（李长庚）",
            "description": "化身为指路老翁，留下简帖透露灵吉菩萨所在，暗中相助取经团队。"
          },
          {
            "name": "虎先锋",
            "description": "黄风怪部下，虎怪化身，被孙悟空击杀后引发黄风怪复仇。"
          }
        ],
        "extracted_intermediate_reasoning": ""
      },
      "generated_levels": [
        {
          "level": 1,
          "description": "虎先锋率小妖拦路挑衅，孙悟空持铁棒迎战，黄风洞口尘土飞扬。八戒护住行李马匹，见风沙渐起暗自缩头。",
          "pass_condition": "击杀虎先锋并击退小妖群"
        },
        {
          "level": 2,
          "description": "黄风怪亲率妖兵出洞，三股钢叉与铁棒激战三十回合。妖王口吐三昧神风，百十身外身猴王被刮得如纺车乱转。",
          "pass_condition": "在黄风法术中坚持三回合后撤退"
        },
        {
          "level": 3,
          "description": "孙悟空双目遭风毒泪流不止，与八戒夜宿伽蓝幻化山庄。萤火虫引路寻得三花九子膏，却见护法神留帖点化。",
          "pass_condition": "获取眼药并识破护法伽蓝伪装"
        },
        {
          "level": 4,
          "description": "悟空化蚊潜入妖洞，见唐僧绑于定风桩垂泪。听闻老妖自曝畏惧灵吉菩萨，梁上窃得破敌关键情报。",
          "pass_condition": "成功探听黄风怪致命弱点"
        },
        {
          "level": 5,
          "description": "太白金星现真身指路，须弥山祥云笼罩。八爪金龙自飞龙杖化形，穿云破风擒拿现出貂鼠原形。",
          "pass_condition": "护送灵吉菩萨抵达并降服黄风怪"
        }
      ]
    },
    {
      "content": "逢君只说受生因，便作如来会上人。一念静观尘世佛，十方同看降威神。欲知今日真明主，须问当年嫡母身。别有世间曾未见，一行一步一花新。\n \n却说那乌鸡国王太子，自别大圣，不多时回至城中，果然不奔朝门，不敢报传宣诏，径至后宰门首，见几个太监在那里把守。见太子来，不敢阻滞（阻碍滞留），让他进去了。好太子，夹一夹马，撞入里面，忽至锦香亭下，只见那正宫娘娘坐在锦香亭上，两边有数十个嫔妃掌扇，那娘娘倚雕栏儿流泪哩。\n \n你道他流泪怎的？原来他四更时也做了一梦，记得一半，含糊了一半，沉沉思想。这太子下马，跪于亭下，叫：“母亲！”那娘娘强整欢容，叫声“孩儿，喜呀！喜呀！这二三年在前殿与你父王开讲，不得相见，我甚思量，今日如何得暇来看我一面？诚万千之喜！诚万千之喜！孩儿，你怎么声音悲惨？你父王年纪高迈，有一日龙归碧海，凤返丹霄，你就传了帝位，还有甚么不悦？”太子叩头道：“母亲，我问你：即位登龙是那个？称孤道寡果何人？”娘娘闻言道：“这孩儿发风了！做皇帝的是你父王，你问怎的？”太子叩头道：“万望母亲敕子无罪，敢问；不敕，不敢问。”娘娘道：“子母家有何罪？敕你，敕你，快快说来。”太子道：\n \n“母亲，我问你三年前夫妻宫里之事与后三年恩爱同否，如何？”娘娘见说，魂飘魄散，急下亭抱起，紧搂在怀，眼中滴泪道：“孩儿！我与你久不相见，怎么今日来宫问此？”太子发怒道：“母亲有话早说，不说时，且误了大事。”娘娘才喝退左右，泪眼低声道：“这桩事，孩儿不问，我到九泉之下，也不得明白。\n \n既问时，听我说：三载之前温又暖，三年之后冷如冰。枕边切切将言问，他说老迈身衰事不兴！”太子闻言，撒手脱身，攀鞍上马。那娘娘一把扯住道：“孩儿，你有甚事，话不终就走？”太子跪在面前道：“母亲，不敢说！今日早期，蒙钦差架鹰逐犬，出城打猎，偶遇东土驾下来的个取经圣僧，有大徒弟乃孙行者，极善降妖。原来我父王死在御花园八角琉璃井内，这全真假变父王，侵了龙位。今夜三更，父王托梦，请他到城捉怪。孩儿不敢尽信，特来问母，母亲才说出这等言语，必然是个妖精。”那娘娘道：“儿啊，外人之言，你怎么就信为实？”太子道：“儿还不敢认实，父王遗下表记与他了。”娘娘问是何物，太子袖中取出那金厢白玉圭，递与娘娘。那娘娘认得是当时国王之宝，止不住泪如泉涌，叫声：“主公！你怎么死去三年，不来见我，却先见圣僧，后来见我？”太子道：“母亲，这话是怎的说？”娘娘道：“儿啊，我四更时分，也做了一梦，梦见你父王水淋淋的，站在我跟前，亲说他死了，鬼魂儿拜请了唐僧降假皇帝，救他前身。记便记得是这等言语，只是一半儿不得分明，正在这里狐疑，怎知今日你又来说这话，又将宝贝拿出。我且收下，你且去请那圣僧急急为之。果然扫荡妖氛，辨明邪正，庶报你父王养育之恩也。”\n \n太子急忙上马，出后宰门，躲离城池，真个是噙泪叩头辞国母，含悲顿首复唐僧。不多时，出了城门，径至宝林寺山门前下马。众军士接着太子，又见红轮将坠。太子传令，不许军士乱动，他又独自个入了山门，整束衣冠，拜请行者。只见那猴王从正殿摇摇摆摆走来，那太子双膝跪下道：“师父，我来了。”行者上前搀住道：“请起，你到城中，可曾问谁么？”太子道：“问母亲来。”将前言尽说了一遍。行者微微笑道：“若是那般冷啊，想是个甚么冰冷的东西变的。不打紧！不打紧！等我老孙与你扫荡。却只是今日晚了，不好行事。你先回去，待明早我来。”\n \n太子跪地叩拜道：“师父，我只在此伺候，到明日同师父一路去罢。”行者道：“不好！不好！若是与你一同入城，那怪物生疑，不说是我撞着你，却说是你请老孙，却不惹他反怪你也？”太子道：“我如今进城，他也怪我。”行者道：“怪你怎么？”太子道：\n \n“我自早朝蒙差，带领若干人马鹰犬出城，今一日更无一件野物，怎么见驾？若问我个不才之罪，监陷羑里（殷代监狱的名称。羑，yǒu），你明日进城，却将何倚？况那班部中更没个相知人也。”行者道：“这甚打紧！你肯早说时，却不寻下些等你？”\n \n好大圣！你看他就在太子面前，显个手段，将身一纵，跳在云端里，捻着诀，念一声“唵蓝净法界”的真言，拘得那山神土地在半空中施礼道：“大圣，呼唤小神，有何使令？”行者道：“老孙保护唐僧到此，欲拿邪魔，奈何那太子打猎无物，不敢回朝。\n \n问汝等讨个人情，快将獐鹿兔，走兽飞禽，各寻些来，打发他回去。”山神土地闻言，敢不承命？又问各要几何。大圣道：“不拘多少，取些来便罢。”那各神即着本处阴兵，刮一阵聚兽阴风，捉了些野鸡山雉，角鹿肥獐，狐獾狢兔，虎豹狼虫，共有百千余只，献与行者。行者道：“老孙不要，你可把他都捻就了筋，单摆在那四十里路上两旁，教那些人不纵鹰犬，拿回城去，算了汝等之功。”众神依言，散了阴风，摆在左右。行者才按云头，对太子道：“殿下请回，路上已有物了，你自收去。”太子见他在半空中弄此神通，如何不信，只得叩头拜别，出山门传了令，教军士们回城。只见那路旁果有无限的野物，军士们不放鹰犬，一个个俱着手擒捉喝采，俱道是千岁殿下的洪福，怎知是老孙的神功？你听凯歌声唱，一拥回城。\n \n这行者保护了三藏，那本寺中的和尚，见他们与太子这样绸缪，怎不恭敬？却又安排斋供，管待了唐僧，依然还歇在禅堂里。将近有一更时分，行者心中有事，急睡不着。他一毂辘爬起来，到唐僧床前叫：“师父。”此时长老还未睡哩，他晓得行者会失惊打怪的，推睡不应。行者摸着他的光头，乱摇道：“师父怎睡着了？”唐僧怒道：“这个顽皮！这早晚还不睡，吆喝甚么？”\n \n行者道：“师父，有一桩事儿和你计较计较。”长老道：“甚么事？”行者道：“我日间与那太子夸口，说我的手段比山还高，比海还深，拿那妖精如探囊取物一般，伸了手去就拿将转来，却也睡不着，想起来，有些难哩。”唐僧道：“你说难，便就不拿了罢。”行者道：“拿是还要拿，只是理上不顺。”唐僧道：“这猴头乱说！妖精夺了人君位，怎么叫做理上不顺！”行者道：“你老人家只知念经拜佛，打坐参禅，那曾见那萧何的律法？常言道，拿贼拿赃。那怪物做了三年皇帝，又不曾走了马脚，漏了风声。他与三宫妃后同眠，又和两班文武共乐，我老孙就有本事拿住他，也不好定个罪名。”唐僧道：“怎么不好定罪？”行者道：“他就是个没嘴的葫芦，也与你滚上几滚。他敢道：我是乌鸡国王，有甚逆天之事，你来拿我？将甚执照与他折辩？”唐僧道：“凭你怎生裁处？”行者笑道：“老孙的计已成了，只是干碍着你老人家，有些儿护短。”唐僧道：“我怎么护短？”行者道：“八戒生得夯，你有些儿偏向他。”唐僧道：“我怎么向他？”行者道：“你若不向他啊，且如今把胆放大些，与沙僧只在这里。待老孙与八戒趁此时先入那乌鸡国城中，寻着御花园，打开琉璃井，把那皇帝尸首捞将上来，包在我们包袱里。明日进城，且不管甚么倒换文牒，见了那怪，掣棍子就打。他但有言语，就将骨榇（这里指尸体。榇，chèn）与他看，说你杀的是这个人！却教太子上来哭父，皇后出来认夫，文武多官见主，我老孙与兄弟们动手。这才是有对头的官事好打。”唐僧闻言暗喜道：“只怕八戒不肯去。”行者笑道：“如何？\n \n我说你护短，你怎么就知他不肯去？你只象我叫你时不答应，半个时辰便了！我这去，但凭三寸不烂之舌，莫说是猪八戒，就是猪九戒，也有本事教他跟着我走。”唐僧道：“也罢，随你去叫他。”\n \n行者离了师父，径到八戒床边，叫：“八戒！八戒！”那呆子是走路辛苦的人，丢倒头只情打呼，那里叫得醒？行者揪着耳朵，抓着鬃，把他一拉，拉起来，叫声“八戒。”那呆子还打棱挣，行者又叫一声，呆子道：“睡了罢，莫顽！明日要走路哩！”行者道：“不是顽，有一桩买卖，我和你做去。”八戒道：“甚么买卖？”\n \n行者道：“你可曾听得那太子说么？”八戒道：“我不曾见面，不曾听见说甚么。”行者说：“那太子告诵我说，那妖精有件宝贝，万夫不当之勇。我们明日进朝，不免与他争敌，倘那怪执了宝贝，降倒我们，却不反成不美，我想着打人不过，不如先下手。\n \n我和你去偷他的来，却不是好？”八戒道：“哥哥，你哄我去做贼哩。这个买卖，我也去得，果是晓得实实的帮寸（即帮衬，帮助，帮忙的意思），我也与你讲个明白：偷了宝贝，降了妖精，我却不奈烦甚么小家罕气的分宝贝，我就要了。”行者道：“你要作甚？”八戒道：“我不如你们乖巧能言，人面前化得出斋来，老猪身子又夯，言语又粗，不能念经，若到那无济无生处，可好换斋吃么！”行者道：“老孙只要图名，那里图甚宝贝，就与你罢便了。”那呆子听见说都与他，他就满心欢喜，一毂辘爬将起来，套上衣服，就和行者走路。这正是清酒红人面，黄金动道心。两个密密的开了门，躲离三藏，纵祥光，径奔那城。\n \n不多时到了，按落云头，只听得楼头方二鼓矣。行者道：\n \n“兄弟，二更时分了。”八戒道：“正好！正好！人都在头觉里正浓睡也。”二人不奔正阳门，径到后宰门首，只听得梆铃声响。\n \n行者道：“兄弟，前后门皆紧急，如何得入？”八戒道：“那见做贼的从门里走么？瞒墙跳过便罢。”行者依言，将身一纵，跳上里罗城墙，八戒也跳上去。二人潜入里面，找着门路，径寻那御花园。正行时，只见有一座三檐白簇的门楼，上有三个亮灼灼的大字，映着那星月光辉，乃是御花园。行者近前看了，有几重封皮，公然将锁门锈住了，即命八戒动手。那呆子掣铁钯，尽力一筑，把门筑得粉碎。行者先举步踏入，忍不住跳将起来，大呼小叫，唬得八戒上前扯住道：“哥呀，害杀我也！那见做贼的乱嚷，似这般吆喝！惊醒了人，把我们拿住，发到官司，就不该死罪，也要解回原籍充军。”行者道：“兄弟啊，你却不知我发急为何，你看这：“彩画雕栏狼狈，宝妆亭阁敧歪。莎汀蓼岸尽尘埋，芍药荼蘼俱败。茉莉玫瑰香暗，牡丹百合空开。芙蓉木槿草垓垓，异卉奇葩壅坏。巧石山峰俱倒，池塘水涸鱼衰。青松紫竹似干柴，满路茸茸蒿艾。丹桂碧桃枝损，海榴棠棣根歪。桥头曲径有苍苔，冷落花园境界！”八戒道：“且叹他做甚？快干我们的买卖去来！”行者虽然感慨，却留心想起唐僧的梦来，说芭蕉树下方是井。正行处，果见一株芭蕉，生得茂盛，比众花木不同，真是：一种灵苗秀，天生体性空。枝枝抽片纸，叶叶卷芳丛。翠缕千条细，丹心一点红。凄凉愁夜雨，憔悴怯秋风。长养元丁力，栽培造化工。缄书成妙用，挥洒有奇功。凤翎宁得似，鸾尾迥相同。薄露瀼瀼滴，轻烟淡淡笼。青阴遮户牖，碧影上帘栊。不许栖鸿雁，何堪系玉骢。霜天形槁悴，月夜色朦胧。仅可消炎暑，犹宜避日烘。愧无桃李色，冷落粉墙东。行者道：“八戒，动手么！宝贝在芭蕉树下埋着哩。”那呆子双手举钯，筑倒了芭蕉，然后用嘴一拱，拱了有三四尺深，见一块石板盖住。呆子欢喜道：“哥呀！造化了！果有宝贝，是一片石板盖着哩！不知是坛儿盛着，是柜儿装着哩。”行者道：“你掀起来看看。”那呆子果又一嘴，拱开看处，又见有霞光灼灼，白气明明。八戒笑道：\n \n“造化！造化！宝贝放光哩！”又近前细看时，呀！原来是星月之光，映得那井中水亮。八戒道：“哥呀，你但干事，便要留根。”\n \n行者道：“我怎留根？”八戒道：“这是一眼井。你在寺里，早说是井中有宝贝，我却带将两条捆包袱的绳来，怎么作个法儿，把老猪放下去。如今空手，这里面东西，怎么得下去上来耶？”行者道：“你下去么？”八戒道：“正是要下去，只是没绳索。”行者笑道：“你脱了衣服，我与你个手段。”八戒道：“有甚么好衣服？\n \n解了这直裰子就是了。”\n \n好大圣，把金箍棒拿出来，两头一扯，叫“长！”足有七八丈长。教：“八戒，你抱着一头儿，把你放下井去。”八戒道：“哥呀，放便放下去，若到水边，就住了罢。”行者道：“我晓得。”那呆子抱着铁棒，被行者轻轻提将起来，将他放下去。不多时，放至水边，八戒道：“到水了！”行者听见他说，却将棒往下一按。那呆子扑通的一个没头蹲，丢了铁棒，便就负水，口里哺哺的嚷道：\n \n“这天杀的！我说到水莫放，他却就把我一按！”行者擎上棒来，笑道：“兄弟，可有宝贝么？”八戒道：“见甚么宝贝，只是一井水！”行者道：“宝贝沉在水底下哩，你下去摸一摸来。”呆子真个深知水性，却就打个猛子，淬（cuì）将下去，呀！那井底深得紧！他却着实又一淬，忽睁眼见有一座牌楼，上有水晶宫三个字。八戒大惊道：“罢了！罢了！错走了路了！蹡（qiāng）下海来也！海内有个水晶宫，井里如何有之？”原来八戒不知此是井龙王的水晶宫。\n \n八戒正叙话处，早有一个巡水的夜叉，开了门，看见他的模样，急抽身进去报道：“大王，祸事了！井上落一个长嘴大耳的和尚来了！赤淋淋的，衣服全无，还不死，逼法说话哩。”那井龙王忽闻此言，心中大惊道：“这是天蓬元帅来也。昨夜夜游神奉上敕旨，来取乌鸡国王魂灵去拜见唐僧，请齐天大圣降妖。\n \n这怕是齐天大圣、天蓬元帅来了，却不可怠慢他，快接他去也。”那龙王整衣冠，领众水族，出门来厉声高叫道：“天蓬元帅，请里面坐。”八戒却才欢喜道：“原来是个故知。”那呆子不管好歹，径入水晶宫里。其实不知上下，赤淋淋的，就坐在上面。龙王道：“元帅，近闻你得了性命，皈依释教，保唐僧西天取经，如何得到此处？”八戒道：“正为此说，我师兄孙悟空多多拜上，着我来问你取甚么宝贝哩。”龙王道：“可怜，我这里怎么得个宝贝？比不得那江河淮济的龙王，飞腾变化，便有宝贝。我久困于此，日月且不能长见，宝贝果何自而来也？”八戒道：“不要推辞，有便拿出来罢。”龙王道：“有便有一件宝贝，只是拿不出来，就元帅亲自来看看，何如？”八戒道：“妙妙妙！须是看看来也。”那龙王前走，这呆子随后，转过了水晶宫殿，只见廊庑下，横軃着一个六尺长躯。龙王用手指定道：“元帅，那厢就是宝贝了。”八戒上前看了，呀！原来是个死皇帝，戴着冲天冠，穿着赭黄袍，踏着无忧履，系着蓝田带，直挺挺睡在那厢。八戒笑道：“难难难！算不得宝贝！想老猪在山为怪时，时常将此物当饭，且莫说见的多少，吃也吃够无数，那里叫做甚么宝贝！”龙王道：“元帅原来不知，他本是乌鸡国王的尸首，自到井中，我与他定颜珠定住，不曾得坏。你若肯驮他出去，见了齐天大圣，假有起死回生之意啊，莫说宝贝，凭你要甚么东西都有。”八戒道：“既这等说，我与你驮出去，只说把多少烧埋钱（旧时对办理丧事，安葬死者所给的报酬）与我？”龙王道“其实无钱。”八戒道：“你好白使人？果然没钱，不驮！”龙王道：“不驮，请行。”八戒就走。龙王差两个有力量的夜叉，把尸抬将出去，送到水晶宫门外，丢在那厢，摘了辟水珠，就有水响。\n \n八戒急回头看，不见水晶宫门，一把摸着那皇帝的尸首，慌得他脚软筋麻，撺出水面，扳着井墙，叫道：“师兄！伸下棒来救我一救！”行者道：“可有宝贝么？”八戒道：“那里有！只是水底下有一个井龙王，教我驮死人，我不曾驮，他就把我送出门来，就不见那水晶宫了，只摸着那个尸首，唬得我手软筋麻，挣搓不动了！哥呀！好歹救我救儿！”行者道：“那个就是宝贝，如何不驮上来？”八戒道：“知他死了多少时了，我驮他怎的？”行者道：“你不驮，我回去耶。”八戒道：“你回那里去？”行者道：\n \n“我回寺中，同师父睡觉去。”八戒道：“我就不去了？”行者道：\n \n“你爬得上来，便带你去，爬不上来，便罢。”八戒慌了：“怎生爬得动！你想，城墙也难上，这井肚子大，口儿小，壁陡的圈墙，又是几年不曾打水的井，团团都长的是苔痕，好不滑也，教我怎爬？哥哥，不要失了兄弟们和气，等我驮上来罢。”行者道：“正是，快快驮上来，我同你回去睡觉。”那呆子又一个猛子，淬将下去，摸着尸首，拽过来，背在身上，撺出水面，扶井墙道：“哥哥，驮上来了。”那行者睁睛看处，真个的背在身上，却才把金箍棒伸下井底，那呆子着了恼的人，张开口，咬着铁棒，被行者轻轻的提将出来。八戒将尸放下，捞过衣服穿了。行者看时，那皇帝容颜依旧，似生时未改分毫。行者道：“兄弟啊，这人死了三年，怎么还容颜不坏？”八戒道：“你不知之，这井龙王对我说，他使了定颜珠定住了，尸首未曾坏得。”行者道：“造化！造化！一则是他的冤仇未报，二来该我们成功，兄弟快把他驮了去。”八戒道：“驮往那里去？”行者道：“驮了去见师父。”八戒口中作念道：“怎的起！怎的起！好好睡觉的人，被这猢狲花言巧语，哄我教做甚么买卖，如今却干这等事，教我驮死人！驮着他，腌臜（脏、不干净。臜，zā）臭水淋将下来，污了衣服，没人与我浆洗。上面有几个补丁，天阴发潮，如何穿么？”行者道：“你只管驮了去，到寺里，我与你换衣服。”八戒道：“不羞！连你穿的也没有，又替我换！”\n \n行者道：“这般弄嘴，便不驮罢！”八戒道：“不驮！”“便伸过孤拐来，打二十棒！”八戒慌了道：“哥哥，那棒子重，若是打上二十，我与这皇帝一般了。”行者道：“怕打时，趁早儿驮着走路！”八戒果然怕打，没好气把尸首拽将过来，背在身上，拽步出园就走。\n \n好大圣，捻着诀，念声咒语，往巽地上吸一口气，吹将去就是一阵狂风，把八戒撮出皇宫内院，躲离了城池，息了风头，二人落地，徐徐却走将来。那呆子心中暗恼，算计要报恨行者道：\n \n“这猴子捉弄我，我到寺里也捉弄他捉弄，撺唆师父，只说他医得活；医不活，教师父念《紧箍儿咒》，把这猴子的脑浆勒出来，方趁我心！”走着路，再再寻思道：“不好！不好！若教他医人，却是容易：他去阎王家讨将魂灵儿来，就医活了。只说不许赴阴司，阳世间就能医活，这法儿才好。”说不了，却到了山门前，径直进去，将尸首丢在那禅堂门前，道：“师父，起来看邪。”那唐僧睡不着，正与沙僧讲行者哄了八戒去久不回之事，忽听得他来叫了一声，唐僧连忙起身道：“徒弟，看甚么？”八戒道：“行者的外公，教老猪驮将来了。”行者道：“你这馕糟的呆子！我那里有甚么外公？”八戒道：“哥，不是你外公，却教老猪驮他来怎么？也不知费了多少力了！”那唐僧与沙僧开门看处，那皇帝容颜未改，似活的一般。长老忽然惨凄道：“陛下，你不知那世里冤家，今生遇着他，暗丧其身，抛妻别子，致令文武不知，多官不晓！可怜你妻子昏蒙，谁曾见焚香献茶？”忽失声泪如雨下。\n \n八戒笑道：“师父，他死了可干你事？又不是你家父祖，哭他怎的！”三藏道：“徒弟啊，出家人慈悲为本，方便为门，你怎的这等心硬？”八戒道：“不是心硬，师兄和我说来，他能医得活。若是医不活，我也不驮他来了。”那长老原来是一头水（这里指没有主见）的，被那呆子摇动了，也便就叫：“悟空，若果有手段医活这个皇帝，正是救人一命，胜造七级浮图，我等也强似灵山拜佛。”行者道：“师父，你怎么信这呆子乱谈！人若死了，或三七五七，尽七七日，受满了阳间罪过，就转生去了，如今已死三年，如何救得！”三藏闻其言道：“也罢了。”八戒苦恨不息道：“师父，你莫被他瞒了，他有些夹脑风。你只念念那话儿，管他还你一个活人。”真个唐僧就念《紧箍儿咒》，勒得那猴子眼胀头疼。",
      "extracted_info": {
        "background": "乌鸡国国王被妖怪害死，妖怪变作国王占据王位。真国王的鬼魂托梦给唐僧求助，太子与皇后通过梦境察觉真相。孙悟空与猪八戒潜入御花园，从井中打捞国王尸体，并计划揭露假国王。唐僧被八戒撺唆，要求悟空救活国王，否则念紧箍咒。",
        "characters": [
          {
            "name": "乌鸡国王太子",
            "description": "察觉父王被害真相，果断与孙悟空合作，暗中质问皇后并确认国王被妖怪替换。"
          },
          {
            "name": "正宫娘娘",
            "description": "因国王托梦起疑，被太子追问后吐露国王三年间态度骤变，最终与太子共谋除妖。"
          },
          {
            "name": "孙悟空",
            "description": "设计降妖计策，拘山神土地为太子捕猎掩人耳目，率八戒夜探御花园井底打捞国王尸首。"
          },
          {
            "name": "猪八戒",
            "description": "被悟空诱骗参与盗宝，下井驮尸时抱怨连连，事后欲借唐僧紧箍咒报复悟空。"
          },
          {
            "name": "唐僧",
            "description": "慈悲心软，被八戒挑唆要求悟空救活国王，以紧箍咒胁迫悟空行事。"
          },
          {
            "name": "井龙王",
            "description": "用定颜珠保存国王尸身不腐，说服八戒将尸体带回阳间。"
          },
          {
            "name": "假国王",
            "description": "变化为国王的妖怪，三年间未被识破，与文武百官共处，尚未暴露真面目。"
          }
        ],
        "extracted_intermediate_reasoning": ""
      }
    },
    {
      "content": "却说祭赛国王与大小公卿，见孙大圣与八戒腾云驾雾，提着两个小妖，飘然而去，一个个朝天礼拜道：“话不虚传！今日方知有此辈神仙活佛！”又见他远去无踪，却拜谢三藏、沙僧道：“寡人肉眼凡胎，只知高徒有力量，拿住妖贼便了，岂知乃腾云驾雾之上仙也。”三藏道：“贫僧无些法力，一路上多亏这三个小徒。”沙僧道：“不瞒陛下说，我大师兄乃齐天大圣皈依。\n \n他曾大闹天宫，使一条金箍棒，十万天兵，无一个对手，只闹得太上老君害怕，玉皇大帝心惊。我二师兄乃天蓬元帅果正，他也曾掌管天河八万水兵大众。惟我弟子无法力，乃卷帘大将受戒。愚弟兄若干别事无能，若说擒妖缚怪，拿贼捕亡，伏虎降龙，踢天弄井，以至搅海翻江之类，略通一二。这腾云驾雾，唤雨呼风，与那换斗移星，担山赶月，特余事耳，何足道哉！”国王闻说，愈十分加敬，请唐僧上坐，口口称为老佛，将沙僧等皆称为菩萨。满朝文武欣然，一国黎民顶礼不题。\n \n却说孙大圣与八戒驾着狂风，把两个小妖摄到乱石山碧波潭，住定云头，将金箍棒吹了一口仙气，叫“变！”变作一把戒刀，将一个黑鱼怪割了耳朵，鲇鱼精割了下唇，撇在水里，喝道：“快早去对那万圣龙王报知，说我齐天大圣孙爷爷在此，着他即送祭赛国金光寺塔上的宝贝出来，免他一家性命！若迸半个不字，我将这潭水搅净，教他一门儿老幼遭诛！”那两个小妖，得了命，负痛逃生，拖着锁索，淬入水内，唬得那些鼋鼍龟鳖，虾蟹鱼精，都来围住问道：“你两个为何拖绳带索？”一个掩着耳，摇头摆尾，一个侮着嘴，跌脚捶胸；都嚷嚷闹闹，径上龙王宫殿报：“大王，祸事了！”那万圣龙王正与九头驸马饮酒，忽见他两个来，即停杯问何祸事。那两个即告道：“昨夜巡拦，被唐僧、孙行者扫塔捉获，用铁索拴锁。今早见国王，又被那行者与猪八戒抓着我两个，一个割了耳朵，一个割了嘴唇，抛在水中，着我来报，要索那塔顶宝贝。”遂将前后事，细说了一遍。那老龙听说是孙行者齐天大圣，唬得魂不附体，魄散九霄，战兢兢对驸马道：“贤婿啊，别个来还好计较，若果是他，却不善也！”驸马笑道：“太岳（岳父）放心，愚婿自幼学了些武艺，四海之内，也曾会过几个豪杰，怕他做甚！等我出去与他交战三合，管取那厮缩首归降，不敢仰视。”\n \n好妖怪，急纵身披挂了，使一般兵器，叫做月牙铲，步出宫，分开水道，在水面上叫道：“是甚么齐天大圣！快上来纳命！”行者与八戒立在岸边，观看那妖精怎生打扮：戴一顶烂银盔，光欺白雪；贯一副兜鍪甲，亮敌秋霜。上罩着锦征袍，真个是彩云笼玉；腰束着犀纹带，果然象花蟒缠金。手执着月牙铲，霞飞电掣；脚穿着猪皮靴，水利波分。远看时一头一面，近睹处四面皆人。前有眼，后有眼，八方通见；左也口，右也口，九口言论。一声吆喝长空振，似鹤飞鸣贯九宸。他见无人对答，又叫一声：“那个是齐天大圣？”行者按一按金箍，理一理铁棒道：\n \n“老孙便是。”那怪道：“你家居何处？身出何方！怎生得到祭赛国，与那国王守塔，却大胆获我头目，又敢行凶，上吾宝山索战？”行者骂道：“你这贼怪，原来不识你孙爷爷哩！你上前，听我道：老孙祖住花果山，大海之间水帘洞。自幼修成不坏身，玉皇封我齐天圣。只因大闹斗牛宫，天上诸神难取胜。当请如来展妙高，无边智慧非凡用。为翻筋斗赌神通，手化为山压我重。\n \n整到如今五百年，观者劝解方逃命。大唐三藏上西天，远拜灵山求佛颂。解脱吾身保护他，炼魔净怪从修行。路逢西域祭赛城。屈害僧人三代命。我等慈悲问旧情，乃因塔上无光映。吾师扫塔探分明，夜至三更天籁静。捉住鱼精取实供，他言汝等偷宝珍。合盘为盗有龙王，公主连名称万圣。血雨浇淋塔上光，将他宝贝偷来用。殿前供状更无虚，我奉君言驰此境。所以相寻索战争，不须再问孙爷姓。快将宝贝献还他，免汝老少全家命。敢若无知骋胜强，教你水涸山颓都蹭蹬！”那驸马闻言，微微冷笑道：“你原来是取经的和尚，没要紧罗织（编造罪名）管事！我偷他的宝贝，你取佛的经文，与你何干，却来厮斗！”行者道：“这贼怪甚不达理！我虽不受国王的恩惠，不食他的水米，不该与他出力。但是你偷他的宝贝，污他的宝塔，屡年屈苦金光寺僧人，他是我一门同气，我怎么不与他出力，辨明冤枉？”驸马道：“你既如此，想是要行赌赛。常言道，武不善作，但只怕起手处，不得留情，一时间伤了你的性命，误了你去取经！”行者大怒，骂道：\n \n“这泼贼怪，有甚强能，敢开大口！走上来，吃老爷一棒！”那驸马更不心慌，把月牙铲架住铁棒，就在那乱石山头，这一场真个好杀，妖魔盗宝塔无光，行者擒妖报国王。小怪逃生回水内，老龙破胆各商量。九头驸马施威武，披挂前来展素强。怒发齐天孙大圣，金箍棒起十分刚。那怪物，九个头颅十八眼，前前后后放毫光；这行者，一双铁臂千斤力，蔼蔼纷纷并瑞祥。铲似一阳初现月，棒如万里遍飞霜。他说“你无干休把不平报！”我道“你有意偷宝真不良！”那泼贼，少轻狂，还他宝贝得安康！棒迎铲架争高下，不见输赢练战场。\n \n他两个往往来来，斗经三十余合，不分胜负。猪八戒立在山前，见他们战到酣美之处，举着钉钯，从妖精背后一筑。原来那怪九个头，转转都是眼睛，看得明白，见八戒在背后来时，即使铲鐏架着钉钯，铲头抵着铁棒。又耐战五七合，挡不得前后齐轮，他却打个滚，腾空跳起，现了本象，乃是一个九头虫，观其形象十分恶，见此身模怕杀人！他生得：毛羽铺锦，团身结絮。方圆有丈二规模，长短似鼋鼍样致。两只脚尖利如钩，九个头攒环一处。展开翅极善飞扬，纵大鹏无他力气；发起声远振天涯，比仙鹤还能高唳。眼多闪灼幌金光，气傲不同凡鸟类。\n \n猪八戒看见心惊道：“哥啊！我自为人，也不曾见这等个恶物！\n \n是甚血气生此禽兽也？”行者道：“真个罕有！真个罕有！等我赶上打去！”好大圣，急纵祥云，跳在空中，使铁棒照头便打。那怪物大显身，展翅斜飞，飕的打个转身，掠到山前，半腰里又伸出一个头来，张开口如血盆相似，把八戒一口咬着鬃，半拖半扯，捉下碧波潭水内而去。及至龙宫外，还变作前番模样，将八戒掷之于地，叫：“小的们何在？”那里面鲭（qīng ，鱼类的一种）鲌（bó ，鱼类的一种）鲤鳜之鱼精，龟鳖鼋鼍之介怪，一拥齐来，道声“有！”驸马道：“把这个和尚，绑在那里，与我巡拦的小卒报仇！”众精推推嚷嚷，抬进八戒去时，那老龙王欢喜迎出道：“贤婿有功，怎生捉他来也？”那驸马把上项原故，说了一遍，老龙即命排酒贺功不题。\n \n却说孙行者见妖精擒了八戒，心中惧道：“这厮恁般利害！\n \n我待回朝见师，恐那国王笑我。待要开言骂战，曾奈我又单身，况水面之事不惯。且等我变化了进去，看那怪把呆子怎生摆布，若得便，且偷他出来干事。”好大圣，捻着诀，摇身一变，还变做一个螃蟹，淬于水内，径至牌楼之前。原来这条路是他前番袭牛魔王盗金睛兽走熟了的，直至那宫阙之下，横爬过去，又见那老龙王与九头虫合家儿欢喜饮酒。行者不敢相近，爬过东廊之下，见几个虾精蟹精，纷纷纭纭耍子。行者听了一会言谈，却就学语学话，问道：“驸马爷爷拿来的那长嘴和尚，这会死了不曾？”众精道：“不曾死，缚在那西廊下哼的不是？”行者听说，又轻轻的爬过西廊，真个那呆子绑在柱上哼哩。行者近前道：“八戒，认得我么？”八戒听得声音，知是行者，道：“哥哥，怎么了！反被这厮捉住我也！”行者四顾无人，将钳咬断索子叫走，那呆子脱了手道：“哥哥，我的兵器，被他收了，又奈何？”行者道：“你可知道收在那里？”八戒道：“当被那怪拿上宫殿去了。”行者道：“你先去牌楼下等我。”八戒逃生，悄悄的溜出。行者复身爬上宫殿，观看左首下有光彩森森，乃是八戒的钉钯放光，使个隐身法，将钯偷出，到牌楼下，叫声：“八戒！接兵器！”\n \n呆子得了钯，便道：“哥哥，你先走，等老猪打进宫殿。若得胜，就捉住他一家子；若不胜，败出来，你在这潭岸上救应。”行者大喜，只教仔细，八戒道：“不怕他！水里本事，我略有些儿。”行者丢了他，负出水面不题。\n \n这八戒束了皂直裰，双手缠钯，一声喊，打将进去。慌得那大小水族，奔奔波波，跑上宫殿，吆喝道：“不好了！长嘴和尚挣断绳返打进来了！”那老龙与九头虫并一家子俱措手不及，跳起来，藏藏躲躲。这呆子不顾死活，闯上宫殿，一路钯，筑破门扇，打破桌椅，把些吃酒的家火之类，尽皆打碎。有诗为证，诗曰：木母遭逢水怪擒，心猿不舍苦相寻。暗施巧计偷开锁，大显神威怒恨深。驸马忙携公主躲，龙王战栗绝声音。水宫绛阙门窗损，龙子龙孙尽没魂。这一场，被八戒把玳瑁屏打得粉碎，珊瑚树掼得凋零。那九头虫将公主安藏在内，急取月牙铲，赶至前宫喝道：“泼夯豕彘！怎敢欺心惊吾眷族！”八戒骂道：“这贼怪，你焉敢将我捉来！这场不干我事，是你请我来家打的！快拿宝贝还我，回见国王了事；不然，决不饶你一家命也！”那怪那肯容情，咬定牙齿，与八戒交锋。那老龙才定了神思，领龙子龙孙，各执枪刀，齐来攻取。八戒见事体不谐，虚幌一钯，撤身便走，那老龙帅众追来。须臾，撺出水中，都到潭面上翻腾。却说孙行者立于潭岸等候，忽见他们追赶八戒，出离水中，就半踏云雾，掣铁棒，喝声“休走！”只一下，把个老龙头打得稀烂。\n \n可怜血溅潭中红水泛，尸飘浪上败鳞浮！唬得那龙子龙孙各各逃命，九头驸马收龙尸，转宫而去。\n \n行者与八戒且不追袭，回上岸，备言前事。八戒道：“这厮锐气挫了！被我那一路钯，打进去时，打得落花流水，魂散魄飞！正与那驸马厮斗，却被老龙王赶着，却亏了你打死。那厮们回去，一定停丧挂孝，决不肯出来。今又天色晚了，却怎奈何？”行者道：“管甚么天晚！乘此机会，你还下去攻战，务必取出宝贝，方可回朝。”那呆子意懒情疏，徉徉推托，行者催逼道：\n \n“兄弟不必多疑，还象刚才引出来，等我打他。”两人正自商量，只听得狂风滚滚，惨雾阴阴，忽从东方径往南去。行者仔细观看，乃二郎显圣，领梅山六兄弟，架着鹰犬，挑着狐兔，抬着獐鹿，一个个腰挎弯弓，手持利刃，纵风雾踊跃而来。行者道：“八戒，那是我七圣兄弟，倒好留请他们，与我助战。若得成功，倒是一场大机会也。”八戒道：“既是兄弟，极该留请。”行者道：\n \n“但内有显圣大哥，我曾受他降伏，不好见他。你去拦住云头，叫道：‘真君，且略住住。齐天大圣在此进拜。’他若听见是我，断然住了。待他安下，我却好见。”那呆子急纵云头，上山拦住，厉声高叫道：“真君，且慢车驾，有齐天大圣请见哩。”那爷爷见说，即传令就停住六兄弟，与八戒相见毕，问：“齐天大圣何在？”八戒道：“现在山下听呼唤。”二郎道：“兄弟们，快去请来。”六兄弟乃是康、张、姚、李、郭、直，各各出营叫道：“孙悟空哥哥，大哥有请。”行者上前，对众作礼，遂同上山。二郎爷爷迎见，携手相搀，一同相见道：“大圣，你去脱大难，受戒沙门，刻日功完，高登莲座，可贺！可贺！”行者道：“不敢，向蒙莫大之恩，未展斯须之报。虽然脱难西行，未知功行何如。今因路遇祭赛国，搭救僧灾，在此擒妖索宝。偶见兄长车驾，大胆请留一助，未审兄长自何而来，肯见爱否。”二郎笑道：“我因闲暇无事，同众兄弟采猎而回，幸蒙大圣不弃留会，足感故旧之情。若命挟力降妖，敢不如命！却不知此地是何怪贼？”六圣道：“大哥忘了？此间是乱石山，山下乃碧波潭，万圣之龙宫也。”二郎惊呀道：“万圣老龙却不生事，怎么敢偷塔宝？”行者道：“他近日招了一个驸马，乃是九头虫成精。他郎丈两个做贼，将祭赛国下了一场血雨，把金光寺塔顶舍利佛宝偷来。那国王不解其意，苦拿着僧人拷打。是我师父慈悲，夜来扫搭，当被我在塔上拿住两个小妖，是他差来巡探的。今早押赴朝中，实实供招了。\n \n那国王就请我师收降，师命我等到此。先一场战，被九头虫腰里伸出一个头来，把八戒衔了去，我却又变化下水，解了八戒。\n \n才然大战一场，是我把老龙打死，那厮们收尸挂孝去了。我两个正议索战，却见兄长仪仗降临，故此轻渎也。”二郎道：“既伤了老龙，正好与他攻击，使那厮不能措手，却不连窝巢都灭绝了？”八戒道：“虽是如此，奈天晚何？”二郎道：“兵家云，征不待时，何怕天晚！”康姚郭直道：“大哥莫忙，那厮家眷在此，料无处去。孙二哥也是贵客，猪刚鬣又归了正果，我们营内，有随带的酒肴，教小的们取火，就此铺设：一则与二位贺喜，二来也当叙情。且欢会这一夜，待天明索战何迟？”二郎大喜道：“贤弟说得极当。”却命小校安排，行者道：“列位盛情，不敢固却。但自做和尚，都是斋戒，恐荤素不便。”二郎道：“有素果品，酒也是素的。”众兄弟在星月光前，幕天席地，举杯叙旧。\n \n正是寂寞更长，欢娱夜短，早不觉东方发白。那八戒几锺酒吃得兴抖抖的道：“天将明了，等老猪下水去索战也。”二郎道：“元帅仔细，只要引他出来，我兄弟们好下手。”八戒笑道：\n \n“我晓得！我晓得！你看他敛衣缠钯，使分水法，跳将下去，径至那牌楼下，发声喊，打入殿内。此时那龙子披了麻，看着龙尸哭，龙孙与那驸马，在后面收拾棺材哩。这八戒骂上前，手起处，钯头着重，把个龙子夹脑连头，一钯筑了九个窟窿，唬得那龙婆与众往里乱跑，哭道：“长嘴和尚又把我儿打死了！”那驸马闻言，即使月牙铲，带龙孙往外杀来。这八戒举钯迎敌，且战且退，跳出水中。这岸上齐天大圣与七兄弟一拥上前，枪刀乱扎，把个龙孙剁成几断肉饼。那驸马见不停当，在山前打个滚，又现了本象，展开翅，旋绕飞腾。二郎即取金弓，安上银弹，扯满弓，往上就打。那怪急铩（shā）翅，掠到边前，要咬二郎；半腰里才伸出一个头来，被那头细犬，撺上去，汪的一口，把头血淋淋的咬将下来。那怪物负痛逃生，径投北海而去。八戒便要赶去，行者止住道：“且莫赶他，正是穷寇勿追，他被细犬咬了头，必定是多死少生。等我变做他的模样，你分开水路，赶我进去，寻那宫主，诈他宝贝来也。”二郎与六圣道：“不赶他，倒也罢了，只是遗这种类在世，必为后人之害。”至今有个九头虫滴血，是遗种也。\n \n那八戒依言，分开水路，行者变作怪象前走，八戒吆吆喝喝后追。渐渐追至龙宫，只见那万圣宫主道：“驸马，怎么这等慌张？”行者道：“那八戒得胜，把我赶将进来，觉道不能敌他。\n \n你快把宝贝好生藏了！”那宫主急忙难识真假，即于后殿里取出一个浑金匣子来，递与行者道：“这是佛宝。”又取出一个白玉匣子，也递与行者道：“这是九叶灵芝。你拿这宝贝藏去，等我与猪八戒斗上两三合，挡住他，你将宝贝收好了，再出来与他合战。”行者将两个匣儿收在身边，把脸一抹，现了本象道：\n \n“宫主，你看我可是驸马么？”宫主慌了，便要抢夺匣子，被八戒跑上去，着背一钯，筑倒在地。还有一个老龙婆撤身就走，被八戒扯住，举钯才筑，行者道：“且住！莫打死他，留个活的，好去国内见功。”遂将龙婆提出水面。行者随后捧着两个匣子上岸，对二郎道：“感兄长威力，得了宝贝，扫净妖贼也。”二郎道：“一则是那国王洪福齐天，二则是贤昆玉神通无量，我何功之有！”\n \n兄弟们俱道：“孙二哥既已功成，我们就此告别。”行者感谢不尽，欲留同见国王。诸公不肯，遂帅众回灌口（这里指二郎神）。\n \n行者捧着匣子，八戒拖着龙婆，半云半雾，顷刻间到了国内。原来那金光寺解脱的和尚，都在城外迎接，忽见他两个云雾定时，近前磕头礼拜，接入城中。那国王与唐僧正在殿上讲论，这里有先走的和尚礼仗着胆入朝门奏道：“万岁，孙猪二老爷擒贼获宝而来也。”那国王听说，连忙下殿，共唐僧，沙僧，迎着称谢神功不尽，随命排筵谢恩。三藏道：“且不须赐饮，着小徒归了塔中之宝，方可饮宴。”三藏又问行者道：“汝等昨日离国，怎么今日才来？”行者把那战驸马，打龙王，逢真君，败妖怪，及变化诈宝贝之事，细说了一遍。三藏与国王，大小文武，俱喜之不胜。国王又问：“龙婆能人言语否？”八戒道：“乃是龙王之妻，生了许多龙子龙孙，岂不知人言？”国王道：“既知人言，快早说前后做贼之事。”龙婆道：“偷佛宝，我全不知，都是我那夫君龙鬼与那驸马九头虫，知你塔上之光乃是佛家舍利子，三年前下了血雨，乘机盗去。”又问：“灵芝草是怎么偷的？”\n \n龙婆道：“只是我小女万圣宫主私入大罗天上灵霄殿前，偷的王母娘娘九叶灵芝草。那舍利子得这草的仙气温养着，千年不坏，万载生光，去地下，或田中，扫一扫即有万道霞光，千条瑞气。如今被你夺来，弄得我夫死子绝，婿丧女亡，千万饶了我的命罢！”八戒道：“正不饶你哩！”行者道：“家无全犯，我便饶你，只便要你长远替我看塔。”龙婆道：“好死不如恶活。但留我命，凭你教做甚么。”行者叫取铁索来，当驾官即取铁索一条，把龙婆琵琶骨穿了，教沙僧：“请国王来看我们安塔去。”那国王即忙排驾，遂同三藏携手出朝，并文武多官，随至金光寺上塔。将舍利子安在第十三层塔顶宝瓶中间，把龙婆锁在塔心柱上，念动真言，唤出本国土地、城隍与本寺伽蓝，每三日送饮食一餐，与这龙婆度口，少有差讹（错误，差错。讹， é），即行处斩，众神暗中领诺。行者却将芝草把十三层塔层层扫过，安在瓶内，温养舍利子。这才是整旧如新，霞光万道，瑞气千条，依然八方共睹，四国同瞻。下了塔门，国王就谢道：“不是老佛与三位菩萨到此，怎生得明此事也！”行者道：“陛下，金光二字不好，不是久住之物：金乃流动之物，光乃熌灼之气。贫僧为你劳碌这场，将此寺改作伏龙寺，教你永远常存。”那国王即命换了字号，悬上新匾，乃是“敕建护国伏龙寺”。一壁厢安排御宴，一壁厢召丹青写下四众生形，五凤楼注了名号。国王摆銮驾，送唐僧师徒，赐金玉酬答，师徒们坚辞，一毫不受。这真个是：\n \n邪怪剪除万境静，宝塔回光大地明。\n毕竟不知此去前路如何，且听下回分解。",
      "extracted_info": {
        "background": "唐僧师徒途经祭赛国，得知金光寺佛宝舍利子被盗，导致国家蒙难。为帮助国王，孙悟空与猪八戒前往碧波潭与万圣龙王及九头虫交战，最终在二郎神协助下夺回佛宝，降伏妖怪，并将佛宝安放回塔中，金光寺更名为伏龙寺。",
        "characters": [
          {
            "name": "孙悟空",
            "description": "齐天大圣，使用金箍棒，曾大闹天宫。变化多端，设计救出八戒，与九头虫激战，最终夺回佛宝。"
          },
          {
            "name": "猪八戒",
            "description": "天蓬元帅转世，使用钉耙。被九头虫所擒，后被孙悟空救出，参与捣毁龙宫的战斗。"
          },
          {
            "name": "沙僧",
            "description": "卷帘大将受戒，自称无法力，但协助唐僧处理事务。"
          },
          {
            "name": "唐僧",
            "description": "凡僧，无法力，依赖徒弟降妖，受祭赛国王敬重。"
          },
          {
            "name": "祭赛国王",
            "description": "因佛宝失窃而困扰，恳请唐僧师徒相助，最终对师徒四人极为敬仰。"
          },
          {
            "name": "万圣龙王",
            "description": "碧波潭龙王，与九头虫合谋盗取佛宝，被孙悟空击杀。"
          },
          {
            "name": "九头虫",
            "description": "万圣龙王驸马，九头怪妖，使用月牙铲。盗宝主谋，后被二郎神的细犬咬伤，败逃北海。"
          },
          {
            "name": "万圣宫主",
            "description": "龙王之女，偷取王母九叶灵芝草滋养佛宝，被八戒打死。"
          },
          {
            "name": "二郎神",
            "description": "显圣真君，率梅山六兄弟助战，以金弓银弹重创九头虫。"
          },
          {
            "name": "龙婆",
            "description": "万圣龙王之妻，被锁于塔中守护佛宝，供认盗宝经过。"
          }
        ],
        "extracted_intermediate_reasoning": ""
      },
      "generated_levels": [
        {
          "level": 1,
          "description": "孙悟空与八戒初至碧波潭，与九头虫首次交战。九头虫现出九头真身，八戒不慎被其拖入龙宫。",
          "pass_condition": "击退九头虫并救出八戒。",
          "hints": [
            "如何利用孙悟空的变化能力分散九头虫的注意力？",
            "九头虫的九个头颅是否有共同的弱点？",
            "是否需要先破坏碧波潭的水道以限制敌方行动？"
          ]
        },
        {
          "level": 2,
          "description": "孙悟空化为螃蟹潜入龙宫，发现八戒被缚于西廊柱下，龙宫守卫森严。",
          "pass_condition": "救出八戒并取回钉耙。",
          "hints": [
            "如何利用龙宫地形避开巡逻的虾兵蟹将？",
            "八戒的钉耙被收在何处？如何无声夺取？",
            "是否需要制造混乱引开守卫？"
          ]
        },
        {
          "level": 3,
          "description": "八戒脱困后大闹龙宫，老龙王率众围攻。二郎神率梅山六圣突然现身助战。",
          "pass_condition": "击杀老龙王并击退龙子龙孙。",
          "hints": [
            "如何利用八戒的钉耙破坏龙宫结构？",
            "二郎神的金弓银弹可针对哪个目标？",
            "是否需要分兵牵制九头虫的支援？"
          ]
        },
        {
          "level": 4,
          "description": "九头虫现出本相飞逃，二郎神细犬咬断其一头，妖怪负伤逃往北海。",
          "pass_condition": "重创九头虫并阻止其反扑。",
          "hints": [
            "如何预判九头虫的飞行轨迹进行拦截？",
            "细犬的攻击能否封锁九头虫的再生能力？",
            "是否需要封锁北海入口断绝后路？"
          ]
        },
        {
          "level": 5,
          "description": "孙悟空变化为九头虫骗取万圣宫主交出佛宝与灵芝草，龙婆被擒。",
          "pass_condition": "夺取两件宝物并活捉龙婆。",
          "hints": [
            "如何模仿九头虫的语气消除宫主怀疑？",
            "佛宝与灵芝草的存放位置是否有机关？",
            "是否需留龙婆活口以证盗宝真相？"
          ]
        }
      ]
    },
    {
      "content": "却说孙大圣恼恼闷闷，起在空中，欲待回花果山水帘洞，恐本洞小妖见笑，笑我出乎尔反乎尔，不是个大丈夫之器；欲待要投奔天宫，又恐天宫内不容久住；欲待要投海岛，却又羞见那三岛诸仙；欲待要奔龙宫，又不伏气求告龙王。真个是无依无倚，苦自忖量道：“罢！罢！罢！我还去见我师父，还是正果。”遂按下云头，径至三藏马前侍立道：“师父，恕弟子这遭！\n \n向后再不敢行凶，一一受师父教诲，千万还得我保你西天去也。”唐僧见了，更不答应，兜住马，即念《紧箍儿咒》，颠来倒去，又念有二十余遍，把大圣咒倒在地，箍儿陷在肉里有一寸来深浅，方才住口道：“你不回去，又来缠我怎的？”行者只教：\n \n“莫念！莫念！我是有处过日子的，只怕你无我去不得西天。”\n \n三藏发怒道：“你这猢狲杀生害命，连累了我多少，如今实不要你了！我去得去不得，不干你事！快走快走！迟了些儿，我又念真言，这番决不住口，把你脑浆都勒出来哩！”大圣疼痛难忍，见师父更不回心，没奈何，只得又驾筋斗云，起在空中，忽然省悟道：“这和尚负了我心，我且向普陀崖告诉观音菩萨去来。”\n \n好大圣，拨回筋斗，那消一个时辰，早至南洋大海，住下祥光，直至落伽山上，撞入紫竹林中，忽见木叉行者迎面作礼道：\n \n“大圣何往？”行者道：“要见菩萨。”木叉即引行者至潮音洞口，又见善财童子作礼道：“大圣何来？”行者道：“有事要告菩萨。”\n \n善财听见一个告字，笑道：“好刁嘴猴儿！还象当时我拿住唐僧被你欺哩！我菩萨是个大慈大悲，大愿大乘，救苦救难，无边无量的圣善菩萨，有甚不是处，你要告他？”行者满怀闷气，一闻此言，心中怒发，咄的一声，把善财童子喝了个倒退，道：“这个背义忘恩的小畜生，着实愚鲁！你那时节作怪成精，我请菩萨收了你，皈正迦持，如今得这等极乐长生，自在逍遥，与天同寿，还不拜谢老孙，转倒这般侮慢（对人轻视，态度傲慢）！我是有事来告求菩萨，却怎么说我刁嘴要告菩萨？”善财陪笑道：“还是个急猴子，我与你作笑耍子，你怎么就变脸了？”\n \n正讲处，只见白鹦哥飞来飞去，知是菩萨呼唤，木叉与善财遂向前引导，至宝莲台下。行者望见菩萨，倒身下拜，止不住泪如泉涌，放声大哭。菩萨教木叉与善财扶起道：“悟空，有甚伤感之事，明明说来，莫哭莫哭，我与你救苦消灾也。”行者垂泪再拜道：“当年弟子为人，曾受那个气来？自蒙菩萨解脱天灾，秉教沙门，保护唐僧往西天拜佛求经，我弟子舍身拚命，救解他的魔障，就如老虎口里夺脆骨，蛟龙背上揭生鳞。只指望归真正果，洗业除邪，怎知那长老背义忘恩，直迷了一片善缘，更不察皂白之苦！”菩萨道：“且说那皂白原因来我听。”行者即将那打杀草寇前后始终，细陈了一遍。却说唐僧因他打死多人，心生怨恨，不分皂白，遂念《紧箍儿咒》，赶他几次，上天无路，入地无门，特来告诉菩萨。菩萨道：“唐三藏奉旨投西，一心要秉善为僧，决不轻伤性命。似你有无量神通，何苦打死许多草寇！草寇虽是不良，到底是个人身，不该打死，比那妖禽怪兽、鬼魅精魔不同。那个打死，是你的功绩；这人身打死，还是你的不仁。但祛退散，自然救了你师父，据我公论，还是你的不善。”行者噙泪叩头道：“纵是弟子不善，也当将功折罪，不该这般逐我。万望菩萨舍大慈悲，将《松箍儿咒》念念，褪下金箍，交还与你，放我仍往水帘洞逃生去罢！”菩萨笑道：“《紧箍儿咒》，本是如来传我的。当年差我上东土寻取经人，赐我三件宝贝，乃是锦襕袈裟、九环锡杖、金紧禁三个箍儿，秘授与咒语三篇，却无甚么《松箍儿咒》。”行者道：“既如此，我告辞菩萨去也。”\n \n菩萨道：“你辞我往那里去？”行者道：“我上西天，拜告如来，求念《松箍儿咒》去也。”菩萨道：“你且住，我与你看看祥晦如何。”行者道：“不消看，只这样不祥也彀了。”菩萨道：“我不看你，看唐僧的祥晦。”好菩萨，端坐莲台，运心三界，慧眼遥观，遍周宇宙，霎时间开口道：“悟空，你那师父顷刻之际，就有伤身之难，不久便来寻你。你只在此处，待我与唐僧说，教他还同你去取经，了成正果。”孙大圣只得皈依，不敢造次，侍立于宝莲台下不题。\n \n却说唐长老自赶回行者，教八戒引马，沙僧挑担，连马四口，奔西走不上五十里远近，三藏勒马道：“徒弟，自五更时出了村舍，又被那弼马温着了气恼，这半日饥又饥，渴又渴，那个去化些斋来我吃？”八戒道：“师父且请下马，等我看可有邻近的庄村，化斋去也。”三藏闻言，滚下马来。呆子纵起云头，半空中仔细观看，一望尽是山岭，莫想有个人家。八戒按下云来，对三藏道：“却是没处化斋，一望之间，全无庄舍。”三藏道：“既无化斋之处，且得些水来解渴也可。”八戒道：“等我去南山涧下取些水来。”沙僧即取钵盂，递与八戒，八戒托着钵盂，驾起云雾而去。那长老坐在路旁，等彀多时，不见回来，可怜口干舌苦难熬。有诗为证，诗曰：保神养气谓之精，情性原来一禀形。心乱神昏诸病作，形衰精败道元倾。三花不就空劳碌，四大萧条枉费争。土木无功金水绝，法身疏懒几时成！沙僧在旁，见三藏饥渴难忍，八戒又取水不来，只得稳了行囊，拴牢了白马道：\n \n“师父，你自在着，等我去催水来。”长老含泪无言，但点头相答。沙僧急驾云光，也向南山而去。\n \n那师父独炼自熬，困苦太甚，正在怆惶之际，忽听得一声响亮，唬得长老欠身看处，原来是孙行者跪在路旁，双手捧着一个磁杯道：“师父，没有老孙，你连水也不能彀哩。这一杯好凉水，你且吃口水解渴，待我再去化斋。”长老道：“我不吃你的水！立地渴死，我当任命！不要你了！你去罢！”行者道：“无我你去不得西天也。”三藏道：“去得去不得，不干你事！泼猢狲！\n \n只管来缠我做甚！”那行者变了脸，发怒生嗔，喝骂长老道：“你这个狠心的泼秃，十分贱我！”轮铁棒，丢了磁杯，望长老脊背上砑（yà）了一下，那长老昏晕在地，不能言语，被他把两个青毡包袱，提在手中，驾筋斗云，不知去向。\n \n却说八戒托着钵盂，只奔山南坡下，忽见山凹之间，有一座草舍人家。原来在先看时，被山高遮住，未曾见得；今来到边前，方知是个人家。呆子暗想道：“我若是这等丑嘴脸，决然怕我，枉劳神思，断然化不得斋饭。须是变好！须是变好！”好呆子，捻着诀，念个咒，把身摇了七八摇，变作一个食痨病（中医指结核病）黄胖和尚，口里哼哼喷喷的，挨近门前，叫道：“施主，厨中有剩饭，路上有饥人。贫僧是东土来往西天取经的，我师父在路饥渴了，家中有锅巴冷饭，千万化些儿救口。”原来那家子男人不在，都去插秧种谷去了，只有两个女人在家，正才煮了午饭，盛起两盆，却收拾送下田，锅里还有些饭与锅巴，未曾盛了。那女人见他这等病容，却又说东土往西天去的话，只恐他是病昏了胡说，又怕跌倒，死在门首，只得哄哄翕翕，将些剩饭锅巴，满满的与了一钵。呆子拿转来，现了本象，径回旧路。正走间，听得有人叫“八戒”。八戒抬头看时，却是沙僧站在山崖上喊道：“这里来！这里来！”及下崖，迎至面前道：“这涧里好清水不舀，你往那里去的？”八戒笑道：“我到这里，见山凹子有个人家，我去化了这一钵干饭来了。”沙僧道：“饭也用着，只是师父渴得紧了，怎得水去？”八戒道：“要水也容易，你将衣襟来兜着这饭，等我使钵盂去舀水。”\n \n二人欢欢喜喜，回至路上，只见三藏面磕地，倒在尘埃，白马撒缰，在路旁长嘶跑跳，行李担不见踪影。慌得八戒跌脚捶胸，大呼小叫道：“不消讲！不消讲！这还是孙行者赶走的余党，来此打杀师父，抢了行李去了！”沙僧道：“且去把马拴住！”只叫：“怎么好！怎么好！这诚所谓半途而废，中道而止也！”叫一声：“师父！”满眼抛珠，伤心痛哭。八戒道：“兄弟且休哭，如今事已到此，取经之事，且莫说了。你看着师父的尸灵，等我把马骑到那个府州县乡村店集卖几两银子，买口棺木，把师父埋了，我两个各寻道路散伙。”沙僧实不忍舍，将唐僧扳转身体，以脸温脸，哭一声：“苦命的师父！”只见那长老口鼻中吐出热气，胸前温暖，连叫：“八戒，你来！师父未伤命哩！”那呆子才近前扶起。长老苏醒，呻吟一会，骂道：“好泼猢狲，打杀我也！”沙僧、八戒问道：“是那个猢狲？”长老不言，只是叹息，却讨水吃了几口，才说：“徒弟，你们刚去，那悟空更来缠我。是我坚执不收，他遂将我打了一棒，青毡包袱都抢去了。”八戒听说，咬响口中牙，发起心头火道：“叵耐（不可忍耐）这泼猴子，怎敢这般无礼！”教沙僧道：“你伏侍师父，等我到他家讨包袱去！”沙僧道：“你且休发怒，我们扶师父到那山凹人家化些热茶汤，将先化的饭热热，调理师父，再去寻他。”八戒依言，把师父扶上马，拿着钵盂，兜着冷饭，直至那家门首，只见那家止有个老婆子在家，忽见他们，慌忙躲过。沙僧合掌道：“老母亲，我等是东土唐朝差往西天去者，师父有些不快，特拜府上，化口热茶汤，与他吃饭。”那妈妈道：“适才有个食痨病和尚，说是东土差来的，已化斋去了，又有个甚么东土的。我没人在家，请别转转。”长老闻言，扶着八戒，下马躬身道：“老婆婆，我弟子有三个徒弟，合意同心，保护我上天竺国大雷音拜佛求经。只因我大徒弟唤孙悟空一生凶恶，不遵善道，是我逐回。不期他暗暗走来，着我背上打了一棒，将我行囊衣钵抢去。如今要着一个徒弟寻他取讨，因在那空路上不是坐处，特来老婆婆府上权安息一时。待讨将行李来就行，决不敢久住。”那妈妈道：“刚才一个食痨病黄胖和尚，他化斋去了，也说是东土往西天去的，怎么又有一起？”\n \n八戒忍不住笑道：“就是我。因我生得嘴长耳大，恐你家害怕，不肯与斋，故变作那等模样。你不信，我兄弟衣兜里不是你家锅巴饭？”那妈妈认得果是他与的饭，遂不拒他，留他们坐了，却烧了一確热茶，递与沙僧泡饭。沙僧即将冷饭泡了，递与师父。师父吃了几口，定性多时，道：“那个去讨行李？”八戒道：\n \n“我前年因师父赶他回去，我曾寻他一次，认得他花果山水帘洞，等我去！等我去！”长老道：“你去不得。那猢狲原与你不和，你又说话粗鲁，或一言两句之间，有些差池，他就要打你。着悟净去罢。”沙僧应承道：“我去，我去。”长老又吩咐沙僧道：“你到那里，须看个头势。他若肯与你包袱，你就假谢谢拿来；若不肯，切莫与他争竞，径至南海菩萨处，将此情告诉，请菩萨去问他要。”沙僧一一听从，向八戒道：“我今寻他去，你千万莫僝僽，好生供养师父。这人家亦不可撒泼，恐他不肯供饭，我去就回。”八戒点头道：“我理会得。但你去，讨得讨不得，次早回来，不要弄做尖担担柴两头脱也。”沙僧遂捻了诀，驾起云光，直奔东胜神洲而去。真个是：身在神飞不守舍，有炉无火怎烧丹。黄婆别主求金老，木母延师奈病颜。此去不知何日返，这回难量几时还。五行生克情无顺，只待心猿复进关。\n \n那沙僧在半空里，行经三昼夜，方到了东洋大海，忽闻波浪之声，低头观看，真个是黑雾涨天阴气盛，沧溟（高远幽深的天空）衔日晓光寒。\n \n他也无心观玩，望仙山渡过瀛洲，向东方直抵花果山界。乘海风，踏水势，又多时，却望见高峰排戟，峻壁悬屏，即至峰头，按云找路下山，寻水帘洞。步近前，只听得一派喧声，见那山中无数猴精，滔滔乱嚷。沙僧又近前仔细再看，原来是孙行者高坐石台之上，双手扯着一张纸，朗朗的念道：“东土大唐王皇帝李，驾前敕命御弟圣僧陈玄奘法师，上西方天竺国娑婆灵山大雷音寺专拜如来佛祖求经。朕因促病侵身，魂游地府，幸有阳数臻（zhēn）长，感冥君放送回生，广陈善会，修建度亡道场。盛蒙救苦救难观世音菩萨金身出现，指示西方有佛有经，可度幽亡超脱，特着法师玄奘，远历千山，询求经偈。倘过西邦诸国，不灭善缘，照牒施行。大唐贞观一十三年秋吉日御前文牒。自别大国以来，经度诸邦，中途收得大徒弟孙悟空行者，二徒弟猪悟能八戒，三徒弟沙悟净和尚。”念了从头又念。沙僧听得是通关文牒，止不住近前厉声高叫：“师兄，师父的关文你念他怎的？”\n \n那行者闻言急抬头，不认得是沙僧，叫：“拿来！拿来！”众猴一齐围绕，把沙僧拖拖扯扯，拿近前来，喝道：“你是何人，擅敢近吾仙洞？”沙僧见他变了脸，不肯相认，只得朝上行礼道：“上告师兄，前者实是师父性暴，错怪了师兄，把师兄咒了几遍，逐赶回家。一则弟等未曾劝解，二来又为师父饥渴去寻水化斋。不意师兄好意复来，又怪师父执法不留，遂把师父打倒，昏晕在地，将行李抢去。后救转师父，特来拜兄，若不恨师父，还念昔日解脱之恩，同小弟将行李回见师父，共上西天，了此正果。倘怨恨之深，不肯同去，千万把包袱赐弟，兄在深山，乐桑榆（夕阳光照桑榆树梢，意指日暮。此处比喻晚年）晚景，亦诚两全其美也。”\n \n行者闻言，呵呵冷笑道：“贤弟，此论甚不合我意。我打唐僧，抢行李，不因我不上西方，亦不因我爱居此地。我今熟读了牒文，我自己上西方拜佛求经，送上东土，我独成功，教那南赡部洲人立我为祖，万代传名也。”沙僧笑道：“师兄言之欠当，自来没个孙行者取经之说。我佛如来造下三藏真经，原着观音菩萨向东土寻取经人求经，要我们苦历千山，询求诸国，保护那取经人。菩萨曾言：取经人乃如来门生，号曰金蝉长老，只因他不听佛祖谈经，贬下灵山，转生东土，教他果正西方，复修大道。遇路上该有这般魔障，解脱我等三人，与他做护法。兄若不得唐僧去，那个佛祖肯传经与你！却不是空劳一场神思也？”\n \n那行者道：“贤弟，你原来懞懂，但知其一，不知其二。谅你说你有唐僧，同我保护，我就没有唐僧？我这里另选个有道的真僧在此，老孙独力扶持，有何不可！已选明日起身去矣。你不信，待我请来你看。”叫：“小的们，快请老师父出来。”果跑进去，牵出一匹白马，请出一个唐三藏，跟着一个八戒，挑着行李；一个沙僧，拿着锡杖。这沙僧见了大怒道：“我老沙行不更名，坐不改姓，那里又有一个沙和尚！不要无礼！吃我一杖！”好沙僧，双手举降妖杖，把一个假沙僧劈头一下打死，原来这是一个猴精。那行者恼了，轮金箍棒，帅众猴，把沙僧围了。沙僧东冲西撞，打出路口，纵云雾逃生道：“这泼猴如此惫懒，我告菩萨去来！”那行者见沙僧打死一个猴精，把沙和尚逼得走了，他也不来追赶，回洞教小的们把打死的妖尸拖在一边，剥了皮，取肉煎炒，将椰子酒、葡萄酒，同众猴都吃了。另选一个会变化的妖猴，还变一个沙和尚，从新教道，要上西方不题。\n \n沙僧一驾云离了东海，行经一昼夜，到了南海。正行时，早见落伽山不远，急至前低停云雾观看。好去处！果然是：包乾之奥，括坤之区。会百川而浴日滔星，归众流而生风漾月。潮发腾凌大鲲化，波翻浩荡巨鳌游。水通西北海，浪合正东洋。四海相连同地脉，仙方洲岛各仙宫。休言满地蓬莱，且看普陀云洞。好景致！山头霞彩壮元精，岩下祥风漾月晶。紫竹林中飞孔雀，绿杨枝上语灵鹦。琪花瑶草年年秀，宝树金莲岁岁生。白鹤几番朝顶上，素鸾数次到山亭。游鱼也解修真性，跃浪穿波听讲经。沙僧徐步落伽山，玩看仙境，只见木叉行者当面相迎道：“沙悟净，你不保唐僧取经，却来此何干？”沙僧作礼毕道：\n \n“有一事特来朝见菩萨，烦为引见引见。”木叉情知是寻行者，更不题起，即先进去对菩萨道：“外有唐僧的小徒弟沙悟净朝拜。”孙行者在台下听见，笑道：“这定是唐僧有难，沙僧来请菩萨的。”菩萨即命木叉门外叫进。这沙僧倒身下拜，拜罢抬头正欲告诉前事，忽见孙行者站在旁边，等不得说话，就掣降妖杖望行者劈脸便打。这行者更不回手，彻身躲过。沙僧口里乱骂道：“我把你个犯十恶造反的泼猴！你又来影瞒菩萨哩！”菩萨喝道：“悟净不要动手，有甚事先与我说。”沙僧收了宝杖，再拜台下，气冲冲的对菩萨道：“这猴一路行凶，不可数计。前日在山坡下打杀两个剪路的强人，师父怪他。不期晚间就宿在贼窝主家里，又把一伙贼人尽情打死，又血淋淋提一个人头来与师父看。师父唬得跌下马来，骂了他几句，赶他回来。分别之后，师父饥渴太甚，教八戒去寻水，久等不来，又教我去寻他。不期孙行者见我二人不在，复回来把师父打一铁棍，将两个青毡包袱抢去。我等回来，将师父救醒，特来他水帘洞寻他讨包袱，不想他变了脸，不肯认我，将师父关文念了又念。我问他念了做甚，他说不保唐僧，他要自上西天取经，送上东土，算他的功果，立他为祖，万古传扬。我又说：没唐僧，那肯传经与你？他说他选了一个有道的真僧。及请出，果是一匹白马，一个唐僧，后跟着八戒、沙僧。我道我便是沙和尚，那里又有个沙和尚？是我赶上前，打了他一宝杖，原来是个猴精。他就帅众拿我，是我特来告请菩萨。不知他会使筋斗云，预先到此处，又不知他将甚巧语花言，影瞒菩萨也。”菩萨道：“悟净，不要赖人，悟空到此今已四日，我更不曾放他回去，他那里有另请唐僧、自去取经之意？”沙僧道：“见如今水帘洞有一个孙行者，怎敢欺诳（欺骗迷惑）？”\n \n菩萨道：“既如此，你休发急，教悟空与你同去花果山看看。是真难灭，是假易除，到那里自见分晓。”这大圣闻言，即与沙僧辞了菩萨。这一去，到那：\n \n花果山前分皂白，水帘洞口辨真邪。\n毕竟不知如何分辨，且听下回分解。",
      "extracted_info": {
        "background": "孙悟空因打死草寇被唐僧赶走，前往南海观音菩萨处诉苦。唐僧在途中被假孙悟空袭击，行李被抢。沙僧前往花果山讨要行李，发现假孙悟空和假唐僧一行人，最终前往南海寻求观音帮助。观音派真悟空与沙僧同去花果山辨认真假。",
        "characters": [
          {
            "name": "孙悟空",
            "description": "被唐僧赶走后向观音菩萨诉苦，后与沙僧前往花果山辨认真假。性格急躁但忠诚，受委屈后仍心系取经。"
          },
          {
            "name": "唐僧",
            "description": "因孙悟空杀生而坚持赶走他，途中被假悟空打伤。固执且严守戒律，坚持不伤人性命的原则。"
          },
          {
            "name": "猪八戒",
            "description": "被派去化缘取水，虽有些懒惰但忠心耿耿，协助沙僧照顾师父。"
          },
          {
            "name": "沙僧",
            "description": "发现假悟空后前往花果山和南海求助，忠诚稳重，在冲突中保持冷静。"
          },
          {
            "name": "观音菩萨",
            "description": "调解孙悟空与唐僧的矛盾，指出悟空过错，并协助辨认真假悟空。智慧慈悲，具权威性。"
          },
          {
            "name": "假孙悟空",
            "description": "花果山的猴精所变，抢夺行李并假冒取经团队，企图自行取经。"
          }
        ],
        "extracted_intermediate_reasoning": ""
      },
      "generated_levels": [
        {
          "level": 1,
          "description": "孙悟空被唐僧念咒驱逐后，在云端徘徊无依，需前往普陀山向观音菩萨诉苦。途中需克制愤怒情绪，避开四大部洲的仙神嘲笑。",
          "pass_condition": "成功抵达南海紫竹林并触发观音对话",
          "hints": [
            "如何利用筋斗云特性快速跨越南洋大海?",
            "孙悟空被紧箍咒折磨时，哪个角色可能暗中协助他?",
            "遇到善财童子阻挠时，该用何种方式证明诚意?",
            "观音殿前的白鹦哥暗示着什么关键线索?"
          ]
        },
        {
          "level": 2,
          "description": "沙僧独闯花果山水帘洞，需识破假悟空布置的幻象陷阱，在万千猴精中找出通关文牒被篡改的证据。",
          "pass_condition": "揭穿假唐僧队伍并夺回真行李",
          "hints": [
            "真假通关文牒的用印颜色有何差异?",
            "如何通过白马的鞍具细节辨别身份?",
            "假沙僧说话时是否会显露猴类习性?",
            "花果山瀑布后的密室藏着什么关键道具?"
          ]
        },
        {
          "level": 3,
          "description": "在观音道场内，需同时应对真假悟空的心灵拷问。通过紧箍咒反应、取经历程记忆测试及功德金光强度验证身份。",
          "pass_condition": "在三次辩识中取得两次正确判定",
          "hints": [
            "真假悟空谁的身上带有六耳猕猴的残存妖气?",
            "金箍棒重量变化会暴露什么信息?",
            "观音净瓶中的柳枝水对谁会产生排斥反应?",
            "提及五行山下喂桃细节会引发什么特殊反应?"
          ]
        },
        {
          "level": 4,
          "description": "最终对决时需引导唐僧念诵紧箍咒，在双倍咒力冲击下迫使假悟空现出六耳原形，同时保护真悟空不被误伤。",
          "pass_condition": "在10秒咒语持续时间内完成真伪分离",
          "hints": [
            "如何利用八戒的九齿钉耙制造声波干扰?",
            "沙僧的降妖杖该插在什么方位形成结界?",
            "真假悟空哪个会对紧箍咒产生延迟疼痛反应?",
            "唐僧的锦襕袈裟在何时会发出辟邪佛光?"
          ]
        },
        {
          "level": 5,
          "description": "六耳猕猴濒死反扑时，需集合取经队伍四人的专属法器，按五行方位布阵镇压其魂魄，防止分身逃逸。",
          "pass_condition": "完成五行降魔阵并坚持三回合",
          "hints": [
            "孙悟空的毫毛该化作哪种五行属性分身?",
            "八戒的钉耙应该插入哪个卦象方位?",
            "沙僧的骷髅项链如何激发前世记忆封印?",
            "唐僧的锡杖震动频率该与哪种佛经同步?"
          ]
        }
      ]
    },
    {
      "content": "话表齐天大圣到底是个妖猴，更不知官衔品从，也不较俸禄高低，但只注名便了。那齐天府下二司仙吏，早晚伏侍，只知日食三餐，夜眠一榻，无事牵萦，自由自在。闲时节会友游宫，交朋结义。见三清，称个“老”字；逢四帝，道个“陛下”。与那九曜星九曜（指北斗七星及辅佐二星）\n、五方将、二十八宿、四大天王、十二元辰、五方五老、普天星相、河汉群神，俱只以弟兄相待，彼此称呼。今日东游，明日西荡，云去云来，行踪不定。\n \n一日，玉帝早朝，班部中闪出许旌阳真人，俯囟（磕头的意思）启奏道：“今有齐天大圣，无事闲游，结交天上众星宿，不论高低，俱称朋友。恐后闲中生事，不若与他一件事管，庶免别生事端。”玉帝闻言，即时宣诏。那猴王欣欣然而至，道：“陛下，诏老孙有何升赏？”玉帝道：“朕见你身闲无事，与你件执事。你且权管那蟠桃园，早晚好生在意。”大圣欢喜谢恩，朝上唱喏而退。\n \n他等不得穷忙，即入蟠桃园内查勘。本园中有个土地拦住，问道：“大圣何往？”大圣道：“吾奉玉帝点差，代管蟠桃园，今来查勘也。”那土地连忙施礼，即呼那一班锄树力士、运水力士、修桃力士、打扫力士都来见大圣磕头，引他进去。但见那：\n \n夭夭灼灼，颗颗株株。夭夭灼灼花盈树，颗颗株株果压枝。果压枝头垂锦弹，花盈树上簇胭脂。时开时结千年熟，无夏无冬万载迟。先熟的，酡颜醉脸；还生的，带蒂青皮。凝烟肌带绿，映日显丹姿。树下奇葩并异卉，四时不谢色齐齐。左右楼台并馆舍，盘空常见罩云霓。\n不是玄都凡俗种，瑶池王母自栽培。\n \n大圣看玩多时，问土地道：“此树有多少株数？”土地道：“有三千六百株：前面一千二百株，花微果小，三千年一熟，人吃了成仙了道，体健身轻。中间一千二百株，层花甘实，六千年一熟，人吃了霞举飞升，长生不老。后面一千二百株，紫纹缃核，九千年一熟，人吃了与天地齐寿，日月同庚。”大圣闻言，欢喜无任，当日查明了株数，点看了亭阁，回府。自此后，三五日一次赏玩，也不交友，也不他游。\n \n一日，见那老树枝头，桃熟大半，他心里要吃个尝新。奈何本园土地、力士并齐天府仙吏紧随不便。忽设一计道：“汝等且出门外伺候，让我在这亭上少憩片时。”那众仙果退。只见那猴王脱了冠着服，爬上大树，拣那熟透的大桃，摘了许多，就在树枝上自在受用。吃了一饱，却跳下来，簪冠著服，唤众等仪从回府。迟三二日，又去设法偷桃，尽他享用。\n \n一朝，王母娘娘设宴，大开宝阁，瑶池中做“蟠桃胜会”，即着那红衣仙女、素衣仙女、青衣仙女、皂衣仙女、紫衣仙女、黄衣仙女、绿衣仙女，各顶花篮，去蟠桃园摘桃建会。七衣仙女直至园门首，只见蟠桃园土地、力士同齐天府二司仙吏，都在那里把门。仙女近前道：“我等奉王母懿旨，到此携桃设宴。”土地道：“仙娥且住。今岁不比往年了，玉帝点差齐天大圣在此督理，须是报大圣得知，方敢开园。”仙女道：“大圣何在？”土地道：“大圣在园内，因困倦，自家在亭子上睡哩。”仙女道：“既如此，寻他去来，不可延误。”\n \n土地即与同进。寻至花亭不见，只有衣冠在亭，不知何往。四下里都没寻处。原来大圣耍了一会，吃了几个桃子，变做二寸长的个人儿，在那大树梢头浓叶之下睡着了。七衣仙女道：“我等奉旨前来，寻不见大圣，怎敢空回？”旁有仙吏道：“仙娥既奉旨来，不必迟疑。我大圣闲游惯了，想是出园会友去了。汝等且去摘桃，我们替你回话便是。”\n \n那仙女依言，入树林之下摘桃。先在前树摘了二篮，又在中树摘了三篮；到后树上摘取，只见那树上花果稀疏，止有几个毛蒂青皮的。原来熟的都是猴王吃了。七仙女张望东西，只见南枝上止有一个半红半白的桃子。青衣女用手扯下枝来，红衣女摘了，却将枝子望上一放。原来那大圣变化了，正睡在此枝，被他惊醒。大圣即现本相，耳朵内掣出金箍棒，幌一幌，碗来粗细，咄的一声道：“你是那方怪物，敢大胆偷摘我桃！”慌得那七仙女一齐跪下道：“大圣息怒。我等不是妖怪，乃王母娘娘差来的七衣仙女，摘取仙桃，大开宝阁，做‘蟠桃胜会’。适至此间，先见了本园土地等神，寻大圣不见。我等恐迟了王母懿旨，是以等不得大圣，故先在此摘桃，万望恕罪。”大圣闻言，回嗔作喜道：“仙娥请起。王母开阁设宴，请的是谁？”仙女道：“上会自有旧规。请的是西天佛老、菩萨、罗汉，南方南极观音，东方崇恩圣帝，十洲三岛仙翁，北方北极玄灵，中央黄极黄角大仙，这个是五方五老。还有五斗星君，上八洞三清、四帝、太乙天仙等众，中八洞玉皇、九垒、海岳神仙，下八洞幽冥教主、注世地仙。各宫各殿大小尊神，俱一齐赴蟠桃嘉会。”大圣笑道：“可请我么？”仙女说：“不曾听得说。”大圣道：“我乃齐天大圣，就请我老孙做个尊席，有何不可？”仙女道：“此是上会会规，今会不知如何。”大圣道：“此言也是，难怪汝等。你且立下，待老孙先去打听个消息，看可请老孙不请。”\n \n好大圣，捻着诀，念声咒语，对众仙女道：“住！住！住！”这原来是个定身法，把那七衣仙女一个个睖睖睁睁，白着眼，都站在桃树之下。大圣纵朵祥云，跳出园内，竟奔瑶池路上而去。正行时，只见那壁厢：\n \n一天瑞霭光摇曳，五色祥云飞不绝。白鹤声鸣振九皋，紫芝色秀分千叶。\n中间现出一尊仙，相貌天然丰采别。神舞虹霓幌汉霄，腰悬宝录无生灭。\n名称赤脚大罗仙，特赴蟠桃添寿节。\n \n那赤脚大仙觌面撞见大圣，大圣低头定计，赚哄真仙，他要暗去赴会，却问：“老道何往？”大仙道：“蒙王母见招，去赴蟠桃嘉会。”大圣道：“老道不知。玉帝因老孙筋斗云疾，着老孙五路邀请列位，先至通明殿下演礼，后方去赴宴。”大仙是个光明正大之人，就以他的诳语作真。道：“常年就在瑶池演礼谢恩，如何先去通明殿演礼，方去瑶池赴会？”无奈，只得拨转祥云，径往通明殿去了。\n \n大圣驾着云，念声咒语，摇身一变，就变做赤脚大仙模样，前奔瑶池。不多时，直至宝阁，按住云头，轻轻移步，走入里面。只见那里：\n \n琼香缭绕，瑞霭缤纷，瑶台铺彩结，宝阁散氤氲。凤翥鸾腾形缥缈，金花玉萼影浮沉。上排着九凤丹霞扆，八宝紫霓墩。五彩描金桌，千花碧玉盆。桌上有龙肝和凤髓，熊掌与猩唇。珍馐百味般般美，异果嘉肴色色新。\n \n那里铺设得齐齐整整，却还未有仙来。这大圣点看不尽，忽闻得一阵酒香扑鼻，忽转头，见右壁厢长廊之下，有几个造酒的仙官，盘糟的力士，领几个运水的道人，烧火的童子，在那里洗缸刷瓮，已造成了玉液琼浆，香醪佳酿。大圣止不住口角流涎，就要去吃，奈何那些人都在这里。他就弄个神通，把毫毛拔下几根，丢入口中嚼碎，喷将出去，念声咒语，叫“变”！即变做几个瞌睡虫，奔在众人脸上。你看那伙人，手软头低，闭眉合眼，丢了执事，都去盹睡。大圣却拿了些百味八珍，佳肴异品，走入长廊里面，就着缸，挨着瓮，放开量，痛饮一番。吃勾了多时，\n酕醄（máo táo，大醉的样子）醉了。自揣自摸道：“不好！不好！再过会，请的客来，却不怪我？一时拿住，怎生是好？不如早回府中睡去也。”\n \n好大圣，摇摇摆摆，仗着酒，任情乱撞，一会把路差了；不是齐天府，却是兜率天宫。一见了，顿然醒悟道：“兜率宫是三十三天之上，乃离恨天太上老君之处，如何错到此间？——也罢！也罢！一向要来望此老，不曾得来，今趁此残步，就望他一望也好。”即整衣撞进去，那里不见老君，四无人迹。原来那老君与燃灯古佛在三层高阁朱陵丹台上讲道，众仙童、仙将、仙官、仙吏，都侍立左右听讲。这大圣直至丹房里面，寻访不遇，但见丹灶之旁，炉中有火。炉左右安放着五个葫芦，葫芦里都是炼就的金丹。大圣喜道：“此物乃仙家之至宝，老孙自了道以来，识破了内外相同之理，也要些金丹济入，不期到家无暇；今日有缘，却又撞着此物，趁老子不在，等我吃他几丸尝新。”他就把那葫芦都倾出来，就都吃了，如吃炒豆相似。\n \n一时间丹满酒醒，又自己揣度道：“不好！不好！这场祸，比天还大；若惊动玉帝，性命难存。走！走！走！不如下界为王去也！”他就跑出兜率宫，不行旧路，从西天门，使个隐身法逃去。即按云头，回至花果山界。但见那旌旗闪灼，戈戟光辉，原来是四健将与七十二洞妖王，在那里演习武艺。大圣高叫道：“小的们！我来也！”众怪丢了器械，跪倒道：“大圣好宽心！丢下我等许久，不来相顾！”大圣道：“没多时！没多时！”且说且行，径入洞天深处。四健将打扫安歇叩头礼拜毕。俱道：“大圣在天这百十年，实受何职？”大圣笑道：“我记得才半年光景，怎么就说百十年话？”健将道：“在天一日，即在下方一年也。”大圣道：“且喜这番玉帝相爱，果封做‘齐天大圣’，起一座齐天府，又设安静、宁神二司，司设仙吏侍卫。向后见我无事，着我看管蟠桃园。近因王母娘娘设‘蟠桃大会’，未曾请我，是我不待他请，先赴瑶池，把他那仙品、仙酒，都是我偷吃了。走出瑶池，踉踉跄跄误入老君宫阙（què） ，又把他五个葫芦金丹也偷吃了。但恐玉帝见罪，方才走出天门来也。”\n \n众怪闻言大喜。即安排酒果接风，将椰酒满斟一石碗奉上，大圣喝了一口，即咨牙咧嘴道：“不好吃！不好吃！”崩、巴二将道：“大圣在天宫，吃了仙酒、仙肴，是以椰酒不甚美口。常言道：‘美不美，乡中水。’”大圣道：“你们就是‘亲不亲，故乡人。’我今早在瑶池中受用时，见那长廊之下，有许多瓶罐，都是那玉液琼浆。你们都不曾尝着。待我再去偷他几瓶回来，你们各饮半杯，一个个也长生不老。”众猴欢喜不胜。大圣即出洞门，又翻一筋斗，使个隐身法，径至蟠桃会上。进瑶池宫阙，只见那几个造酒、盘糟、运水、烧火的，还鼾睡未醒。他将大的从左右胁下挟了两个，两手提了两个，即拨转云头回来，会众猴在于洞中，就做个“仙酒会”，各饮了几杯，快乐不题。却说那七衣仙女自受了大圣的定身法术，一周天方能解脱。各提花篮，回奏王母，说道：“齐天大圣使法术困住我等，故此来迟。”王母问道：“你等摘了多少蟠桃？”仙女道：“只有两篮小桃，三篮中桃。至后面，大桃半个也无，想都是大圣偷吃了。及正寻间，不期大圣走将出来，行凶挖打，又问设宴请谁。我等把上会事说了一遍，他就定住我等，不知去向。只到如今，才得醒解回来。”\n \n王母闻言，即去见玉帝，备陈前事。说不了，又见那造酒的一班人，同仙官等来奏：“不知甚么人，搅乱了‘蟠桃大会’，偷吃了玉液琼浆，其八珍百味，亦俱偷吃了。”又有四个大天师来奏上：“太上道祖来了。”玉帝即同王母出迎。老君朝礼毕，道：“老道宫中，炼了些‘九转金丹’，伺候陛下做‘丹元大会’，不期被贼偷去，特启陛下知之。”玉帝见奏，悚惧。少时，又有齐天府仙吏叩头道：“孙大圣不守执事，自昨日出游，至今未转，更不知去向。”玉帝又添疑思。只见那赤脚大仙又俯囟上奏道：“臣蒙王母诏昨日赴会，偶遇齐天大圣，对臣言万岁有旨，着他邀臣等先赴通明殿演礼，方去赴会。臣依他言语，即返至通明殿外，不见万岁龙车凤辇，又急来此俟候。”玉帝越发大惊道：“这厮假传旨意，赚哄贤卿，快着纠察灵官缉访这厮踪迹！”\n \n灵官领旨，即出殿遍访尽得其详细。回奏道：“搅乱天宫者，乃齐天大圣也。”又将前事尽诉一番。玉帝大恼。即差四大天王，协同李天王并哪吒太子，点二十八宿、九曜星官、十二元辰、五方揭谛、四值功曹、东西星斗、南北二神、五岳四渎、普天星相，共十万天兵，布一十八架天罗地网下界，去花果山围困，定捉获那厮处治。众神即时兴师，离了天宫。这一去，但见那：\n \n黄风滚滚遮天暗，紫雾腾腾罩地昏。只为妖猴欺上帝，致令众圣降凡尘。四大天王，五方揭谛：四大天王权总制，五方揭谛调多兵。李托塔中军掌号，恶哪吒前部先锋。罗睺星为头检点，计都星随后峥嵘 （zhēng róng ） 。太阴星精神抖擞，太阳星照耀分明。五行星偏能豪杰，九曜星最喜相争。元辰星子午卯酉，一个个都是大力天丁。五瘟（wēn）五岳东西摆，六丁六甲左右行。四渎龙神分上下，二十八宿密层层。角亢氐房为总领，奎娄胃昴惯翻腾。斗牛女虚危室壁，心尾箕星个个能，井鬼柳星张翼轸，轮枪舞剑显威灵。停云降雾临凡世，花果山前扎下营。\n \n诗曰：\n天产猴王变化多，偷丹偷酒乐山窝。\n只因搅乱蟠桃会，十万天兵布网罗。\n \n当时李天王传了令，着众天兵扎了营，把那花果山围得水泄不通。上下布了十八架天罗地网，先差九曜恶星出战。九曜即提兵径至洞外，只见那洞外大小群猴跳跃顽耍。星官厉声高叫道：“那小妖！你那大圣在那里？我等乃上界差调的天神，到此降你这造反的大圣。教他快快来归降；若道半个‘不’字，教汝等一概遭诛！”那小妖慌忙传入道：“大圣，祸事了！祸事了！外面有九个凶神，口称上界来的天神，收降大圣。”\n \n那大圣正与七十二洞妖王，并四健将分饮仙酒，一闻此报，公然不理道：“今朝有酒今朝醉，莫管门前是与非！”说不了，一起小妖又跳来道：“那九个凶神，恶言泼语，在门前骂战哩！”大圣笑道：“莫睬他。‘诗酒且图今日乐，功名休问几时成。’”说犹未了，又一起小妖来报：“爷爷！那九个凶神已把门打破了，杀进来也！”大圣怒道：“这泼毛神，老大无礼！本来不与他计较，如何上门来欺我？”即命独角鬼王，领帅七十二洞妖王出阵，老孙领四健将随后。那鬼王疾帅妖兵，出门迎敌，却被九曜恶星一齐掩杀，抵住在铁板桥头，莫能得出。\n \n正嚷间，大圣到了。叫一声“开路！”掣开铁棒，幌一幌，碗来粗细，丈二长短，丢开架子，打将出来。九曜星那个敢抵，一时打退。那九曜星立住阵势道：“你这不知死活的弼马温！你犯了十恶之罪，先偷桃，后偷酒，搅乱了蟠桃大会，又窃了老君仙丹，又将御酒偷来此处享乐。你罪上加罪，岂不知之？”大圣笑道：“这几椿事，实有！实有！但如今你怎么？”九曜星道：“吾奉玉帝金旨，帅众到此收降你，快早皈依！免教这些生灵纳命。不然，就屣平了此山，掀翻了此洞也！”大圣大怒道：“量你这些毛神，有何法力，敢出浪言，不要走，请吃老孙一棒！”这九曜星一齐踊跃。那美猴王不惧分毫，轮起金箍棒，左遮右挡，把那九曜星战得筋疲力软，一个个倒拖器械，败阵而走，急入中军帐下，对托塔天王道：“那猴王果十分骁勇！我等战他不过，败阵来了。”李天王即调四大天王与二十八宿，一路出师来斗。大圣也公然不惧，调出独角鬼王、七十二洞妖王与四个健将，于洞门外列成阵势。你看这场混战，好惊人也：\n \n寒风飒飒，怪雾阴阴。那壁廊旌旗飞彩，这壁厢戈戟生辉。滚滚盔明，层层甲亮。滚滚盔明映太阳，如撞天的银磬；层层甲亮砌岩崖，似压地的冰山。大捍刀，飞云掣电，楮白枪，度雾穿云。方天戟，虎眼鞭，麻林摆列；青铜剑，四明铲，密树排阵。弯弓硬弩雕翎箭，短棍蛇矛挟了魂。大圣一条如意棒，翻来覆去战天神。杀得那空中无鸟过，山内虎狼奔。扬砂走石乾坤黑，播土飞尘宇宙昏。只听兵兵扑扑惊天地，煞煞威威振鬼神。\n \n这一场自辰时布阵，混杀到日落西山。那独角鬼王与七十二洞妖怪，尽被众天神捉拿去了，止走了四健将与那群猴，深藏在水帘洞底。这大圣一条棒，抵住了四大天神与李托塔、哪吒太子，俱在半空中，——杀勾多时，大圣见天色将晚，即拉毫毛一把，丢在口中，嚼将出去，叫声“变！”就变了千百个大圣，都使的是金箍棒，打退了哪吒太子，战败了五个天王。\n \n大圣得胜，收了毫毛，急转身回洞，早又见铁板桥头，四个健将，领众叩迎那大圣，哽哽咽咽大哭三声，又唏唏哈哈大笑三声。大圣道：“汝等见了我，又哭又笑，何也？”四健将道：“今早帅众将与天王交战，把七十二洞妖王与独角鬼王，尽被众神捉了，我等逃生，故此该哭。这见大圣得胜回来，未曾伤损，故此该笑。”大圣道：“胜负乃兵家之常。古人云：‘杀人一万，自损三千。’况捉了去的头目乃是虎、豹、狼虫、獾獐、狐骆之类，我同类者未伤一个，何须烦恼？他虽被我使个分身法杀退，他还要安营在我山脚下。我等且紧紧防守，饱食一顿，安心睡觉，养养精神。天明看我使个大神通，拿这些天将，与众报仇。”四将与众猴将椰酒吃了几碗，安心睡觉不题。\n \n那四大天王收兵罢战，众各报功：有拿住虎豹的，有拿住狮象的，有拿住狼虫狐骆的，更不曾捉着一个猴精。当时果又安辕营，下大寨，赏劳了得功之将，吩咐了天罗地网之兵，个个提铃喝号，围困了花果山，专待明早大战。各人得令，一处处谨守。此正是：\n \n妖猴作乱惊天地，布网张罗昼夜看。\n毕竟天晓后如何处治，且听下回分解。",
      "extracted_info": {
        "background": "齐天大圣孙悟空被玉帝派去管理蟠桃园，但他偷吃蟠桃，并因未被邀请参加蟠桃会而扰乱宴会，盗取仙酒和太上老君的金丹。玉帝震怒，派遣十万天兵天将围困花果山，引发激烈战斗。孙悟空凭借神通屡次击退天兵，最终双方僵持，待次日再战。",
        "characters": [
          {
            "name": "齐天大圣（孙悟空）",
            "description": "妖猴，被封为齐天大圣；生性顽劣，偷蟠桃、仙酒、金丹，善用金箍棒与七十二变，不惧天庭权威。"
          },
          {
            "name": "玉帝",
            "description": "天庭统治者，任命孙悟空管理蟠桃园，后因孙悟空扰乱天宫而下令派兵捉拿。"
          },
          {
            "name": "许旌阳真人",
            "description": "天庭仙官，向玉帝建议给孙悟空安排职务以防其生事。"
          },
          {
            "name": "蟠桃园土地",
            "description": "管理蟠桃园的仙吏，向孙悟空介绍蟠桃树详情，并率力士侍奉。"
          },
          {
            "name": "七衣仙女",
            "description": "王母差遣的七位仙女，奉命摘桃赴会，被孙悟空定身法术所困。"
          },
          {
            "name": "赤脚大仙",
            "description": "赴蟠桃会的仙人，被孙悟空欺骗转往通明殿，使其冒充自己进入瑶池。"
          },
          {
            "name": "太上老君",
            "description": "兜率宫之主，金丹被孙悟空偷吃，向玉帝禀报失窃之事。"
          },
          {
            "name": "托塔李天王",
            "description": "天兵统帅，率四大天王、哪吒等布下天罗地网围攻花果山。"
          },
          {
            "name": "哪吒",
            "description": "李天王之子，作为先锋与孙悟空交战，后被分身术击败。"
          },
          {
            "name": "九曜星",
            "description": "天庭战将，率先挑战孙悟空，被其击退。"
          },
          {
            "name": "独角鬼王",
            "description": "花果山妖王之一，率众迎战天兵，最终被天神擒拿。"
          }
        ],
        "extracted_intermediate_reasoning": ""
      },
      "generated_levels": [
        {
          "level": 1,
          "description": "孙悟空被玉帝派去管理蟠桃园，发现蟠桃成熟后起了贪念。土地与力士们时刻跟随，难以偷桃。",
          "pass_condition": "成功偷吃蟠桃且不被土地和力士发现。",
          "hints": [
            "如何支开蟠桃园土地和力士单独行动？",
            "孙悟空可用哪种法术隐藏偷桃行为？",
            "不同品级的蟠桃效果有何差异？"
          ]
        },
        {
          "level": 2,
          "description": "七衣仙女奉王母之命摘桃，发现大桃被孙悟空吃光。孙悟空为掩盖真相定住仙女。",
          "pass_condition": "阻止七衣仙女上报偷桃实情并脱身。",
          "hints": [
            "如何应对七衣仙女的质问？",
            "定身法术的施展需要满足什么条件？",
            "为何孙悟空要询问蟠桃会邀请名单？"
          ]
        },
        {
          "level": 3,
          "description": "孙悟空冒充赤脚大仙混入瑶池，需在仙官力士监视下盗取仙酒。",
          "pass_condition": "偷取仙酒并安全离开瑶池。",
          "hints": [
            "如何伪装成赤脚大仙不被识破？",
            "瞌睡虫法术对哪些角色有效？",
            "醉酒后如何避免被天兵追踪？"
          ]
        },
        {
          "level": 4,
          "description": "孙悟空误入兜率宫，趁太上老君不在时偷吃金丹。丹房设有防护禁制。",
          "pass_condition": "吞服全部金丹并逃离兜率宫。",
          "hints": [
            "如何判断太上老君是否在宫中？",
            "金丹的存放位置有何规律？",
            "隐身法能否避开炼丹童子的耳目？"
          ]
        },
        {
          "level": 5,
          "description": "十万天兵包围花果山，九曜星率先叫阵，独角鬼王率妖兵迎战却遭擒。",
          "pass_condition": "击退九曜星并保全四健将。",
          "hints": [
            "如何利用分身术对抗群体敌人？",
            "金箍棒变化尺寸对战斗有何帮助？",
            "为何说七十二洞妖王被擒不影响战略？"
          ]
        },
        {
          "level": 6,
          "description": "托塔天王发动总攻，哪吒与四大天王联手围攻孙悟空。",
          "pass_condition": "同时抵挡哪吒火尖枪和四大天王法宝。",
          "hints": [
            "三头六臂法术如何增强防御？",
            "花果山地形对躲避天罗地网有何作用？",
            "为何故意放走部分天兵？"
          ]
        }
      ]
    },
    {
      "content": "义结孔怀，法归本性。金顺木驯成正果，心猿木母合丹元。\n \n共登极乐世界，同来不二法门。经乃修行之总径，佛配自己之元神。兄和弟会成三契，妖与魔色应五行。剪除六门趣，即赴大雷音。却说那呆子被一窝猴子捉住了，扛抬扯拉，把一件直裰子揪破，口里劳劳叨叨的，自家念诵道：“罢了！罢了！这一去有个打杀的情了！”不一时，到洞口。那大圣坐在石崖之上，骂道：“你这馕糠的劣货！你去便罢了，怎么骂我？”八戒跪在地下道：“哥啊，我不曾骂你，若骂你，就嚼了舌头根。我只说哥哥不去，我自去报师父便了，怎敢骂你？”行者道：“你怎么瞒得过我？我这左耳往上一扯，晓得三十三天人说话；我这右耳往下一扯，晓得十代阎王与判官算帐。你今走路把我骂，我岂不听见？”八戒道：“哥啊，我晓得你贼头鼠脑的，一定又变作个甚么东西儿，跟着我听的。”行者叫：“小的们，选大棍来！先打二十个见面孤拐，再打二十个背花，然后等我使铁棒与他送行！”八戒慌得磕头道：“哥哥，千万看师父面上，饶了我罢！”行者道：\n \n“我想那师父好仁义儿哩！”八戒又道：“哥哥，不看师父啊，请看海上菩萨之面，饶了我罢！”\n \n行者见说起菩萨，却有三分儿转意道：“兄弟，既这等说，我且不打你，你却老实说，不要瞒我。那唐僧在那里有难，你却来此哄我？”八戒道：“哥哥，没甚难处，实是想你。”行者骂道：\n \n“这个好打的劣货！你怎么还要者嚣？我老孙身回水帘洞，心逐取经僧。那师父步步有难，处处该灾，你趁早儿告诵我，免打！”八戒闻得此言，叩头上告道：“哥啊，分明要瞒着你，请你去的，不期你这等样灵。饶我打，放我起来说罢。”行者道：“也罢，起来说。”众猴撒开手，那呆子跳得起来，两边乱张，行者道：“你张甚么？”八戒道：“看看那条路儿空阔，好跑。”行者道：\n \n“你跑到那里？我就让你先走三日，老孙自有本事赶转你来！快早说来，这一恼发我的性子，断不饶你！”八戒道：“实不瞒哥哥说，自你回后，我与沙僧保师父前行。只见一座黑松林，师父下马，教我化斋。我因许远，无一个人家，辛苦了，略在草里睡睡。\n \n不想沙僧别了师父，又来寻我。你晓得师父没有坐性，他独步林间玩景，出得林，见一座黄金宝塔放光，他只当寺院，不期塔下有个妖精，名唤黄袍，被他拿住。后边我与沙僧回寻，止见白马行囊，不见师父，随寻至洞口，与那怪厮杀。师父在洞，幸亏了一个救星，原是宝象国王第三个公主，被那怪摄来者。他修了一封家书，托师父寄去，遂说方便，解放了师父。到了国中，递了书子，那国王就请师父降妖，取回公主。哥啊，你晓得，那老和尚可会降妖？我二人复去与战。不知那怪神通广大，将沙僧又捉了，我败阵而走，伏在草中。那怪变做个俊俏文人入朝，与国王认亲，把师父变作老虎。又亏了白龙马夜现龙身，去寻师父。师父倒不曾寻见，却遇着那怪在银安殿饮酒。他变一宫娥，与他巡酒舞刀，欲乘机而砍，反被他用满堂红打伤马腿。就是他教我来请师兄的，说道：“师兄是个有仁有义的君子，君子不念旧恶，一定肯来救师父一难。’万望哥哥念一日为师、终身为父之情，千万救他一救！”行者道：“你这个呆子！我临别之时，曾叮咛又叮咛，说道：‘若有妖魔捉住师父，你就说老孙是他大徒弟。’怎么却不说我？”八戒又思量道：“请将不如激将，等我激他一激。”道：“哥啊，不说你还好哩，只为说你，他一发无状！”行者道：“怎么说？”八戒道：“我说：‘妖精，你不要无礼，莫害我师父！我还有个大师兄，叫做孙行者。他神通广大，善能降妖。他来时教你死无葬身之地！’那怪闻言，越加忿怒，骂道：‘是个甚么孙行者，我可怕他？他若来，我剥了他皮，抽了他筋，啃了他骨，吃了他心！饶他猴子瘦，我也把他剁鲊（zhǎ）着油烹！’”行者闻言，就气得抓耳挠腮，暴躁乱跳道：“是那个敢这等骂我！”八戒道：“哥哥息怒，是那黄袍怪这等骂来，我故学与你听也。”行者道：“贤弟，你起来。不是我去不成，既是妖精敢骂我，我就不能不降他，我和你去。老孙五百年前大闹天宫，普天的神将看见我，一个个控背躬身，口口称呼大圣。这妖怪无礼，他敢背前面后骂我！我这去，把他拿住，碎尸万段，以报骂我之仇！报毕，我即回来。”八戒道：“哥哥，正是，你只去拿了妖精，报了你仇，那时来与不来，任从尊意。”\n \n那猴才跳下崖，撞入洞里，脱了妖衣，整一整锦直裰，束一束虎皮裙，执了铁棒，径出门来。慌得那群猴拦住道：“大圣爷爷，你往那里去？带挈我们耍子几年也好。”行者道：“小的们，你说那里话！我保唐僧的这桩事，天上地下，都晓得孙悟空是唐僧的徒弟。他倒不是赶我回来，倒是教我来家看看，送我来家自在耍子。如今只因这件事，你们却都要仔细看守家业，依时插柳栽松，毋得废坠，待我还去保唐僧，取经回东土。功成之后，仍回来与你们共乐天真。”众猴各各领命。\n \n那大圣才和八戒携手驾云，离了洞，过了东洋大海，至西岸，住云光，叫道：“兄弟，你且在此慢行，等我下海去净净身子。”八戒道：“忙忙的走路，且净甚么身子？”行者道：“你那里知道，我自从回来，这几日弄得身上有些妖精气了。师父是个爱干净的，恐怕嫌我。”八戒于此始识得行者是片真心，更无他意。须臾洗毕，复驾云西进，只见那金塔放光，八戒指道：“那不是黄袍怪家？沙僧还在他家里。”行者道：“你在空中，等我下去看看那门前如何，好与妖精见阵。”八戒道：“不要去，妖精不在家。”行者道：“我晓得。”好猴王，按落祥光，径至洞门外观看，只见有两个小孩子，在那里使弯头棍，打毛球，抢窝（一种儿童游戏）耍子哩。一个有十来岁，一个有八九岁了。正戏处，被行者赶上前，也不管他是张家李家的，一把抓着顶搭子（孩童薙发时，留在头顶上的一撮头发），提将过来。那孩子吃了唬，口里夹骂带哭的乱嚷，惊动那波月洞的小妖，急报与公主道：\n \n“奶奶，不知甚人把二位公子抢去也！”原来那两个孩子是公主与那怪生的。公主闻言，忙忙走出洞门来，只见行者提着两个孩子，站在那高崖之上，意欲往下掼，慌得那公主厉声高叫道：\n \n“那汉子，我与你没甚相干，怎么把我儿子拿去？他老子利害，有些差错，决不与你干休！”行者道：“你不认得我？我是那唐僧的大徒弟孙悟空行者。我有个师弟沙和尚在你洞里，你去放他出来，我把这两个孩儿还你，似这般两个换一个，还是你便宜。”那公主闻言，急往里面，喝退那几个把门的小妖，亲动手，把沙僧解了。沙僧道：“公主，你莫解我，恐你那怪来家，问你要人，带累你受气。”公主道：“长老啊，你是我的恩人，你替我折辩了家书，救了我一命，我也留心放你。不期洞门之外，你有个大师兄孙悟空来了，叫我放你哩。”噫！那沙僧一闻孙悟空的三个字，好便似醍醐灌顶，甘露滋心，一面天生喜，满腔都是春，也不似闻得个人来，就如拾着一方金玉一般。你看他捽手佛衣，走出门来，对行者施礼道：“哥哥，你真是从天而降也！万乞救我一救！”行者笑道：“你这个沙尼！师父念《紧箍儿咒》，可肯替我方便一声？都弄嘴施展！要保师父，如何不走西方路，却在这里蹲甚么？”沙僧道：“哥哥，不必说了，君子既往不咎。我等是个败军之将，不可语勇，救我救儿罢！”行者道：“你上来。”\n \n沙僧才纵身跳上石崖。\n \n却说那八戒停立空中，看见沙僧出洞，即按下云头，叫声：\n \n“沙兄弟，心忍！心忍！”沙僧见身道：“二哥，你从那里来？”八戒道：“我昨日败阵，夜间进城，会了白马，知师父有难，被黄袍使法，变做个老虎。那白马与我商议，请师兄来的。”行者道：“呆子，且休叙阔，把这两个孩子，你两人抱着，先进那宝象城去激那怪来，等我在这里打他。”沙僧道：“哥啊，怎么样激他？”行者道：“你两个驾起云，站在那金銮殿上，莫分好歹，把那孩子往那白玉阶前一掼。有人问你是甚人，你便说是黄袍妖精的儿子，被我两个拿将来也。那怪听见，管情回来，我却不须进城与他斗了。若在城上厮杀，必要喷云嗳雾，播土扬尘，惊扰那朝廷与多官黎庶，俱不安也。”八戒笑道：“哥哥，你但干事，就左（这里是骗人、给人上当的意思）我们。”行者道：“如何为左你？”八戒道：“这两个孩子，被你抓来，已此唬破胆了，这一会声都哭哑，再一会必死无疑。我们拿他往下一掼，掼做个肉糰子，那怪赶上肯放？定要我两个偿命。你却还不是个干净人？连见证也没你，你却不是左我们？”行者道：“他若扯你，你两个就与他打将这里来。这里有战场宽阔，我在此等候打他。”沙僧道：“正是正是，大哥说得有理。我们去来。”他两个才倚仗威风，将孩子拿去。\n \n行者即跳下石崖，到他塔门之下，那公主道：“你这和尚，全无信义！你说放了你师弟，就与我孩儿，怎么你师弟放去，把我孩儿又留，反来我门首做甚？”行者陪笑道：“公主休怪，你来的日子已久，带你令郎去认他外公去哩。”公主道：“和尚莫无礼，我那黄袍郎比众不同。你若唬了我的孩儿，与他柳柳惊（压压惊的意思）是。”\n \n行者笑道：“公主啊，为人生在天地之间，怎么便是得罪？”\n \n公主道：“我晓得。”行者道：“你女流家，晓得甚么？”公主道：\n \n“我自幼在宫，曾受父母教训。记得古书云，五刑之属三千，而罪莫大于不孝。”行者道：“你正是个不孝之人。盖父兮生我，母兮鞠（jū，养育、抚养）我。哀哀父母，生我劬劳！故孝者，百行之原，万善之本，却怎么将身陪伴妖精，更不思念父母？非得不孝之罪如何？”公主闻此正言，半晌家耳红面赤，惭愧无地，忽失口道：“长老之言最善，我岂不思念父母？只因这妖精将我摄骗在此，他的法令又谨，我的步履又难，路远山遥，无人可传音信。欲要自尽，又恐父母疑我逃走，事终不明。故没奈何，苟延残喘，诚为天地间一大罪人也！”说罢，泪如泉涌。行者道：“公主不必伤悲。猪八戒曾告诉我，说你有一封书，曾救了我师父一命，你书上也有思念父母之意。老孙来，管与你拿了妖精，带你回朝见驾，别寻个佳偶，侍奉双亲到老，你意如何？”公主道：“和尚啊，你莫要寻死。昨者你两个师弟，那样好汉，也不曾打得过我黄袍郎。\n \n你这般一个筋多骨少的瘦鬼，一似个螃蟹模样，骨头都长在外面，有甚本事，你敢说拿妖魔之话？”行者笑道：“你原来没眼色，认不得人。俗语云：尿泡虽大无斤两，秤铊虽小压千斤。他们相貌，空大无用，走路抗风，穿衣费布，种火心空，顶门腰软，吃食无功。咱老孙小自小，筋节。”那公主道：“你真个有手段么？”行者道：“我的手段，你是也不曾看见，绝会降妖，极能伏怪。”公主道：“你却莫误了我耶。”行者道：“决然误你不得。”公主道：“你既会降妖伏怪，如今却怎样拿他？”行者说：“你且回避回避，莫在我这眼前，倘他来时，不好动手脚，只恐你与他情浓了，舍不得他。”公主道：“我怎的舍不得他？其稽留（停留。稽，jī）于此者，不得已耳！”行者道：“你与他做了十三年夫妻，岂无情意？我若见了他，不与他儿戏，一棍便是一棍，一拳便是一拳，须要打倒他，才得你回朝见驾。”\n \n那公主果然依行者之言，往僻静处躲避，也是他姻缘该尽，故遇着大圣来临。那猴王把公主藏了，他却摇身一变，就变做公主一般模样，回转洞中，专候那怪。\n \n却说八戒、沙僧，把两个孩子拿到宝象国中，往那白玉阶前捽下，可怜都掼做个肉饼相似，鲜血迸流，骨骸粉碎，慌得那满朝多官报道：“不好了！不好了！天上掼下两个人来了！”八戒厉声高叫道：“那孩子是黄袍妖精的儿子，被老猪与沙弟拿将来也！”\n \n那怪还在银安殿，宿酒未醒，正睡梦间，听得有人叫他名字，他就翻身，抬头观看，只见那云端里是猪八戒沙和尚二人吆喝。妖怪心中暗想道：“猪八戒便也罢了，沙和尚是我绑在家里，他怎么得出来？我的浑家，怎么肯放他？我的孩儿，怎么得到他手？这怕是猪八戒不得我出去与他交战，故将此计来羁我。我若认了这个泛头，就与他打啊，噫！我却还害酒哩！假若被他筑上一钯，却不灭了这个威风，识破了那个关窍，且等我回家看看，是我的儿子不是我的儿子，再与他说话不迟。”好妖怪，他也不辞王驾，转山林，径去洞中查信息。此时朝中已知他是个妖怪了，原来他夜里吃了一个宫娥，还有十七个脱命去的，五更时，奏了国王，说他如此如此。又因他不辞而去，越发知他是怪，那国王即着多官看守着假老虎不题。\n \n却说那怪径回洞口。行者见他来时，设法哄他，把眼挤了一挤，扑簌簌泪如雨落，儿天儿地的，跌脚捶胸，于此洞里嚎啕痛哭。那怪一时间那里认得？上前搂住道：“浑家，你有何事，这般烦恼？”那大圣编成的鬼话，捏出的虚词，泪汪汪的告道：\n \n“郎君啊！常言道，男子无妻财没主，妇女无夫身落空！你昨日进朝认亲，怎不回来？今早被猪八戒劫了沙和尚，又把我两个孩儿抢去，是我苦告，更不肯饶。他说拿去朝中认认外公，这半日不见孩儿，又不知存亡如何，你又不见来家，教我怎生割舍？\n \n故此止不住伤心痛哭。”那怪闻言，心中大怒道：“真个是我的儿子？”行者道：“正是，被猪八戒抢去了。”那妖魔气得乱跳道：\n \n“罢了！罢了！我儿被他掼杀了！已是不可活也！只好拿那和尚来与我儿子偿命报仇罢！浑家，你且莫哭，你如今心里觉道怎么？且医治一医治。”行者道：“我不怎的，只是舍不得孩儿，哭得我有些心疼。”妖魔道：“不打紧，你请起来，我这里有件宝贝，只在你那疼上摸一摸儿，就不疼了。却要仔细，休使大指儿弹着，若使大指儿弹着啊，就看出我本相来了”行者闻言，心中暗笑道：“这泼怪，倒也老实，不动刑法，就自家供了。等他拿出宝贝来，我试弹他一弹，看他是个甚么妖怪。”那怪携着行者，一直行到洞里深远密闭之处。却从口中吐出一件宝贝，有鸡子大小，是一颗舍利子玲珑内丹。行者心中暗喜道：“好东西耶！\n \n这件物不知打了多少坐工，炼了几年磨难，配了几转雌雄，炼成这颗内丹舍利。今日大有缘法，遇着老孙。”那猴子拿将过来，那里有甚么疼处，特故意摸了一摸，一指头弹将去。那妖慌了，劈手来抢，你思量，那猴子好不溜撒，把那宝贝一口吸在肚里。那妖魔攥着拳头就打，被行者一手隔住，把脸抹了一抹，现出本相，道声“妖怪！不要无礼！你且认认看我是谁？”那妖怪见了，大惊道：“呀！浑家，你怎么拿出这一副嘴脸来耶？”行者骂道：“我把你这个泼怪！谁是你浑家？连你祖宗也还不认得哩？”那怪忽然省悟道：“我象有些认得你哩。”行者道：“我且不打你，你再认认看。”那怪道：“我虽见你眼熟，一时间却想不起姓名。你果是谁，从那里来的？你把我浑家估倒（挪移、藏弄）在何处，却来我家诈诱我的宝贝？着实无礼！可恶！”行者道：“你是也不认得我。我是唐僧的大徒弟，叫做孙悟空行者。我是你五百年前的旧祖宗哩！”那怪道：“没有这话！没有这话！我拿住唐僧时，止知他有两个徒弟，叫做猪八戒、沙和尚，何曾见有人说个姓孙的。你不知是那里来的个怪物，到此骗我！”行者道：“我不曾同他二人来，是我师父因老孙惯打妖怪，杀伤甚多，他是个慈悲好善之人，将我逐回，故不曾同他一路行走。你是不知你祖宗名姓。”那怪道：“你好不丈夫啊！既受了师父赶逐，却有甚么嘴脸又来见人！”行者道：“你这个泼怪，岂知一日为师，终身为父，父子无隔宿之仇！你伤害我师父，我怎么不来救他？你害他便也罢，却又背前面后骂我，是怎的说？”妖怪道：“我何尝骂你？”行者道：“是猪八戒说的。”那怪道：“你不要信他，那个猪八戒，尖着嘴，有些会学老婆舌头，你怎听他？”行者道：“且不必讲此闲话，只说老孙今日到你家里，你好怠慢了远客。虽无酒馔（饮食、吃喝）款待，头却是有的，快快将头伸过来，等老孙打一棍儿当茶！”那怪闻得说打，呵呵大笑道：“孙行者，你差了计较了！你既说要打，不该跟我进来。我这里大小群妖，还有百十，饶你满身是手，也打不出我的门去。”行者道：“不要胡说！莫说百十个，就有几千、几万，只要一个个查明白了好打，棍棍无空，教你断根绝迹！”\n \n那怪闻言，急传号令，把那山前山后群妖，洞里洞外诸怪，一齐点起，各执器械，把那三四层门，密密拦阻不放。行者见了，满心欢喜，双手理棍，喝声叫“变！”变的三头六臂，把金箍棒幌一幌，变做三根金箍棒。你看他六只手，使着三根棒，一路打将去，好便似虎入羊群，鹰来鸡栅，可怜那小怪，汤着的，头如粉碎；刮着的，血似水流！往来纵横，如入无人之境。止剩一个老妖，赶出门来骂道：“你这泼猴，其实惫懒！怎么上门子欺负人家！”行者急回头，用手招呼道：“你来！你来！\n \n打倒你，才是功绩！”\n \n那怪物举宝刀，分头便砍，好行者，掣铁棒，觌面相迎。这一场在那山顶上，半云半雾的杀哩：大圣神通大，妖魔本事高。\n \n这个横理生金棒，那个斜举蘸钢刀。悠悠刀起明霞亮，轻轻棒架彩云飘。往来护顶翻多次，反复浑身转数遭。一个随风更面目，一个立地把身摇。那个大睁火眼伸猿膊，这个明幌金睛折虎腰。你来我去交锋战，刀迎棒架不相饶。猴王铁棍依三略，怪物钢刀按六韬。一个惯行手段为魔主，一个广施法力保唐僧。猛烈的猴王添猛烈，英豪的怪物长英豪。死生不顾空中打，都为唐僧拜佛遥。他两个战有五六十合，不分胜负。行者心中暗喜道：“这个泼怪，他那口刀，倒也抵得住老孙的这根棒。等老孙丢个破绽与他，看他可认得。”好猴王，双手举棍，使一个高探马的势子。那怪不识是计，见有空儿，舞着宝刀，径奔下三路砍，被行者急转个大中平，挑开他那口刀，又使个叶底偷桃势，望妖精头顶一棍，就打得他无影无踪，急收棍子看处，不见了妖精，行者大惊道：“我儿啊，不禁打，就打得不见了。果是打死，好道也有些脓血，如何没一毫踪影？想是走了。”急纵身跳在云端里看处，四边更无动静。“老孙这双眼睛，不管那里，一抹都见，却怎么走得这等溜撒？我晓得了：那怪说有些儿认得我，想必不是凡间的怪，多是天上来的精。”\n \n那大圣一时忍不住怒发，攥着铁棒，打个筋斗，只跳到南天门上。慌得那庞刘苟毕、张陶邓辛等众，两边躬身控背，不敢拦阻，让他打入天门，直至通明殿下。早有张葛许邱四大天师问道：“大圣何来？”行者道：“因保唐僧至宝象国，有一妖魔，欺骗国女，伤害吾师，老孙与他赌斗。正斗间，不见了这怪。想那怪不是凡间之怪，多是天上之精，特来查勘，那一路走了甚么妖神。”天师闻言，即进灵霄殿上启奏，蒙差查勘九曜星官、十二元辰、东西南北中央五斗、河汉群辰、五岳四渎、普天神圣都在天上，更无一个敢离方位。又查那斗牛宫外，二十八宿，颠倒只有二十七位，内独少了奎（kuí）星。天师回奏道：“奎木狼下界了。”\n \n玉帝道：“多少时不在天了？”天师道：“四卯不到。三日点卯一次，今已十三日了。”玉帝道：“天上十三日，下界已是十三年。”\n \n即命本部收他上界。那二十七宿星员，领了旨意，出了天门，各念咒语，惊动奎星。你道他在那里躲避？他原来是孙大圣大闹天宫时打怕了的神将，闪在那山涧里潜灾，被水气隐住妖云，所以不曾看见他。他听得本部星员念咒，方敢出头，随众上界。\n \n被大圣拦住天门要打，幸亏众星劝住，押见玉帝。那怪腰间取出金牌，在殿下叩头纳罪，玉帝道：“奎木狼，上界有无边的胜景，你不受用，却私走一方，何也？”奎宿叩头奏道：“万岁，赦臣死罪。那宝象国王公主，非凡人也。他本是披香殿侍香的玉女，因欲与臣私通，臣恐点污了天宫胜境，他思凡先下界去，托生于皇宫内院，是臣不负前期，变作妖魔，占了名山，摄他到洞府，与他配了一十三年夫妻。一饮一啄，莫非前定，今被孙大圣到此成功。”玉帝闻言，收了金牌，贬他去兜率宫与太上老君烧火，带俸差操，有功复职，无功重加其罪。行者见玉帝如此发放，心中欢喜，朝上唱个大喏，又向众神道：“列位，起动了。”天师笑道：“那个猴子还是这等村俗，替他收了怪神，也倒不谢天恩，却就喏喏而退。”玉帝道：“只得他无事，落得天上清平是幸。”\n \n那大圣按落祥光，径转碗子山波月洞，寻出公主，将那思凡下界收妖的言语正然陈诉，只听得半空中八戒、沙僧厉声高叫道：“师兄，有妖精，留几个儿我们打耶。”行者道：“妖精已尽绝矣。”沙僧道：“既把妖精打绝，无甚挂碍，将公主引入朝中去罢。不要睁眼，兄弟们使个缩地法来。”那公主只闻得耳内风响，霎时间径回城里。他三人将公主带上金銮殿上，那公主参拜了父王、母后，会了姊妹，各官俱来拜见。那公主才启奏道：\n \n“多亏孙长老法力无边，降了黄袍怪，救奴回国。”那国王问曰：\n \n“黄袍是个甚怪？”行者道：“陛下的驸马，是上界的奎星，令爱乃侍香的玉女，因思凡降落人间，不非小可，都因前世前缘，该有这些姻眷。那怪被老孙上天宫启奏玉帝，玉帝查得他四卯不到，下界十三日，就是十三年了，盖天上一日，下界一年。随差本部星宿，收他上界，贬在兜率宫立功去讫，老孙却救得令爱来也。”那国王谢了行者的恩德，便教：“看你师父去来。”\n \n他三人径下宝殿，与众官到朝房里，抬出铁笼，将假虎解了铁索。别人看他是虎，独行者看他是人。原来那师父被妖术魇住，不能行走，心上明白，只是口眼难开。行者笑道：“师父啊，你是个好和尚，怎么弄出这般个恶模样来也？你怪我行凶作恶，赶我回去，你要一心向善，怎么一旦弄出个这等嘴脸？”\n \n八戒道：“哥啊，救他一救罢，不要只管揭挑（揭露别人的短处他了。”行者道：“你凡事撺唆，是他个得意的好徒弟，你不救他，又寻老孙怎的？原与你说来，待降了妖精，报了骂我之仇，就回去的。”沙僧近前跪下道：“哥啊，古人云，不看僧面看佛面。兄长既是到此，万望救他一救。若是我们能救，也不敢许远的来奉请你也。”行者用手挽起道：“我岂有安心不救之理？快取水来。”那八戒飞星去驿中，取了行李马匹，将紫金钵盂取出，盛水半盂，递与行者。\n \n行者接水在手，念动真言，望那虎劈头一口喷上，退了妖术，解了虎气。长老现了原身，定性睁睛，才认得是行者，一把搀住道：“悟空！你从那里来也？”沙僧侍立左右，把那请行者降妖精，救公主，解虎气，并回朝上项事，备陈了一遍。三藏谢之不尽道：“贤徒，亏了你也！亏了你也！这一去，早诣西方，径回东土，奏唐王，你的功劳第一。”行者笑道：“莫说莫说！但不念那话儿，足感爱厚之情也。”国王闻此言，又劝谢了他四众，整治素筵，大开东阁。他师徒受了皇恩，辞王西去，国王又率多官远送。这正是：\n \n君回宝殿定江山，僧去雷音参佛祖。\n毕竟不知此后又有甚事，几时得到西天，且听下回分解。",
      "extracted_info": {
        "background": "唐僧被黄袍怪变为老虎，猪八戒用激将法请回孙悟空相救。悟空设计激怒黄袍怪并与之交战，最终发现黄袍怪是奎木狼下凡。玉帝将其收服后，悟空救出公主并解除唐僧的妖术，众人继续西行。",
        "characters": [
          {
            "name": "孙悟空",
            "description": "唐僧大徒弟，神通广大，机智善战，能识破妖怪变化，与黄袍怪激战后上天庭查明其身份。"
          },
          {
            "name": "猪八戒",
            "description": "唐僧二徒弟，性格呆懒，以激将法骗孙悟空出山救师，战斗中常显胆怯。"
          },
          {
            "name": "沙僧",
            "description": "唐僧三徒弟，被黄袍怪所擒，后被悟空救出，忠诚稳重。"
          },
          {
            "name": "唐僧",
            "description": "被黄袍怪施法变为老虎，后被悟空解救恢复原身。"
          },
          {
            "name": "黄袍怪（奎木狼）",
            "description": "原为天上奎木狼星，下凡与披香殿玉女转世的宝象国公主结为夫妻，法力高强，最终被玉帝收归天庭。"
          },
          {
            "name": "宝象国三公主",
            "description": "前世为披香殿玉女，被黄袍怪摄走成亲，暗中助唐僧脱困，后被悟空救回国。"
          },
          {
            "name": "白龙马",
            "description": "唐僧坐骑，曾化身宫娥试图刺杀黄袍怪未果，通知八戒求援。"
          }
        ],
        "extracted_intermediate_reasoning": ""
      },
      "generated_levels": [
        {
          "level": 1,
          "description": "猪八戒在水帘洞用激将法激怒孙悟空，谎称黄袍怪辱骂孙悟空。需要化解悟空对师父的怨气，说服他出山救师。",
          "pass_condition": "成功激发孙悟空出战意愿",
          "hints": [
            "如何利用孙悟空的骄傲性格突破心防？",
            "黄袍怪骂孙悟空的哪些话最能戳中痛点？",
            "怎样用唐僧遇险的信息掩盖激将法的真实意图？"
          ]
        },
        {
          "level": 2,
          "description": "孙悟空在波月洞遭遇黄袍怪与公主所生二子，需要利用人质交换解救沙僧。",
          "pass_condition": "完成沙僧与孩童的交换",
          "hints": [
            "如何利用孩童身份增加谈判筹码？",
            "公主见到孩子被掳会有怎样的连锁反应？",
            "沙僧被囚位置与洞府结构有何关联？"
          ]
        },
        {
          "level": 3,
          "description": "孙悟空变化为公主模样骗取黄袍怪信任，需识破妖怪真身并夺取内丹。",
          "pass_condition": "夺取奎木狼的舍利子玲珑内丹",
          "hints": [
            "妖怪的致命弱点藏在哪个身体部位？",
            "如何通过对话发现宝贝使用禁忌？",
            "变化术维持时要注意哪些细节避免穿帮？"
          ]
        },
        {
          "level": 4,
          "description": "天庭查证奎木狼下凡真相，需突破二十八宿防线直达通明殿。",
          "pass_condition": "促使玉帝派遣二十七宿收服奎木狼",
          "hints": [
            "如何利用天宫点卯制度发现星官缺失？",
            "奎木狼与披香殿玉女的前缘有何破绽？",
            "南天门守卫对闹天宫往事会有何种反应？"
          ]
        },
        {
          "level": 5,
          "description": "解除唐僧虎形妖术，需在朝堂证明师父清白。",
          "pass_condition": "成功恢复唐僧人形并获得国王信任",
          "hints": [
            "紫金钵盂取水方位有何特殊要求？",
            "如何破除魇胜之术的时间限制？",
            "文武百官目睹虎变人形的关键证据是什么？"
          ]
        }
      ]
    }
  ]
}